RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_eth.c
/**
 *******************************************************************************
 * @file  hc32f4a0_eth.c
 * @brief This file provides firmware functions to manage the Ethernet MAC
 *        Controller(ETH).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Yangjp          First version
   2020-07-03       Yangjp          Optimize stc_eth_mac_init_t structure
   2020-08-11       Yangjp          Fixed a known potential risk in ETH_Init function
   2020-09-04       Yangjp          Optimize timeout handling in functions
   2020-11-26       Yangjp          Fixed a known potential risk in ETH_DMA_GetReceiveFrame_Interrupt function
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f4a0_eth.h"
#include "hc32f4a0_utility.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_ETH ETH
 * @brief Initial Configuration Driver Library
 * @{
 */

#if (DDL_ETH_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup ETH_Local_Macros ETH Local Macros
 * @{
 */

/* Ethernet MAC_IFCONFR register Mask */
#define ETH_MAC_IFCONFR_CLEAR_MASK                          (ETH_MAC_IFCONFR_RCKINV | ETH_MAC_IFCONFR_TCKINV)

/* Ethernet MAC_CONFIGR register Mask */
#define ETH_MAC_CONFIGR_CLEAR_MASK                          (0x72CF7EF0UL)

/* Ethernet MAC_FLOCTLR register Mask */
#define ETH_MAC_FLOCTLR_CLEAR_MASK                          (0xFFFF00BEUL)

/* Ethernet MAC_FLTCTLR register Mask */
#define ETH_MAC_FLTCTLR_CLEAR_MASK                          (0x802107FFUL)

/* Ethernet MAC_SMIADDR register Mask */
#define ETH_MAC_SMIADDR_CLEAR_MASK                          (0x0000FFC3UL)

/* Ethernet DMA_BUSMODR register Mask */
#define ETH_DMA_BUSMODR_CLEAR_MASK                          (0x0FFFFFFEUL)

/* Ethernet DMA_OPRMODR register Mask */
#define ETH_DMA_OPRMODR_CLEAR_MASK                          (0x0721C0FCUL)

/* Ethernet PTP_TSPCTLR register Mask */
#define ETH_PTP_TSPCTLR_CLEAR_MASK                          (0x0007FE02UL)

/* Ethernet MAC Address byte length */
#define ETH_MAC_ADDRESS_BYTE_LENGTH                         (6U)

/* Ethernet DMA Tx descriptors Collision Count Shift */
#define ETH_DMATXDESC_COLLISION_COUNTSHIFT                  (3UL)

/* Ethernet DMA Rx descriptors Frame Length Shift */
#define ETH_DMARXDESC_FRAME_LENGTHSHIFT                     (16UL)

/* Ethernet DMA Tx/Rx descriptors Buffer2 Size Shift */
#define ETH_DMADESC_BUFFER2_SIZESHIFT                       (16UL)

/* Ethernet Remote Wake-up frame register length */
#define ETH_WAKEUP_REGISTER_LENGTH                          (8U)

/* Ethernet PTP PPS channel 1 time register address Shift */
#define ETH_PTP_PPS1_TIME_REG_ADDRSHIFT                     (0x64U)

/* Wait timeout(ms) */
#define ETH_TIMEOUT_WRITE_REGISTER                          (50UL)
#define ETH_TIMEOUT_SOFTWARE_RESET                          (200UL)
#define ETH_TIMEOUT_LINK_STATUS                             (500UL)
#define ETH_TIMEOUT_AUTONEGO_COMPLETE                       (1000UL)


/**
 * @defgroup ETH_MAC_Address_Register ETH MAC Address Register
 * @brief Get the specified register address of the ETH MAC Address
 * @{
 */
#define ETH_MAC_MACADHRx(__SHIFT__)         ((uint32_t)(&(M4_ETH->MAC_MACADHR0)) + (uint32_t)(__SHIFT__))
#define ETH_MAC_MACADLRx(__SHIFT__)         ((uint32_t)(&(M4_ETH->MAC_MACADLR0)) + (uint32_t)(__SHIFT__))
/**
 * @}
 */

/**
 * @defgroup ETH_PTP_Register ETH PTP Register
 * @brief Get the specified register address of the ETH PTP PPS channel
 * @{
 */
#define ETH_PTP_TMTSECRx(__SHIFT__)         ((uint32_t)(&(M4_ETH->PTP_TMTSECR0)) + (uint32_t)(__SHIFT__))
#define ETH_PTP_TMTNSERx(__SHIFT__)         ((uint32_t)(&(M4_ETH->PTP_TMTNSER0)) + (uint32_t)(__SHIFT__))
/**
 * @}
 */

/**
 * @defgroup ETH_Check_Parameters_Validity ETH Check Parameters Validity
 * @{
 */
#define IS_ETH_PHY_ADDRESS(x)                               ((x) < 0x20U)

#define IS_ETH_PHY_REGISTER(x)                              ((x) < 0x20U)

#define IS_ETH_AUTO_NEGOTIATION(x)                                             \
(   ((x) == ETH_AUTO_NEGOTIATION_DISABLE)                   ||                 \
    ((x) == ETH_AUTO_NEGOTIATION_ENABLE))

#define IS_ETH_MAC_CHECKSUM_MODE(x)                                            \
(   ((x) == ETH_MAC_CHECKSUM_MODE_SOFTWARE)                 ||                 \
    ((x) == ETH_MAC_CHECKSUM_MODE_HARDWARE))

#define IS_ETH_RX_MODE(x)                                                      \
(   ((x) == ETH_RX_MODE_POLLING)                            ||                 \
    ((x) == ETH_RX_MODE_INTERRUPT))

#define IS_ETH_MAC_MEDIA_INTERFACE(x)                                          \
(   ((x) == ETH_MAC_MEDIA_INTERFACE_MII)                    ||                 \
    ((x) == ETH_MAC_MEDIA_INTERFACE_RMII))

#define IS_ETH_MAC_SPEED(x)                                                    \
(   ((x) == ETH_MAC_SPEED_10M)                              ||                 \
    ((x) == ETH_MAC_SPEED_100M))

#define IS_ETH_MAC_DUPLEX_MODE(x)                                              \
(   ((x) == ETH_MAC_MODE_HALFDUPLEX)                        ||                 \
    ((x) == ETH_MAC_MODE_FULLDUPLEX))

#define IS_ETH_MAC_TX_CLK_POLARITY(x)                                          \
(   ((x) == ETH_MAC_TX_CLK_POLARITY_KEEP)                   ||                 \
    ((x) == ETH_MAC_TX_CLK_POLARITY_INVERSE))

