RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_eth.c
#define IS_ETH_MAC_RX_REF_CLK_POLARITY(x)                                      \
(   ((x) == ETH_MAC_RX_REF_CLK_POLARITY_KEEP)               ||                 \
    ((x) == ETH_MAC_RX_REF_CLK_POLARITY_INVERSE))

#define IS_ETH_MAC_SA_MODE(x)                                                  \
(   ((x) == ETH_MAC_SA_MODE_BY_DMATXDESC)                   ||                 \
    ((x) == ETH_MAC_SA_MODE_INSTER_MACADDR0)                ||                 \
    ((x) == ETH_MAC_SA_MODE_REPLACE_MACADDR0)               ||                 \
    ((x) == ETH_MAC_SA_MODE_INSTER_MACADDR1)                ||                 \
    ((x) == ETH_MAC_SA_MODE_REPLACE_MACADDR1))

#define IS_ETH_MAC_TYPEFRAME_STRIP_FCS(x)                                      \
(   ((x) == ETH_MAC_TYPEFRAME_STRIP_FCS_DISABLE)            ||                 \
    ((x) == ETH_MAC_TYPEFRAME_STRIP_FCS_ENABLE))

#define IS_ETH_MAC_WATCHDOG(x)                                                 \
(   ((x) == ETH_MAC_WATCHDOG_DISABLE)                       ||                 \
    ((x) == ETH_MAC_WATCHDOG_ENABLE))

#define IS_ETH_MAC_JABBER(x)                                                   \
(   ((x) == ETH_MAC_JABBER_DISABLE)                         ||                 \
    ((x) == ETH_MAC_JABBER_ENABLE))

#define IS_ETH_MAC_INTERFRAME_GAP(x)                                           \
(   ((x) == ETH_MAC_INTERFRAME_GAP_96BIT)                   ||                 \
    ((x) == ETH_MAC_INTERFRAME_GAP_88BIT)                   ||                 \
    ((x) == ETH_MAC_INTERFRAME_GAP_80BIT)                   ||                 \
    ((x) == ETH_MAC_INTERFRAME_GAP_72BIT)                   ||                 \
    ((x) == ETH_MAC_INTERFRAME_GAP_64BIT)                   ||                 \
    ((x) == ETH_MAC_INTERFRAME_GAP_56BIT)                   ||                 \
    ((x) == ETH_MAC_INTERFRAME_GAP_48BIT)                   ||                 \
    ((x) == ETH_MAC_INTERFRAME_GAP_40BIT))

#define IS_ETH_MAC_CARRIER_SENCE(x)                                            \
(   ((x) == ETH_MAC_CARRIER_SENCE_DISABLE)                  ||                 \
    ((x) == ETH_MAC_CARRIER_SENCE_ENABLE))

#define IS_ETH_MAC_RECEIVE_OWN(x)                                              \
(   ((x) == ETH_MAC_RECEIVE_OWN_DISABLE)                    ||                 \
    ((x) == ETH_MAC_RECEIVE_OWN_ENABLE))

#define IS_ETH_MAC_CHECKSUM_OFFLAOD(x)                                         \
(   ((x) == ETH_MAC_CHECKSUM_OFFLAOD_DISABLE)               ||                 \
    ((x) == ETH_MAC_CHECKSUM_OFFLAOD_ENABLE))

#define IS_ETH_MAC_RETRY_TRANSMIT(x)                                           \
(   ((x) == ETH_MAC_RETRY_TRANSMIT_DISABLE)                 ||                 \
    ((x) == ETH_MAC_RETRY_TRANSMIT_ENABLE))

#define IS_ETH_MAC_AUTO_STRIP_PAD_FCS(x)                                       \
(   ((x) == ETH_MAC_AUTO_STRIP_PAD_FCS_DISABLE)             ||                 \
    ((x) == ETH_MAC_AUTO_STRIP_PAD_FCS_ENABLE))

#define IS_ETH_MAC_BACKOFF_LIMIT(x)                                            \
(   ((x) == ETH_MAC_BACKOFF_LIMIT_10)                       ||                 \
    ((x) == ETH_MAC_BACKOFF_LIMIT_8)                        ||                 \
    ((x) == ETH_MAC_BACKOFF_LIMIT_4)                        ||                 \
    ((x) == ETH_MAC_BACKOFF_LIMIT_1))

#define IS_ETH_MAC_DEFFERRAL_CHECK(x)                                          \
(   ((x) == ETH_MAC_DEFFERRAL_CHECK_DISABLE)                ||                 \
    ((x) == ETH_MAC_DEFFERRAL_CHECK_ENABLE))

#define IS_ETH_MAC_ZERO_QUANTA_PAUSE(x)                                        \
(   ((x) == ETH_MAC_ZERO_QUANTA_PAUSE_DISABLE)              ||                 \
    ((x) == ETH_MAC_ZERO_QUANTA_PAUSE_ENABLE))

#define IS_ETH_MAC_PAUSE_LOWTHRESHOLD(x)                                       \
(   ((x) == ETH_MAC_PAUSE_LOWTHRESHOLD_MINUS4)              ||                 \
    ((x) == ETH_MAC_PAUSE_LOWTHRESHOLD_MINUS28)             ||                 \
    ((x) == ETH_MAC_PAUSE_LOWTHRESHOLD_MINUS144)            ||                 \
    ((x) == ETH_MAC_PAUSE_LOWTHRESHOLD_MINUS256))

#define IS_ETH_MAC_UNICAST_PAUSEFRAME_DETECT(x)                                \
(   ((x) == ETH_MAC_UNICAST_PAUSEFRAME_DETECT_DISABLE)      ||                 \
    ((x) == ETH_MAC_UNICAST_PAUSEFRAME_DETECT_ENABLE))

#define IS_ETH_MAC_RECEIVE_FLOWCONTROL(x)                                      \
(   ((x) == ETH_MAC_RECEIVE_FLOWCONTROL_DISABLE)            ||                 \
    ((x) == ETH_MAC_RECEIVE_FLOWCONTROL_ENABLE))

#define IS_ETH_MAC_TRANSMIT_FLOWCONTROL(x)                                     \
(   ((x) == ETH_MAC_TRANSMIT_FLOWCONTROL_DISABLE)           ||                 \
    ((x) == ETH_MAC_TRANSMIT_FLOWCONTROL_ENABLE))

#define IS_ETH_MAC_RECEIVE_All(x)                                              \
(   ((x) == ETH_MAC_RECEIVE_All_DISABLE)                    ||                 \
    ((x) == ETH_MAC_RECEIVE_ALL_ENABLE))

#define IS_ETH_MAC_DROP_NOT_TCPUDP(x)                                          \
(   ((x) == ETH_MAC_DROP_NOT_TCPUDP_DISABLE)                ||                 \
    ((x) == ETH_MAC_DROP_NOT_TCPUDP_ENABLE))

#define IS_ETH_MAC_VLAN_TAG_FILTER(x)                                          \
(   ((x) == ETH_MAC_VLAN_TAG_FILTER_DISABLE)                ||                 \
    ((x) == ETH_MAC_VLAN_TAG_FILTER_ENABLE))

#define IS_ETH_MAC_SOURCE_ADDR_FILTER(x)                                       \
(   ((x) == ETH_MAC_SOURCE_ADDR_FILTER_DISABLE)             ||                 \
    ((x) == ETH_MAC_SOURCE_ADDR_FILTER_NORMAL)              ||                 \
    ((x) == ETH_MAC_SOURCE_ADDR_FILTER_INVERSE))

#define IS_ETH_MAC_PASS_CTRLFRAME(x)                                           \
(   ((x) == ETH_MAC_PASS_CTRLFRAME_BLOCK_ALL)               ||                 \
    ((x) == ETH_MAC_PASS_CTRLFRAME_FORWARD_NOTPAUSE_ALL)    ||                 \
    ((x) == ETH_MAC_PASS_CTRLFRAME_FORWARD_ALL)             ||                 \
    ((x) == ETH_MAC_PASS_CTRLFRAME_FORWARD_PASSADDRFILTER))

