RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_eth.c
#define IS_ETH_MAC_BROADCASTFRAME_RECEPTION(x)                                 \
(   ((x) == ETH_MAC_BROADCASTFRAME_RECEPTION_DISABLE)       ||                 \
    ((x) == ETH_MAC_BROADCASTFRAME_RECEPTION_ENABLE))

#define IS_ETH_MAC_DESTINATION_ADDR_FILTER(x)                                  \
(   ((x) == ETH_MAC_DESTINATION_ADDR_FILTER_NORMAL)         ||                 \
    ((x) == ETH_MAC_DESTINATION_ADDR_FILTER_INVERSE))

#define IS_ETH_MAC_MULTICASTFRAME_FILTER(x)                                    \
(   ((x) == ETH_MAC_MULTICASTFRAME_FILTER_NONE)             ||                 \
    ((x) == ETH_MAC_MULTICASTFRAME_FILTER_PERFECT)          ||                 \
    ((x) == ETH_MAC_MULTICASTFRAME_FILTER_HASHTABLE)        ||                 \
    ((x) == ETH_MAC_MULTICASTFRAME_FILTER_PERFECTHASHTABLE))

#define IS_ETH_MAC_UNICASTFRAME_FILTER(x)                                      \
(   ((x) == ETH_MAC_UNICASTFRAME_FILTER_PERFECT)            ||                 \
    ((x) == ETH_MAC_UNICASTFRAME_FILTER_HASHTABLE)          ||                 \
    ((x) == ETH_MAC_UNICASTFRAME_FILTER_PERFECTHASHTABLE))

#define IS_ETH_MAC_PROMISCUOUS_MODE(x)                                         \
(   ((x) == ETH_MAC_PROMISCUOUS_MODE_DISABLE)               ||                 \
    ((x) == ETH_MAC_PROMISCUOUS_MODE_ENABLE))

#define IS_ETH_MAC_TXVLAN_MODE(x)                                              \
(   ((x) == ETH_MAC_TXVLAN_MODE_BY_DMATXDESC)               ||                 \
    ((x) == ETH_MAC_TXVLAN_MODE_BYPASS)                     ||                 \
    ((x) == ETH_MAC_TXVLAN_MODE_REMOVE_TAG)                 ||                 \
    ((x) == ETH_MAC_TXVLAN_MODE_INSERT_TAG)                 ||                 \
    ((x) == ETH_MAC_TXVLAN_MODE_REPLACE_TAG))

#define IS_ETH_MAC_RXVLAN_FILTER(x)                                            \
(   ((x) == ETH_MAC_RXVLAN_FILTER_NORMAL)                   ||                 \
    ((x) == ETH_MAC_RXVLAN_FILTER_INVERSE)                  ||                 \
    ((x) == ETH_MAC_RXVLAN_FILTER_NORMAL_HASHTABLE)         ||                 \
    ((x) == ETH_MAC_RXVLAN_FILTER_INVERSE_HASHTABLE))

#define IS_ETH_MAC_RXVLAN_COMPARISON(x)                                        \
(   ((x) == ETH_MAC_RXVLAN_COMPARISON_16BIT)                ||                 \
    ((x) == ETH_MAC_RXVLAN_COMPARISON_12BIT))

#define IS_ETH_MAC_L4_DESTPORT_FILTER(x)                                       \
(   ((x) == ETH_MAC_L4_DESTPORT_FILTER_DISABLE)             ||                 \
    ((x) == ETH_MAC_L4_DESTPORT_FILTER_NORMAL)              ||                 \
    ((x) == ETH_MAC_L4_DESTPORT_FILTER_INVERSE))

#define IS_ETH_MAC_L4_SOURCEPORT_FILTER(x)                                     \
(   ((x) == ETH_MAC_L4_SOURCEPORT_FILTER_DISABLE)           ||                 \
    ((x) == ETH_MAC_L4_SOURCEPORT_FILTER_NORMAL)            ||                 \
    ((x) == ETH_MAC_L4_SOURCEPORT_FILTER_INVERSE))

#define IS_ETH_MAC_L4_PORT_FILTER_PROTOCOL(x)                                  \
(   ((x) == ETH_MAC_L4_PORT_FILTER_PROTOCOL_TCP)            ||                 \
    ((x) == ETH_MAC_L4_PORT_FILTER_PROTOCOL_UDP))

#define IS_ETH_MAC_L3_DA_FILTER_MASK(x)                                        \
(   ((x) | ETH_MAC_L34CTLR_L3HDBM) == ETH_MAC_L34CTLR_L3HDBM)

#define IS_ETH_MAC_L3_SA_FILTER_MASK(x)                                        \
(   ((x) | ETH_MAC_L34CTLR_L3HSBM) == ETH_MAC_L34CTLR_L3HSBM)

#define IS_ETH_MAC_L3_DA_SA_FILTER_MASK(x)                                     \
(   0UL == ((x) & ((uint32_t)(~(ETH_MAC_L34CTLR_L3HSBM      |                  \
                                ETH_MAC_L34CTLR_L3HDBM_0    |                  \
                                ETH_MAC_L34CTLR_L3HDBM_1)))))

#define IS_ETH_MAC_L3_DA_FILTER(x)                                             \
(   ((x) == ETH_MAC_L3_DA_FILTER_DISABLE)                   ||                 \
    ((x) == ETH_MAC_L3_DA_FILTER_NORMAL)                    ||                 \
    ((x) == ETH_MAC_L3_DA_FILTER_INVERSE))

#define IS_ETH_MAC_L3_SA_FILTER(x)                                             \
(   ((x) == ETH_MAC_L3_SA_FILTER_DISABLE)                   ||                 \
    ((x) == ETH_MAC_L3_SA_FILTER_NORMAL)                    ||                 \
    ((x) == ETH_MAC_L3_SA_FILTER_INVERSE))

#define IS_ETH_MAC_L3_ADDR_FILTER_PROTOCOL(x)                                  \
(   ((x) == ETH_MAC_L3_ADDR_FILTER_PROTOCOL_IPV4)           ||                 \
    ((x) == ETH_MAC_L3_ADDR_FILTER_PROTOCOL_IPV6))

#define IS_ETH_MAC_INTERRUPT_FLAG(x)                                           \
(   (0UL != (x))                                            &&                 \
    (0UL == ((x) & ((uint32_t)(~(ETH_MAC_INT_FLAG_TSPIS     |                  \
                                 ETH_MAC_INT_FLAG_MMCTXIS   |                  \
                                 ETH_MAC_INT_FLAG_MMCRXIS   |                  \
                                 ETH_MAC_INT_FLAG_MMCIS     |                  \
                                 ETH_MAC_INT_FLAG_PMTIS))))))

#define IS_ETH_MAC_INTERRUPT(x)                                                \
(   (0UL != (x))                                            &&                 \
    (0UL == ((x) & ((uint32_t)(~(ETH_MAC_INT_TSPIM          |                  \
                                 ETH_MAC_INT_PMTIM))))))

#define IS_ETH_MAC_ADDRESS_NORMAL_INDEX(x)                                     \
(   ((x) == ETH_MAC_ADDRESS0)                               ||                 \
    ((x) == ETH_MAC_ADDRESS1)                               ||                 \
    ((x) == ETH_MAC_ADDRESS2)                               ||                 \
    ((x) == ETH_MAC_ADDRESS3)                               ||                 \
    ((x) == ETH_MAC_ADDRESS4))

#define IS_ETH_MAC_ADDRESS_SPECIAL_INDEX(x)                                    \
(   ((x) == ETH_MAC_ADDRESS1)                               ||                 \
    ((x) == ETH_MAC_ADDRESS2)                               ||                 \
    ((x) == ETH_MAC_ADDRESS3)                               ||                 \
    ((x) == ETH_MAC_ADDRESS4))

#define IS_ETH_MAC_ADDRESS_FILTER(x)                                           \
(   ((x) == ETH_MAC_ADDRESS_FILTER_DISABLE)                 ||                 \
    ((x) == ETH_MAC_ADDRESS_FILTER_PERFECT_DA)              ||                 \
    ((x) == ETH_MAC_ADDRESS_FILTER_PERFECT_SA))

#define IS_ETH_MAC_ADDRESS_MASK(x)                                             \
(   ((x) | ETH_MAC_ADDRESS_MASK_ALL) == ETH_MAC_ADDRESS_MASK_ALL)

#define IS_ETH_DMA_DESC_SKIP_LENGTH(x)                      ((x) < 0x20U)

