RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_eth.c
#define IS_ETH_DMA_BURST_MODE(x)                                               \
(   ((x) == ETH_DMA_BURST_MODE_NORMAL)                      ||                 \
    ((x) == ETH_DMA_BURST_MODE_FIXED)                       ||                 \
    ((x) == ETH_DMA_BURST_MODE_MIXED))

#define IS_ETH_DMA_ADDRESS_ALIGN(x)                                            \
(   ((x) == ETH_DMA_ADDRESS_ALIGN_DISABLE)                  ||                 \
    ((x) == ETH_DMA_ADDRESS_ALIGN_ENABLE))

#define IS_ETH_DMA_RX_BURST_LENGTH(x)                                          \
(   ((x) == ETH_DMA_RX_BURST_LENGTH_1BEAT)                  ||                 \
    ((x) == ETH_DMA_RX_BURST_LENGTH_2BEAT)                  ||                 \
    ((x) == ETH_DMA_RX_BURST_LENGTH_4BEAT)                  ||                 \
    ((x) == ETH_DMA_RX_BURST_LENGTH_8BEAT)                  ||                 \
    ((x) == ETH_DMA_RX_BURST_LENGTH_16BEAT)                 ||                 \
    ((x) == ETH_DMA_RX_BURST_LENGTH_32BEAT)                 ||                 \
    ((x) == ETH_DMA_RX_BURST_LENGTH_8XPBL_8BEAT)            ||                 \
    ((x) == ETH_DMA_RX_BURST_LENGTH_8XPBL_16BEAT)           ||                 \
    ((x) == ETH_DMA_RX_BURST_LENGTH_8XPBL_32BEAT)           ||                 \
    ((x) == ETH_DMA_RX_BURST_LENGTH_8XPBL_64BEAT)           ||                 \
    ((x) == ETH_DMA_RX_BURST_LENGTH_8XPBL_128BEAT)          ||                 \
    ((x) == ETH_DMA_RX_BURST_LENGTH_8XPBL_256BEAT))

#define IS_ETH_DMA_TX_BURST_LENGTH(x)                                          \
(   ((x) == ETH_DMA_TX_BURST_LENGTH_1BEAT)                  ||                 \
    ((x) == ETH_DMA_TX_BURST_LENGTH_2BEAT)                  ||                 \
    ((x) == ETH_DMA_TX_BURST_LENGTH_4BEAT)                  ||                 \
    ((x) == ETH_DMA_TX_BURST_LENGTH_8BEAT)                  ||                 \
    ((x) == ETH_DMA_TX_BURST_LENGTH_16BEAT)                 ||                 \
    ((x) == ETH_DMA_TX_BURST_LENGTH_32BEAT)                 ||                 \
    ((x) == ETH_DMA_TX_BURST_LENGTH_8XPBL_8BEAT)            ||                 \
    ((x) == ETH_DMA_TX_BURST_LENGTH_8XPBL_16BEAT)           ||                 \
    ((x) == ETH_DMA_TX_BURST_LENGTH_8XPBL_32BEAT)           ||                 \
    ((x) == ETH_DMA_TX_BURST_LENGTH_8XPBL_64BEAT)           ||                 \
    ((x) == ETH_DMA_TX_BURST_LENGTH_8XPBL_128BEAT)          ||                 \
    ((x) == ETH_DMA_TX_BURST_LENGTH_8XPBL_256BEAT))

#define IS_ETH_DMA_ENHANCE_DESCRIPTOR(x)                                       \
(   ((x) == ETH_DMA_ENHANCE_DESCRIPTOR_DISABLE)             ||                 \
    ((x) == ETH_DMA_ENHANCE_DESCRIPTOR_ENABLE))

#define IS_ETH_DMA_PRIORITY_ARBITRATION(x)                                     \
(   ((x) == ETH_DMA_ARBITRATION_LOOP_RXTX_1_1)              ||                 \
    ((x) == ETH_DMA_ARBITRATION_LOOP_RXTX_2_1)              ||                 \
    ((x) == ETH_DMA_ARBITRATION_LOOP_RXTX_3_1)              ||                 \
    ((x) == ETH_DMA_ARBITRATION_LOOP_RXTX_4_1)              ||                 \
    ((x) == ETH_DMA_ARBITRATION_LOOP_TXRX_1_1)              ||                 \
    ((x) == ETH_DMA_ARBITRATION_LOOP_TXRX_2_1)              ||                 \
    ((x) == ETH_DMA_ARBITRATION_LOOP_TXRX_3_1)              ||                 \
    ((x) == ETH_DMA_ARBITRATION_LOOP_TXRX_4_1)              ||                 \
    ((x) == ETH_DMA_ARBITRATION_FIXED_RXPRIORTX)            ||                 \
    ((x) == ETH_DMA_ARBITRATION_FIXED_TXPRIORRX))

#define IS_ETH_DMA_DROP_CHECKSUM_ERRORFRAME(x)                                 \
(   ((x) == ETH_DMA_DROP_CHECKSUM_ERRORFRAME_DISABLE)       ||                 \
    ((x) == ETH_DMA_DROP_CHECKSUM_ERRORFRAME_ENABLE))

#define IS_ETH_DMA_RECEIVE_STORE_FORWARD(x)                                    \
(   ((x) == ETH_DMA_RECEIVE_STORE_FORWARD_DISABLE)          ||                 \
    ((x) == ETH_DMA_RECEIVE_STORE_FORWARD_ENABLE))

#define IS_ETH_DMA_FLUSH_RECEIVEDFRAME(x)                                      \
(   ((x) == ETH_DMA_FLUSH_RECEIVEDFRAME_DISABLE)            ||                 \
    ((x) == ETH_DMA_FLUSH_RECEIVEDFRAME_ENABLE))

#define IS_ETH_DMA_TRANSMIT_STORE_FORWARD(x)                                   \
(   ((x) == ETH_DMA_TRANSMIT_STORE_FORWARD_DISABLE)         ||                 \
    ((x) == ETH_DMA_TRANSMIT_STORE_FORWARD_ENABLE))

#define IS_ETH_DMA_TRANSMIT_THRESHOLD(x)                                       \
(   ((x) == ETH_DMA_TRANSMIT_THRESHOLD_64BYTE)              ||                 \
    ((x) == ETH_DMA_TRANSMIT_THRESHOLD_128BYTE)             ||                 \
    ((x) == ETH_DMA_TRANSMIT_THRESHOLD_192BYTE)             ||                 \
    ((x) == ETH_DMA_TRANSMIT_THRESHOLD_256BYTE)             ||                 \
    ((x) == ETH_DMA_TRANSMIT_THRESHOLD_40BYTE)              ||                 \
    ((x) == ETH_DMA_TRANSMIT_THRESHOLD_32BYTE)              ||                 \
    ((x) == ETH_DMA_TRANSMIT_THRESHOLD_24BYTE)              ||                 \
    ((x) == ETH_DMA_TRANSMIT_THRESHOLD_16BYTE))

#define IS_ETH_DMA_FORWARD_ERRORFRAME(x)                                       \
(   ((x) == ETH_DMA_FORWARD_ERRORFRAME_DISABLE)             ||                 \
    ((x) == ETH_DMA_FORWARD_ERRORFRAME_ENABLE))

#define IS_ETH_DMA_FORWARD_UNDERSIZE_GOODFRAME(x)                              \
(   ((x) == ETH_DMA_FORWARD_UNDERSIZE_GOODFRAME_DISABLE)    ||                 \
    ((x) == ETH_DMA_FORWARD_UNDERSIZE_GOODFRAME_ENABLE))

#define IS_ETH_DMA_DROP_JUMBO_FRAME(x)                                         \
(   ((x) == ETH_DMA_DROP_JUMBO_FRAME_DISABLE)               ||                 \
    ((x) == ETH_DMA_DROP_JUMBO_FRAME_ENABLE))

#define IS_ETH_DMA_RECEIVE_THRESHOLD(x)                                        \
(   ((x) == ETH_DMA_RECEIVE_THRESHOLD_64BYTE)               ||                 \
    ((x) == ETH_DMA_RECEIVE_THRESHOLD_32BYTE)               ||                 \
    ((x) == ETH_DMA_RECEIVE_THRESHOLD_96BYTE)               ||                 \
    ((x) == ETH_DMA_RECEIVE_THRESHOLD_128BYTE))

#define IS_ETH_DMA_SECONDFRAME_OPERARTE(x)                                     \
(   ((x) == ETH_DMA_SECONDFRAME_OPERARTE_DISABLE)           ||                 \
    ((x) == ETH_DMA_SECONDFRAME_OPERARTE_ENABLE))

#define IS_ETH_DMA_INTERRUPT(x)                                                \
(   (0UL != (x))                                            &&                 \
    (0UL == ((x) & ((uint32_t)(~(ETH_DMA_INT_NIE            |                  \
                                 ETH_DMA_INT_AIE            |                  \
                                 ETH_DMA_INT_ERE            |                  \
                                 ETH_DMA_INT_FBE            |                  \
                                 ETH_DMA_INT_ETE            |                  \
                                 ETH_DMA_INT_RWE            |                  \
                                 ETH_DMA_INT_RSE            |                  \
                                 ETH_DMA_INT_RUE            |                  \
                                 ETH_DMA_INT_RIE            |                  \
                                 ETH_DMA_INT_UNE            |                  \
                                 ETH_DMA_INT_OVE            |                  \
                                 ETH_DMA_INT_TJE            |                  \
                                 ETH_DMA_INT_TUE            |                  \
                                 ETH_DMA_INT_TSE            |                  \
                                 ETH_DMA_INT_TIE))))))

#define IS_ETH_DMA_FLAG(x)                                                     \
(   (0UL != (x))                                            &&                 \
    (0UL == ((x) & ((uint32_t)(~(ETH_DMA_FLAG_PTPS          |                  \
                                 ETH_DMA_FLAG_PMTS          |                  \
                                 ETH_DMA_FLAG_MMCS          |                  \
                                 ETH_DMA_FLAG_NIS           |                  \
                                 ETH_DMA_FLAG_AIS           |                  \
                                 ETH_DMA_FLAG_ERS           |                  \
                                 ETH_DMA_FLAG_FBS           |                  \
                                 ETH_DMA_FLAG_ETS           |                  \
                                 ETH_DMA_FLAG_RWS           |                  \
                                 ETH_DMA_FLAG_RSS           |                  \
                                 ETH_DMA_FLAG_RUS           |                  \
                                 ETH_DMA_FLAG_RIS           |                  \
                                 ETH_DMA_FLAG_UNS           |                  \
                                 ETH_DMA_FLAG_OVS           |                  \
                                 ETH_DMA_FLAG_TJS           |                  \
                                 ETH_DMA_FLAG_TUS           |                  \
                                 ETH_DMA_FLAG_TSS           |                  \
                                 ETH_DMA_FLAG_TIS))))))

