RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_eth.c
#define IS_ETH_DMA_MISS_FRAME_TYPE(x)                                          \
(   ((x) == ETH_DMA_OVERFLOW_RXFIFO_COUNTER)                ||                 \
    ((x) == ETH_DMA_OVERFLOW_MISSFRAME_COUNTER))

#define IS_ETH_DMATXDESC_BUFFER_SIZE(x)                    ((x) <= 0x1FFFFFFFUL)

#define IS_ETH_DMATXDESC_CHECKSUM_CONTROL(x)                                   \
(   ((x) == ETH_DMATXDESC_CHECKSUM_BYPASS)                  ||                 \
    ((x) == ETH_DMATXDESC_CHECKSUM_IPV4HEADER)              ||                 \
    ((x) == ETH_DMATXDESC_CHECKSUM_TCPUDPICMP_SEGMENT)      ||                 \
    ((x) == ETH_DMATXDESC_CHECKSUM_TCPUDPICMP_FULL))

#define IS_ETH_DMATXDESC_VLAN_CONTROL(x)                                       \
(   ((x) == ETH_DMATXDESC_VLAN_BYPASS)                      ||                 \
    ((x) == ETH_DMATXDESC_VLAN_REMOVE_TAG)                  ||                 \
    ((x) == ETH_DMATXDESC_VLAN_INSERT_TAG)                  ||                 \
    ((x) == ETH_DMATXDESC_VLAN_REPLACE_TAG))

#define IS_ETH_DMATXDESC_SA_CONTROL(x)                                         \
(   ((x) == ETH_DMATXDESC_SA_BYPASS)                        ||                 \
    ((x) == ETH_DMATXDESC_SA_INSTER_MACADDR0)               ||                 \
    ((x) == ETH_DMATXDESC_SA_REPLACE_MACADDR0)              ||                 \
    ((x) == ETH_DMATXDESC_SA_INSTER_MACADDR1)               ||                 \
    ((x) == ETH_DMATXDESC_SA_REPLACE_MACADDR1))

#define IS_ETH_DMATXDESC_STATUS(x)                                             \
(   (0UL != (x))                                            &&                 \
    (0UL == ((x) & ((uint32_t)(~(ETH_DMATXDESC_OWN          |                  \
                                 ETH_DMATXDESC_IOC          |                  \
                                 ETH_DMATXDESC_TLS          |                  \
                                 ETH_DMATXDESC_TFS          |                  \
                                 ETH_DMATXDESC_DCRC         |                  \
                                 ETH_DMATXDESC_DPAD         |                  \
                                 ETH_DMATXDESC_TTSE         |                  \
                                 ETH_DMATXDESC_CRCR         |                  \
                                 ETH_DMATXDESC_TER          |                  \
                                 ETH_DMATXDESC_TSAC         |                  \
                                 ETH_DMATXDESC_TTSS         |                  \
                                 ETH_DMATXDESC_IHE          |                  \
                                 ETH_DMATXDESC_ETSUM        |                  \
                                 ETH_DMATXDESC_JTE          |                  \
                                 ETH_DMATXDESC_FFF          |                  \
                                 ETH_DMATXDESC_TPCE         |                  \
                                 ETH_DMATXDESC_LOCE         |                  \
                                 ETH_DMATXDESC_NCE          |                  \
                                 ETH_DMATXDESC_TLCE         |                  \
                                 ETH_DMATXDESC_ECE          |                  \
                                 ETH_DMATXDESC_VLF          |                  \
                                 ETH_DMATXDESC_EDE          |                  \
                                 ETH_DMATXDESC_UDE          |                  \
                                 ETH_DMATXDESC_DEE))))))

#define IS_ETH_DMARXDESC_STATUS(x)                                             \
(   (0UL != (x))                                            &&                 \
    (0UL == ((x) & ((uint32_t)(~(ETH_DMARXDESC_OWN          |                  \
                                 ETH_DMARXDESC_DAF          |                  \
                                 ETH_DMARXDESC_ERSUM        |                  \
                                 ETH_DMARXDESC_DPE          |                  \
                                 ETH_DMARXDESC_SAF          |                  \
                                 ETH_DMARXDESC_LEE          |                  \
                                 ETH_DMARXDESC_OVE          |                  \
                                 ETH_DMARXDESC_VLAT         |                  \
                                 ETH_DMARXDESC_RFS          |                  \
                                 ETH_DMARXDESC_RLS          |                  \
                                 ETH_DMARXDESC_IPE_TSPA_GF  |                  \
                                 ETH_DMARXDESC_RLCE         |                  \
                                 ETH_DMARXDESC_FRAT         |                  \
                                 ETH_DMARXDESC_WTE          |                  \
                                 ETH_DMARXDESC_REE          |                  \
                                 ETH_DMARXDESC_DBE          |                  \
                                 ETH_DMARXDESC_CRE          |                  \
                                 ETH_DMARXDESC_DAS_ESA))))))

#define IS_ETH_DMARXDESC_EXTEND_STATUS(x)                                      \
(   (0UL != (x))                                            &&                 \
    (0UL == ((x) & ((uint32_t)(~(ETH_DMARXDESC_L4FMS        |                  \
                                 ETH_DMARXDESC_L3FMS        |                  \
                                 ETH_DMARXDESC_TSPD         |                  \
                                 ETH_DMARXDESC_PTPV         |                  \
                                 ETH_DMARXDESC_PTPFT        |                  \
                                 ETH_DMARXDESC_IPV6DR       |                  \
                                 ETH_DMARXDESC_IPV4DR       |                  \
                                 ETH_DMARXDESC_IPCB         |                  \
                                 ETH_DMARXDESC_IPPE         |                  \
                                 ETH_DMARXDESC_IPHE))))))

#define IS_ETH_DMADESC_OWN(x)                                                  \
(   ((x) == ETH_DMADESC_OWN_CPU)                            ||                 \
    ((x) == ETH_DMADESC_OWN_DMA))

