RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_eth.c
#define IS_ETH_DMADESC_BUFFER(x)                                               \
(   ((x) == ETH_DMADESC_BUFFER1)                            ||                 \
    ((x) == ETH_DMADESC_BUFFER2))

#define IS_ETH_PMT_FLAG(x)                                                     \
(   (0UL != (x))                                            &&                 \
    (0UL == ((x) & ((uint32_t)(~(ETH_PMT_FLAG_RTWKFR        |                  \
                                 ETH_PMT_FLAG_WKFR          |                  \
                                 ETH_PMT_FLAG_MPFR))))))

#define IS_ETH_MMC_COUNTER_PRESETMODE(x)                                       \
(   ((x) == ETH_MMC_COUNTER_PRESETMODE_DISABLE)             ||                 \
    ((x) == ETH_MMC_COUNTER_PRESETMODE_HALFVALUE)           ||                 \
    ((x) == ETH_MMC_COUNTER_PRESETMODE_FULLVALUE))

#define IS_ETH_MMC_READ_RESET(x)                                               \
(   ((x) == ETH_MMC_READ_RESET_ENABLE)                      ||                 \
    ((x) == ETH_MMC_READ_RESET_DISABLE))

#define IS_ETH_MMC_COUNTER_RELOAD(x)                                           \
(   ((x) == ETH_MMC_COUNTER_RELOAD_ENABLE)                  ||                 \
    ((x) == ETH_MMC_COUNTER_RELOAD_DISABLE))

#define IS_ETH_MMC_TX_INTERRUPT(x)                                             \
(   (0UL != (x))                                            &&                 \
    (0UL == ((x) & ((uint32_t)(~(ETH_MMC_INT_TXEDEIM        |                  \
                                 ETH_MMC_INT_TXUGIM         |                  \
                                 ETH_MMC_INT_TXCAEIM        |                  \
                                 ETH_MMC_INT_TXECEIM        |                  \
                                 ETH_MMC_INT_TXLCEIM        |                  \
                                 ETH_MMC_INT_TXDEEIM        |                  \
                                 ETH_MMC_INT_TXMGIM         |                  \
                                 ETH_MMC_INT_TXBGIM))))))

#define IS_ETH_MMC_RX_INTERRUPT(x)                                             \
(   (0UL != (x))                                            &&                 \
    (0UL == ((x) & ((uint32_t)(~(ETH_MMC_INT_RXOEIM         |                  \
                                 ETH_MMC_INT_RXLEIM         |                  \
                                 ETH_MMC_INT_RXUGIM         |                  \
                                 ETH_MMC_INT_RXREIM         |                  \
                                 ETH_MMC_INT_RXAEIM         |                  \
                                 ETH_MMC_INT_RXCEIM         |                  \
                                 ETH_MMC_INT_RXMGIM         |                  \
                                 ETH_MMC_INT_RXBGIM))))))

#define IS_ETH_MMC_TX_FLAG(x)                                                  \
(   (0UL != (x))                                            &&                 \
    (0UL == ((x) & ((uint32_t)(~(ETH_MMC_FLAG_TXEDEIS       |                  \
                                 ETH_MMC_FLAG_TXUGIS        |                  \
                                 ETH_MMC_FLAG_TXCAEIS       |                  \
                                 ETH_MMC_FLAG_TXECEIS       |                  \
                                 ETH_MMC_FLAG_TXLCEIS       |                  \
                                 ETH_MMC_FLAG_TXDEEIS       |                  \
                                 ETH_MMC_FLAG_TXMGIS        |                  \
                                 ETH_MMC_FLAG_TXBGIS))))))

#define IS_ETH_MMC_RX_FLAG(x)                                                  \
(   (0UL != (x))                                            &&                 \
    (0UL == ((x) & ((uint32_t)(~(ETH_MMC_FLAG_RXOEIS        |                  \
                                 ETH_MMC_FLAG_RXLEIS        |                  \
                                 ETH_MMC_FLAG_RXUGIS        |                  \
                                 ETH_MMC_FLAG_RXREIS        |                  \
                                 ETH_MMC_FLAG_RXAEIS        |                  \
                                 ETH_MMC_FLAG_RXCEIS        |                  \
                                 ETH_MMC_FLAG_RXMGIS        |                  \
                                 ETH_MMC_FLAG_RXBGIS))))))

#define IS_ETH_MMC_REG(x)                                                      \
(   ((x) == ETH_MMC_REG_TXBRGFR)                            ||                 \
    ((x) == ETH_MMC_REG_TXMUGFR)                            ||                 \
    ((x) == ETH_MMC_REG_TXDEEFR)                            ||                 \
    ((x) == ETH_MMC_REG_TXLCEFR)                            ||                 \
    ((x) == ETH_MMC_REG_TXECEFR)                            ||                 \
    ((x) == ETH_MMC_REG_TXCAEFR)                            ||                 \
    ((x) == ETH_MMC_REG_TXUNGFR)                            ||                 \
    ((x) == ETH_MMC_REG_TXEDEFR)                            ||                 \
    ((x) == ETH_MMC_REG_RXBRGFR)                            ||                 \
    ((x) == ETH_MMC_REG_RXMUGFR)                            ||                 \
    ((x) == ETH_MMC_REG_RXCREFR)                            ||                 \
    ((x) == ETH_MMC_REG_RXALEFR)                            ||                 \
    ((x) == ETH_MMC_REG_RXRUEFR)                            ||                 \
    ((x) == ETH_MMC_REG_RXUNGFR)                            ||                 \
    ((x) == ETH_MMC_REG_RXLEEFR)                            ||                 \
    ((x) == ETH_MMC_REG_RXOREFR))

#define IS_ETH_PTP_FRAME_DA_FILTER(x)                                          \
(   ((x) == ETH_PTP_FRAME_DA_FILTER_ENABLE)                 ||                 \
    ((x) == ETH_PTP_FRAME_DA_FILTER_DISABLE))

#define IS_ETH_PTP_DATAGRAM_VERSION(x)                                         \
(   ((x) == ETH_PTP_DATAGRAM_VERSION_IEEE1588V1)            ||                 \
    ((x) == ETH_PTP_DATAGRAM_VERSION_IEEE1588V2))

#define IS_ETH_PTP_SUBSECOND_SCALE(x)                                          \
(   ((x) == ETH_PTP_SUBSECOND_SCALE_HEX)                    ||                 \
    ((x) == ETH_PTP_SUBSECOND_SCALE_DEC))

