RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_eth.c
#define IS_ETH_PTP_DATAGRAM_TYPE(x)                                            \
(   ((x) == ETH_PTP_DATAGRAM_TYPE_SYNC_FOLLOW_DELAY)        ||                 \
    ((x) == ETH_PTP_DATAGRAM_TYPE_SYNC)                     ||                 \
    ((x) == ETH_PTP_DATAGRAM_TYPE_DELAY)                    ||                 \
    ((x) == ETH_PTP_DATAGRAM_TYPE_SYNC_FOLLOW_DELAY_PDELAY) ||                 \
    ((x) == ETH_PTP_DATAGRAM_TYPE_SYNC_PDELAY)              ||                 \
    ((x) == ETH_PTP_DATAGRAM_TYPE_DELAY_PDEALY)             ||                 \
    ((x) == ETH_PTP_DATAGRAM_TYPE_SYNC_DELAY)               ||                 \
    ((x) == ETH_PTP_DATAGRAM_TYPE_PDELAY))

#define IS_ETH_PTP_FRAME_TYPE(x)                                               \
(   (0UL != (x))                                            &&                 \
    (0UL == ((x) & ((uint32_t)(~(ETH_PTP_FRAME_TYPE_IPV4FRAME       |          \
                                 ETH_PTP_FRAME_TYPE_IPV6FRAME       |          \
                                 ETH_PTP_FRAME_TYPE_ETHERNETFRAME   |          \
                                 ETH_PTP_FRAME_TYPE_ALL_RECEIVEFRAME))))))

#define IS_ETH_PTP_CALIBRATION_MODE(x)                                         \
(   ((x) == ETH_PTP_CALIBRATION_MODE_COARSE)                ||                 \
    ((x) == ETH_PTP_CALIBRATION_MODE_FINE))

#define IS_ETH_PTP_TIME_UPDATE_SIGN(x)                                         \
(   ((x) == ETH_PTP_TIME_UPDATE_SIGN_MINUS)                 ||                 \
    ((x) == ETH_PTP_TIME_UPDATE_SIGN_PLUS))

#define IS_ETH_PTP_FLAG(x)                                                     \
(   (0UL != (x))                                            &&                 \
    (0UL == ((x) & ((uint32_t)(~(ETH_PTP_FLAG_TSERR1        |                  \
                                 ETH_PTP_FLAG_TSTAR1        |                  \
                                 ETH_PTP_FLAG_TSERR0        |                  \
                                 ETH_PTP_FLAG_TSTAR0        |                  \
                                 ETH_PTP_FLAG_TSOVF))))))

#define IS_ETH_PPS1_COMPLEX_FUNC(ch, mode, freq)                               \
(   ((ch)    == ETH_PPS_TARGET_CH0)                         ||                 \
    (((mode) == ETH_PPS_OUTPUT_MODE_CONTINUE)               &&                 \
    ((freq)  == ETH_PPS_OUTPUT_ONE_PULSE)))

#define IS_ETH_PTP_SUB_SECOND(x)                            ((x) <= 0x7FFFFFFFUL)

#define IS_ETH_PPS_TARGET_TIME_FUNC(x)                                         \
(   ((x) == ETH_PPS_TARGET_TIME_FUNC_INT_EVENT)             ||                 \
    ((x) == ETH_PPS_TARGET_TIME_FUNC_INT_PPS_EVENT)         ||                 \
    ((x) == ETH_PPS_TARGET_TIME_FUNC_PPS_EVENT))

#define IS_ETH_PPS_TARGET_CH(x)                                                \
(   ((x) == ETH_PPS_TARGET_CH0)                             ||                 \
    ((x) == ETH_PPS_TARGET_CH1))

#define IS_ETH_PPS_OUTPUT_MODE(x)                                              \
(   ((x) == ETH_PPS_OUTPUT_MODE_CONTINUE)                   ||                 \
    ((x) == ETH_PPS_OUTPUT_MODE_SINGLE))

#define IS_ETH_PPS_OUTPUT_FREQ(x)                                              \
(   ((x) == ETH_PPS_OUTPUT_FREQ_1HZ)                        ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_2HZ)                        ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_4HZ)                        ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_8HZ)                        ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_16HZ)                       ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_32HZ)                       ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_64HZ)                       ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_128HZ)                      ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_256HZ)                      ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_512HZ)                      ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_1024HZ)                     ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_2048HZ)                     ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_4096HZ)                     ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_8192HZ)                     ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_16384HZ)                    ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_32768HZ)                    ||                 \
    ((x) == ETH_PPS_OUTPUT_ONE_PULSE))
/**
 * @}
 */

/**
 * @}
 */


/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup ETH_Global_Functions ETH Global Functions
 * @{
 */

/**
 * @brief  De-Initialize ETH.
 * @param  None
 * @retval An en_result_t enumeration value:
 *           - Ok: De-Initialize success
 *           - ErrorTimeout: De-Initialize timeout
 */
en_result_t ETH_DeInit(void)
{
    en_result_t enRet;

    ETH_MAC_DeInit();
    ETH_DMA_DeInit();
    ETH_MACADDR_DeInit(ETH_MAC_ADDRESS0);
    ETH_MACADDR_DeInit(ETH_MAC_ADDRESS1);
    ETH_MACADDR_DeInit(ETH_MAC_ADDRESS2);
    ETH_MACADDR_DeInit(ETH_MAC_ADDRESS3);
    ETH_MACADDR_DeInit(ETH_MAC_ADDRESS4);
    ETH_MAC_L3L4FilterDeInit();
    ETH_PTP_DeInit();
    ETH_PPS_DeInit(ETH_PPS_TARGET_CH0);
    ETH_PPS_DeInit(ETH_PPS_TARGET_CH1);
    enRet = ETH_MMC_DeInit();
    if (Ok == enRet)
    {
        enRet = ETH_DMA_SoftwareReset();
    }

    return enRet;
}

/**
 * @brief  Initialize ETH.
 * @param  [in] pstcEthHandle               Pointer to a @ref stc_eth_handle_t structure
 * @param  [in] pstcEthInit                 Pointer to a @ref stc_eth_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: ETH Initialize success
 *           - ErrorInvalidParameter: pstcEthHandle == NULL or pstcEthInit == NULL or
 *                                    PHY Address error
 *           - ErrorTimeout: Initialize timeout
 */
en_result_t ETH_Init(stc_eth_handle_t *pstcEthHandle, stc_eth_init_t *pstcEthInit)
{
    __IO uint32_t u32Count;
    en_result_t enRet = Ok;
    uint32_t u32TempReg;
    uint32_t u32BusClk;
    uint32_t u32PhyTimeout;
    uint16_t u16PhyReg = 0U;

    if ((NULL == pstcEthHandle) || (NULL == pstcEthInit))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_AUTO_NEGOTIATION(pstcEthHandle->stcCommInit.u16AutoNegotiation));
        DDL_ASSERT(IS_ETH_MAC_CHECKSUM_MODE(pstcEthHandle->stcCommInit.u32ChecksumMode));
        DDL_ASSERT(IS_ETH_RX_MODE(pstcEthHandle->stcCommInit.u32RxMode));
        DDL_ASSERT(IS_ETH_MAC_MEDIA_INTERFACE(pstcEthHandle->stcCommInit.u32MediaInterface));

        /* Select MII or RMII Mode*/
        MODIFY_REG32(M4_ETH->MAC_IFCONFR, ETH_MAC_IFCONFR_IFSEL, pstcEthHandle->stcCommInit.u32MediaInterface);
        /* ETH software reset */
        if (Ok != ETH_DMA_SoftwareReset())
        {
            enRet = ErrorTimeout;
        }
        else
        {
            /* Get ETH frequency value */
            u32BusClk = SystemCoreClock / (0x01UL << (READ_REG32_BIT(M4_CMU->SCFGR, CMU_SCFGR_PCLK1S) >> CMU_SCFGR_PCLK1S_POS));
            /* Set SMIC bits depending on PCLK1 clock value */
            /* PCLK1 Clock Range between 20-35 MHz */
            if ((u32BusClk >= 20000000UL) && (u32BusClk < 35000000UL))
            {
                u32TempReg = ETH_MAC_SMIADDR_SMIC_1;
            }
            /* PCLK1 Clock Range between 35-60 MHz */
            else if ((u32BusClk >= 35000000UL) && (u32BusClk < 60000000UL))
            {
                u32TempReg = ETH_MAC_SMIADDR_SMIC_1 | ETH_MAC_SMIADDR_SMIC_0;
            }
            /* PCLK1 Clock Range between 60-100 MHz */
            else if ((u32BusClk >= 60000000UL) && (u32BusClk < 100000000UL))
            {
                u32TempReg = 0UL;
            }
            /* PCLK1 Clock Range between 100-120 MHz */
            else
            {
                u32TempReg = ETH_MAC_SMIADDR_SMIC_0;
            }
            /* Configure the ETH MDC Clock Range */
            MODIFY_REG32(M4_ETH->MAC_SMIADDR, ETH_MAC_SMIADDR_SMIC, u32TempReg);

            /* PHY initialization and configuration */
            /* Reset the PHY */
            if (Ok != (ETH_PHY_WriteRegister(pstcEthHandle, PHY_BCR, PHY_SOFT_RESET)))
            {
                enRet = ErrorTimeout;
            }
            else
            {
                /* Delay to assure PHY reset */
                DDL_DelayMS(PHY_RESET_DELAY);

                if (ETH_AUTO_NEGOTIATION_DISABLE != pstcEthHandle->stcCommInit.u16AutoNegotiation)
                {
                    u32PhyTimeout = PHY_READ_TIMEOUT * (HCLK_VALUE / 20000UL);
                    /* Wait for linke status */
                    u32Count = ETH_TIMEOUT_LINK_STATUS * (HCLK_VALUE / 20000UL);
                    while (PHY_LINK_STATUS != (u16PhyReg & PHY_LINK_STATUS))
                    {
                        if (0UL == u32Count)
                        {
                            break;
                        }
                        if (ErrorTimeout == ETH_PHY_ReadRegister(pstcEthHandle, PHY_BSR, &u16PhyReg))
                        {
                            u32Count = (u32Count > u32PhyTimeout) ? (u32Count - u32PhyTimeout) : 0UL;
                        }
                        else
                        {
                            u32Count = (u32Count > u32PhyTimeout) ? (u32Count - (u32PhyTimeout / 150U)) : 0UL;
                        }
                    }

                    if ((0x0000U == u16PhyReg) || (0xFFFFU == u16PhyReg))
                    {
                        enRet = ErrorInvalidParameter;
                    }
                    else if (PHY_LINK_STATUS != (u16PhyReg & PHY_LINK_STATUS))
                    {
                        enRet = ErrorTimeout;
                    }
                    else
                    {
                        /* Enable Auto-Negotiation */
                        if (Ok != (ETH_PHY_WriteRegister(pstcEthHandle, PHY_BCR, PHY_AUTONEGOTIATION)))
                        {
                            enRet = ErrorTimeout;
                        }
                        else
                        {
                            /* Wait until the auto-negotiation will be completed */
                            u32Count = ETH_TIMEOUT_AUTONEGO_COMPLETE * (HCLK_VALUE / 20000UL);
                            while (PHY_AUTONEGO_COMPLETE != (u16PhyReg & PHY_AUTONEGO_COMPLETE))
                            {
                                if (0UL == u32Count)
                                {
                                    break;
                                }
                                if (ErrorTimeout == ETH_PHY_ReadRegister(pstcEthHandle, PHY_BSR, &u16PhyReg))
                                {
                                    u32Count = (u32Count > u32PhyTimeout) ? (u32Count - u32PhyTimeout) : 0UL;
                                }
                                else
                                {
                                    u32Count = (u32Count > u32PhyTimeout) ? (u32Count - (u32PhyTimeout / 150U)) : 0UL;
                                }
                            }

                            if (PHY_AUTONEGO_COMPLETE != (u16PhyReg & PHY_AUTONEGO_COMPLETE))
                            {
                                enRet = ErrorTimeout;
                            }
                            else
                            {
                                /* Read the result of the auto-negotiation */
                                /* Configure ETH duplex mode according to the result of automatic negotiation */
                                if (0U != (u16PhyReg & (uint16_t)(PHY_100BASE_TX_FD | PHY_10BASE_T_FD)))
                                {
                                    pstcEthHandle->stcCommInit.u32DuplexMode = ETH_MAC_MODE_FULLDUPLEX;
                                }
                                else
                                {
                                    pstcEthHandle->stcCommInit.u32DuplexMode = ETH_MAC_MODE_HALFDUPLEX;
                                }

                                /* Configure ETH speed according to the result of automatic negotiation */
                                if (0U != (u16PhyReg & (uint16_t)(PHY_100BASE_TX_FD | PHY_100BASE_TX_HD)))
                                {
                                    pstcEthHandle->stcCommInit.u32Speed = ETH_MAC_SPEED_100M;
                                }
                                else
                                {
                                    pstcEthHandle->stcCommInit.u32Speed = ETH_MAC_SPEED_10M;
                                }
                            }
                        }
                    }
                }
                /* AutoNegotiation Disable */
                else
                {
                    DDL_ASSERT(IS_ETH_MAC_SPEED(pstcEthHandle->stcCommInit.u32Speed));
                    DDL_ASSERT(IS_ETH_MAC_DUPLEX_MODE(pstcEthHandle->stcCommInit.u32DuplexMode));

                    if (Ok != ETH_PHY_WriteRegister(pstcEthHandle, PHY_BCR,
                                                    ((uint16_t)(pstcEthHandle->stcCommInit.u32DuplexMode >> 3U) |
                                                    (uint16_t)(pstcEthHandle->stcCommInit.u32Speed >> 1U))))
                    {
                        enRet = ErrorTimeout;
                    }
                    else
                    {
                        /* Delay to assure PHY configuration */
                        DDL_DelayMS(PHY_CONFIG_DELAY);
                    }
                }
            }

            /* Auto-negotiation failed */
            if (Ok != enRet)
            {
                pstcEthHandle->stcCommInit.u32DuplexMode = ETH_MAC_MODE_FULLDUPLEX;
                pstcEthHandle->stcCommInit.u32Speed      = ETH_MAC_SPEED_100M;
            }

