RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_eth.c
            /* Config checksum offload */
            if(ETH_MAC_CHECKSUM_MODE_HARDWARE == pstcEthHandle->stcCommInit.u32ChecksumMode)
            {
                pstcEthInit->stcMacInit.u32ChecksumOffload = ETH_MAC_CHECKSUM_OFFLAOD_ENABLE;
            }
            else
            {
                pstcEthInit->stcMacInit.u32ChecksumOffload = ETH_MAC_CHECKSUM_OFFLAOD_DISABLE;
            }

            /* Config MAC,DMA,MMC and PTP */
            (void)ETH_MAC_Init(pstcEthHandle, &pstcEthInit->stcMacInit);
            (void)ETH_DMA_Init(&pstcEthInit->stcDmaInit);
            /* Enable the ETH Rx Interrupt */
            if(ETH_RX_MODE_INTERRUPT == pstcEthHandle->stcCommInit.u32RxMode)
            {
                ETH_DMA_IntCmd(ETH_DMA_INT_NIE | ETH_DMA_INT_RIE, Enable);
            }
        }
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_eth_comm_init_t to default values.
 * @param  [out] pstcCommInit               Pointer to a @ref stc_eth_comm_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Structure Initialize success
 *           - ErrorInvalidParameter: pstcCommInit == NULL
 */
en_result_t ETH_CommStructInit(stc_eth_comm_init_t *pstcCommInit)
{
    en_result_t enRet = Ok;

    if (NULL == pstcCommInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcCommInit->u16AutoNegotiation = ETH_AUTO_NEGOTIATION_ENABLE;
        pstcCommInit->u16PHYAddress      = PHY_ADDRESS;
        pstcCommInit->au8MACAddr[0]      = ETH_MAC_ADDR0;
        pstcCommInit->au8MACAddr[1]      = ETH_MAC_ADDR1;
        pstcCommInit->au8MACAddr[2]      = ETH_MAC_ADDR2;
        pstcCommInit->au8MACAddr[3]      = ETH_MAC_ADDR3;
        pstcCommInit->au8MACAddr[4]      = ETH_MAC_ADDR4;
        pstcCommInit->au8MACAddr[5]      = ETH_MAC_ADDR5;
        pstcCommInit->u32MediaInterface  = ETH_MAC_MEDIA_INTERFACE_MII;
        pstcCommInit->u32Speed           = ETH_MAC_SPEED_100M;
        pstcCommInit->u32DuplexMode      = ETH_MAC_MODE_FULLDUPLEX;
        pstcCommInit->u32ChecksumMode    = ETH_MAC_CHECKSUM_MODE_HARDWARE;
        pstcCommInit->u32RxMode          = ETH_RX_MODE_POLLING;
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_eth_init_t to default values.
 * @param  [out] pstcEthInit                Pointer to a @ref stc_eth_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Structure Initialize success
 *           - ErrorInvalidParameter: pstcEthInit == NULL
 */
en_result_t ETH_StructInit(stc_eth_init_t *pstcEthInit)
{
    en_result_t enRet = Ok;

    if (NULL == pstcEthInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        (void)ETH_MAC_StructInit(&pstcEthInit->stcMacInit);
        (void)ETH_DMA_StructInit(&pstcEthInit->stcDmaInit);
    }

    return enRet;
}

/**
 * @brief  Enable MAC and DMA Transmission/Reception
 * @param  None
 * @retval An en_result_t enumeration value:
 *           - Ok: Enable success
 *           - ErrorTimeout: Enable timeout
 */
en_result_t ETH_Start(void)
{
    en_result_t enRet;

    /* Flush Transmit FIFO */
    enRet = ETH_DMA_FlushTransmitFIFO();
    if (Ok == enRet)
    {
        /* Enable MAC Transmit */
        ETH_MAC_TransmitCmd(Enable);
        /* Enable MAC Receive */
        ETH_MAC_ReceiveCmd(Enable);
        /* Enable DMA Transmit */
        ETH_DMA_TransmitCmd(Enable);
        /* Enable DMA Receive */
        ETH_DMA_ReceiveCmd(Enable);
    }

    return enRet;
}

/**
 * @brief  Disable MAC and DMA Transmission/Reception
 * @param  None
 * @retval An en_result_t enumeration value:
 *           - Ok: Disable success
 *           - ErrorTimeout: Disable timeout
 */
en_result_t ETH_Stop(void)
{
    en_result_t enRet;

    /* Disable DMA Transmit */
    ETH_DMA_TransmitCmd(Disable);
    /* Disable DMA Receive */
    ETH_DMA_ReceiveCmd(Disable);
    /* Disable MAC Receive */
    ETH_MAC_ReceiveCmd(Disable);
    /* Disable MAC Transmit */
    ETH_MAC_TransmitCmd(Disable);
    /* Flush Transmit FIFO */
    enRet = ETH_DMA_FlushTransmitFIFO();

    return enRet;
}

/******************************************************************************/
/*                             PHY Functions                                  */
/******************************************************************************/
/**
 * @brief  Write PHY register
 * @note   More PHY register could be written depending on the used PHY.
 * @param  [in] pstcEthHandle               Pointer to a @ref stc_eth_handle_t structure
 * @param  [in] u16Reg                      PHY register address
 *         This parameter can be one of the following values:
 *           @arg PHY_BCR:      PHY Basic Control Register
 *           @arg other value:  The value range from 1 to 31
 * @param  [in] u16RegVal                   PHY register value
 * @retval An en_result_t enumeration value:
 *           - Ok: Write register success
 *           - ErrorInvalidParameter: pstcEthHandle == NULL
 *           - ErrorTimeout: Write timeout
 */
en_result_t ETH_PHY_WriteRegister(stc_eth_handle_t *pstcEthHandle, uint16_t u16Reg, uint16_t u16RegVal)
{
    __IO uint32_t u32Count;
    en_result_t enRet = Ok;

    if (NULL == pstcEthHandle)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_PHY_ADDRESS(pstcEthHandle->stcCommInit.u16PHYAddress));
        DDL_ASSERT(IS_ETH_PHY_REGISTER(u16Reg));

        /* Set the MAC_SMIDATR register */
        WRITE_REG32(M4_ETH->MAC_SMIDATR, u16RegVal);
        /* Set the MAC_SMIADDR register */
        /* Keep only the MDC Clock Range SMIC[3:0] bits value */
        MODIFY_REG32(M4_ETH->MAC_SMIADDR, ETH_MAC_SMIADDR_CLEAR_MASK,
                    (((uint32_t)(pstcEthHandle->stcCommInit.u16PHYAddress) << ETH_MAC_SMIADDR_SMIA_POS) |
                    ((uint32_t)u16Reg << ETH_MAC_SMIADDR_SMIR_POS) | ETH_MAC_SMIADDR_SMIW | ETH_MAC_SMIADDR_SMIB));
        /* Check for the Busy flag */
        u32Count = PHY_WRITE_TIMEOUT * (HCLK_VALUE / 20000UL);
        while (0UL != READ_REG32_BIT(M4_ETH->MAC_SMIADDR, ETH_MAC_SMIADDR_SMIB))
        {
            if (0UL == u32Count)
            {
                enRet = ErrorTimeout;
                break;
            }
            u32Count--;
        }
    }

    return enRet;
}

/**
 * @brief  Read PHY register.
 * @note   More PHY register could be read depending on the used PHY.
 * @param  [in] pstcEthHandle               Pointer to a @ref stc_eth_handle_t structure
 * @param  [in] u16Reg                      PHY register address
 *         This parameter can be one of the following values:
 *           @arg PHY_BCR:      PHY Basic Control Register
 *           @arg PHY_BSR:      PHY Basic Status Register
 *           @arg other value:  The value range from 2 to 31
 * @param  [out] pu16RegVal                 Pointer to PHY register value
 * @retval An en_result_t enumeration value:
 *           - Ok: Read register success
 *           - ErrorInvalidParameter: pstcEthHandle == NULL or pu16RegVal == NULL
 *           - ErrorTimeout: Read timeout
 */
en_result_t ETH_PHY_ReadRegister(stc_eth_handle_t *pstcEthHandle, uint16_t u16Reg, uint16_t *pu16RegVal)
{
    __IO uint32_t u32Count;
    en_result_t enRet = Ok;

    if ((NULL == pstcEthHandle) || (NULL == pu16RegVal))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_PHY_ADDRESS(pstcEthHandle->stcCommInit.u16PHYAddress));
        DDL_ASSERT(IS_ETH_PHY_REGISTER(u16Reg));

        *pu16RegVal = 0U;
        /* Set the MAC_SMIADDR register */
        /* Keep only the MDC Clock Range SMIC[3:0] bits value */
        MODIFY_REG32(M4_ETH->MAC_SMIADDR, ETH_MAC_SMIADDR_CLEAR_MASK,
                    (((uint32_t)(pstcEthHandle->stcCommInit.u16PHYAddress) << ETH_MAC_SMIADDR_SMIA_POS) |
                    ((uint32_t)u16Reg << ETH_MAC_SMIADDR_SMIR_POS) | ETH_MAC_SMIADDR_SMIB));
        /* Check for the Busy flag */
        u32Count = PHY_READ_TIMEOUT * (HCLK_VALUE / 20000UL);
        while (0UL != READ_REG32_BIT(M4_ETH->MAC_SMIADDR, ETH_MAC_SMIADDR_SMIB))
        {
            if (0UL == u32Count)
            {
                enRet = ErrorTimeout;
                break;
            }
            u32Count--;
        }

        if (ErrorTimeout != enRet)
        {
            /* Get the MAC_SMIDATR value */
            *pu16RegVal = (uint16_t)(READ_REG32(M4_ETH->MAC_SMIDATR));
        }
    }

    return enRet;
}

/**
 * @brief  Enabele or disable PHY loopback.
 * @param  [in] pstcEthHandle               Pointer to a @ref stc_eth_handle_t structure
 * @param  [in] enNewSta                    The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval An en_result_t enumeration value:
 *           - Ok: Set loopback success
 *           - ErrorInvalidParameter: pstcEthHandle == NULL
 *           - Error: Communication error
 */
en_result_t ETH_PHY_LoopBackCmd(stc_eth_handle_t *pstcEthHandle, en_functional_state_t enNewSta)
{
    en_result_t enRet;
    uint16_t u16RegVal;

    if (NULL == pstcEthHandle)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_PHY_ADDRESS(pstcEthHandle->stcCommInit.u16PHYAddress));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

        enRet = ETH_PHY_ReadRegister(pstcEthHandle, PHY_BCR, &u16RegVal);
        if (enRet == Ok)
        {
            if (Disable != enNewSta)
            {
                SET_REG16_BIT(u16RegVal, PHY_LOOPBACK);
            }
            else
            {
                CLEAR_REG16_BIT(u16RegVal, PHY_LOOPBACK);
            }
            if (Ok != ETH_PHY_WriteRegister(pstcEthHandle, PHY_BCR, u16RegVal))
            {
                enRet = Error;
            }
        }
    }

    return enRet;
}

/******************************************************************************/
/*                             MAC Functions                                  */
/******************************************************************************/
/**
 * @brief  De-Initialize MAC.
 * @param  None
 * @retval None
 */
void ETH_MAC_DeInit(void)
{
    WRITE_REG32(M4_ETH->MAC_IFCONFR,  0UL);
    WRITE_REG32(M4_ETH->MAC_CONFIGR,  0x00008000UL);
    MODIFY_REG32(M4_ETH->MAC_FLTCTLR, ETH_MAC_FLTCTLR_CLEAR_MASK, 0UL);
    WRITE_REG32(M4_ETH->MAC_FLOCTLR,  0UL);
    WRITE_REG32(M4_ETH->MAC_INTMSKR,  0UL);
    WRITE_REG32(M4_ETH->MAC_SMIADDR,  0UL);
    WRITE_REG32(M4_ETH->MAC_SMIDATR,  0UL);
    WRITE_REG32(M4_ETH->MAC_RTWKFFR,  0UL);
    WRITE_REG32(M4_ETH->MAC_PMTCTLR,  0UL);
    WRITE_REG32(M4_ETH->MAC_HASHTLR,  0UL);
    WRITE_REG32(M4_ETH->MAC_HASHTHR,  0UL);
    WRITE_REG32(M4_ETH->MAC_VTACTLR,  0UL);
    WRITE_REG32(M4_ETH->MAC_VTAFLTR,  0UL);
    WRITE_REG32(M4_ETH->MAC_VLAHTBR,  0UL);
}

/**
 * @brief  Initialize MAC.
 * @param  [in] pstcEthHandle               Pointer to a @ref stc_eth_handle_t structure
 * @param  [in] pstcMacInit                 Pointer to a @ref stc_eth_mac_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: MAC Initialize success
 *           - ErrorInvalidParameter: pstcEthHandle == NULL or pstcMacInit == NULL
 */
en_result_t ETH_MAC_Init(stc_eth_handle_t *pstcEthHandle, const stc_eth_mac_init_t *pstcMacInit)
{
    en_result_t enRet = Ok;

    if ((NULL == pstcEthHandle) || (NULL == pstcMacInit))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_MAC_TX_CLK_POLARITY(pstcMacInit->u32TxClkPolarity));
        DDL_ASSERT(IS_ETH_MAC_RX_REF_CLK_POLARITY(pstcMacInit->u32RxRefClkPolarity));
        DDL_ASSERT(IS_ETH_MAC_SA_MODE(pstcMacInit->u32SAInsertMode));
        DDL_ASSERT(IS_ETH_MAC_TYPEFRAME_STRIP_FCS(pstcMacInit->u32TypeFrameStripFCS));
        DDL_ASSERT(IS_ETH_MAC_WATCHDOG(pstcMacInit->u32Watchdog));
        DDL_ASSERT(IS_ETH_MAC_JABBER(pstcMacInit->u32Jabber));
        DDL_ASSERT(IS_ETH_MAC_INTERFRAME_GAP(pstcMacInit->u32InterFrameGap));
        DDL_ASSERT(IS_ETH_MAC_CARRIER_SENCE(pstcMacInit->u32CarrierSense));
        DDL_ASSERT(IS_ETH_MAC_SPEED(pstcEthHandle->stcCommInit.u32Speed));
        DDL_ASSERT(IS_ETH_MAC_RECEIVE_OWN(pstcMacInit->u32ReceiveOwn));
        DDL_ASSERT(IS_ETH_MAC_DUPLEX_MODE(pstcEthHandle->stcCommInit.u32DuplexMode));
        DDL_ASSERT(IS_ETH_MAC_CHECKSUM_OFFLAOD(pstcMacInit->u32ChecksumOffload));
        DDL_ASSERT(IS_ETH_MAC_RETRY_TRANSMIT(pstcMacInit->u32RetryTransmit));
        DDL_ASSERT(IS_ETH_MAC_AUTO_STRIP_PAD_FCS(pstcMacInit->u32AutoStripPadFCS));
        DDL_ASSERT(IS_ETH_MAC_BACKOFF_LIMIT(pstcMacInit->u32BackOffLimit));
        DDL_ASSERT(IS_ETH_MAC_DEFFERRAL_CHECK(pstcMacInit->u32DeferralCheck));
        DDL_ASSERT(IS_ETH_MAC_ZERO_QUANTA_PAUSE(pstcMacInit->u32ZeroQuantaPause));
        DDL_ASSERT(IS_ETH_MAC_PAUSE_LOWTHRESHOLD(pstcMacInit->u32PauseLowThreshold));
        DDL_ASSERT(IS_ETH_MAC_UNICAST_PAUSEFRAME_DETECT(pstcMacInit->u32UnicastPauseFrameDetect));
        DDL_ASSERT(IS_ETH_MAC_RECEIVE_FLOWCONTROL(pstcMacInit->u32ReceiveFlowControl));
        DDL_ASSERT(IS_ETH_MAC_TRANSMIT_FLOWCONTROL(pstcMacInit->u32TransmitFlowControl));
        DDL_ASSERT(IS_ETH_MAC_RECEIVE_All(pstcMacInit->u32ReceiveAll));
        DDL_ASSERT(IS_ETH_MAC_DROP_NOT_TCPUDP(pstcMacInit->u32DropNotTcpUdp));
        DDL_ASSERT(IS_ETH_MAC_VLAN_TAG_FILTER(pstcMacInit->u32VlanTagFilter));
        DDL_ASSERT(IS_ETH_MAC_SOURCE_ADDR_FILTER(pstcMacInit->u32SAFilter));
        DDL_ASSERT(IS_ETH_MAC_PASS_CTRLFRAME(pstcMacInit->u32PassControlFrame));
        DDL_ASSERT(IS_ETH_MAC_BROADCASTFRAME_RECEPTION(pstcMacInit->u32BroadcastFrameReception));
        DDL_ASSERT(IS_ETH_MAC_DESTINATION_ADDR_FILTER(pstcMacInit->u32DAFilter));
        DDL_ASSERT(IS_ETH_MAC_MULTICASTFRAME_FILTER(pstcMacInit->u32MulticastFrameFilter));
        DDL_ASSERT(IS_ETH_MAC_UNICASTFRAME_FILTER(pstcMacInit->u32UnicastFrameFilter));
        DDL_ASSERT(IS_ETH_MAC_PROMISCUOUS_MODE(pstcMacInit->u32PromiscuousMode));
        DDL_ASSERT(IS_ETH_MAC_TXVLAN_MODE(pstcMacInit->u32TxVlanInsertMode));
        DDL_ASSERT(IS_ETH_MAC_RXVLAN_FILTER(pstcMacInit->u32RxVlanFilter));
        DDL_ASSERT(IS_ETH_MAC_RXVLAN_COMPARISON(pstcMacInit->u32RxVlanComparison));

        /* Set MAC_IFCONFR register */
        MODIFY_REG32(M4_ETH->MAC_IFCONFR, ETH_MAC_IFCONFR_CLEAR_MASK,
                     (pstcMacInit->u32TxClkPolarity | pstcMacInit->u32RxRefClkPolarity));
        /* Set MAC_CONFIGR register */
        MODIFY_REG32(M4_ETH->MAC_CONFIGR, ETH_MAC_CONFIGR_CLEAR_MASK,
                     (pstcMacInit->u32SAInsertMode        | pstcMacInit->u32TypeFrameStripFCS        |
                      pstcMacInit->u32Watchdog            | pstcMacInit->u32Jabber                   |
                      pstcMacInit->u32InterFrameGap       | pstcMacInit->u32CarrierSense             |
                      pstcEthHandle->stcCommInit.u32Speed | pstcMacInit->u32ReceiveOwn               |
                      pstcMacInit->u32DeferralCheck       | pstcEthHandle->stcCommInit.u32DuplexMode |
                      pstcMacInit->u32ChecksumOffload     | pstcMacInit->u32RetryTransmit            |
                      pstcMacInit->u32AutoStripPadFCS     | pstcMacInit->u32BackOffLimit));
        /* Set MAC_FLOCTLR register */
        MODIFY_REG32(M4_ETH->MAC_FLOCTLR, ETH_MAC_FLOCTLR_CLEAR_MASK,
                     ((((uint32_t)pstcMacInit->u16PauseTime) << 16U) | pstcMacInit->u32ZeroQuantaPause         |
                      pstcMacInit->u32PauseLowThreshold              | pstcMacInit->u32UnicastPauseFrameDetect |
                      pstcMacInit->u32ReceiveFlowControl             | pstcMacInit->u32TransmitFlowControl));
        /* Set MAC_FLTCTLR register */
        MODIFY_REG32(M4_ETH->MAC_FLTCTLR, ETH_MAC_FLTCTLR_CLEAR_MASK,
                     (pstcMacInit->u32ReceiveAll              | pstcMacInit->u32DropNotTcpUdp         |
                      pstcMacInit->u32PromiscuousMode         | pstcMacInit->u32VlanTagFilter         |
                      pstcMacInit->u32SAFilter                | pstcMacInit->u32PassControlFrame      |
                      pstcMacInit->u32BroadcastFrameReception | pstcMacInit->u32DAFilter              |
                      pstcMacInit->u32MulticastFrameFilter    | pstcMacInit->u32UnicastFrameFilter));
        /* Set Hash table register */
        WRITE_REG32(M4_ETH->MAC_HASHTLR, pstcMacInit->u32HashTableLow);
        WRITE_REG32(M4_ETH->MAC_HASHTHR, pstcMacInit->u32HashTableHigh);
        /* Set Tx VLAN register */
        WRITE_REG32(M4_ETH->MAC_VTACTLR, (pstcMacInit->u32TxVlanInsertMode | pstcMacInit->u16TxVlanTag));
        /* Set Rx VLAN register */
        WRITE_REG32(M4_ETH->MAC_VTAFLTR, (pstcMacInit->u32RxVlanFilter |
                    pstcMacInit->u32RxVlanComparison | pstcMacInit->u16RxVlanTag));
        WRITE_REG32(M4_ETH->MAC_VLAHTBR, pstcMacInit->u16RxVlanHashTable);
        /* Config MAC address in ETH MAC0 */
        (void)ETH_MACADDR_SetAddress(ETH_MAC_ADDRESS0, pstcEthHandle->stcCommInit.au8MACAddr);
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_eth_mac_init_t to default values.
 * @param  [out] pstcMacInit                Pointer to a @ref stc_eth_mac_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Structure Initialize success
 *           - ErrorInvalidParameter: pstcMacInit == NULL
 */
en_result_t ETH_MAC_StructInit(stc_eth_mac_init_t *pstcMacInit)
{
    en_result_t enRet = Ok;

