RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_eth.c
    if (NULL == pstcMacInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcMacInit->u32TxClkPolarity           = ETH_MAC_TX_CLK_POLARITY_KEEP;
        pstcMacInit->u32RxRefClkPolarity        = ETH_MAC_RX_REF_CLK_POLARITY_KEEP;
        pstcMacInit->u32SAInsertMode            = ETH_MAC_SA_MODE_BY_DMATXDESC;
        pstcMacInit->u32TypeFrameStripFCS       = ETH_MAC_TYPEFRAME_STRIP_FCS_DISABLE;
        pstcMacInit->u32Watchdog                = ETH_MAC_WATCHDOG_ENABLE;
        pstcMacInit->u32Jabber                  = ETH_MAC_JABBER_ENABLE;
        pstcMacInit->u32InterFrameGap           = ETH_MAC_INTERFRAME_GAP_96BIT;
        pstcMacInit->u32CarrierSense            = ETH_MAC_CARRIER_SENCE_ENABLE;
        pstcMacInit->u32ReceiveOwn              = ETH_MAC_RECEIVE_OWN_ENABLE;
        pstcMacInit->u32ChecksumOffload         = ETH_MAC_CHECKSUM_OFFLAOD_DISABLE;
        pstcMacInit->u32RetryTransmit           = ETH_MAC_RETRY_TRANSMIT_DISABLE;
        pstcMacInit->u32AutoStripPadFCS         = ETH_MAC_AUTO_STRIP_PAD_FCS_DISABLE;
        pstcMacInit->u32BackOffLimit            = ETH_MAC_BACKOFF_LIMIT_10;
        pstcMacInit->u32DeferralCheck           = ETH_MAC_DEFFERRAL_CHECK_DISABLE;
        pstcMacInit->u16PauseTime               = 0U;
        pstcMacInit->u32ZeroQuantaPause         = ETH_MAC_ZERO_QUANTA_PAUSE_DISABLE;
        pstcMacInit->u32PauseLowThreshold       = ETH_MAC_PAUSE_LOWTHRESHOLD_MINUS4;
        pstcMacInit->u32UnicastPauseFrameDetect = ETH_MAC_UNICAST_PAUSEFRAME_DETECT_DISABLE;
        pstcMacInit->u32ReceiveFlowControl      = ETH_MAC_RECEIVE_FLOWCONTROL_DISABLE;
        pstcMacInit->u32TransmitFlowControl     = ETH_MAC_TRANSMIT_FLOWCONTROL_DISABLE;
        pstcMacInit->u32ReceiveAll              = ETH_MAC_RECEIVE_All_DISABLE;
        pstcMacInit->u32DropNotTcpUdp           = ETH_MAC_DROP_NOT_TCPUDP_DISABLE;

        pstcMacInit->u32VlanTagFilter           = ETH_MAC_VLAN_TAG_FILTER_DISABLE;
        pstcMacInit->u32SAFilter                = ETH_MAC_SOURCE_ADDR_FILTER_DISABLE;
        pstcMacInit->u32PassControlFrame        = ETH_MAC_PASS_CTRLFRAME_FORWARD_NOTPAUSE_ALL;
        pstcMacInit->u32BroadcastFrameReception = ETH_MAC_BROADCASTFRAME_RECEPTION_ENABLE;
        pstcMacInit->u32DAFilter                = ETH_MAC_DESTINATION_ADDR_FILTER_NORMAL;
        pstcMacInit->u32MulticastFrameFilter    = ETH_MAC_MULTICASTFRAME_FILTER_PERFECT;
        pstcMacInit->u32UnicastFrameFilter      = ETH_MAC_UNICASTFRAME_FILTER_PERFECT;
        pstcMacInit->u32PromiscuousMode         = ETH_MAC_PROMISCUOUS_MODE_DISABLE;
        pstcMacInit->u32HashTableHigh           = 0UL;
        pstcMacInit->u32HashTableLow            = 0UL;
        pstcMacInit->u32TxVlanInsertMode        = ETH_MAC_TXVLAN_MODE_BYPASS;
        pstcMacInit->u16TxVlanTag               = 0U;
        pstcMacInit->u32RxVlanFilter            = ETH_MAC_RXVLAN_FILTER_NORMAL;
        pstcMacInit->u32RxVlanComparison        = ETH_MAC_RXVLAN_COMPARISON_16BIT;
        pstcMacInit->u16RxVlanTag               = 0U;
        pstcMacInit->u16RxVlanHashTable         = 0U;
    }

    return enRet;
}

/**
 * @brief  Set MAC duplex mode and speed.
 * @param  [in] u32DuplexMode               MAC duplex mode
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_MAC_MODE_HALFDUPLEX:  Half duplex mode
 *           @arg ETH_MAC_MODE_FULLDUPLEX:  Full duplex mode
 * @param  [in] u32Speed                    MAC speed
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_MAC_SPEED_10M:        10Mbps
 *           @arg ETH_MAC_SPEED_100M:       100Mbps
 * @retval None
 */
void ETH_MAC_SetDuplexSpeed(uint32_t u32DuplexMode, uint32_t u32Speed)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_MAC_DUPLEX_MODE(u32DuplexMode));
    DDL_ASSERT(IS_ETH_MAC_SPEED(u32Speed));

    MODIFY_REG32(M4_ETH->MAC_CONFIGR, (ETH_MAC_CONFIGR_FES | ETH_MAC_CONFIGR_DM),
                 (u32DuplexMode | u32Speed));
}

/**
 * @brief  Set MAC hash table.
 * @param  [in] u32HashHigh                 Hash table high value.
 * @param  [in] u32HashLow                  Hash table low value.
 * @retval None
 */
void ETH_MAC_SetHashTable(uint32_t u32HashHigh, uint32_t u32HashLow)
{
    WRITE_REG32(M4_ETH->MAC_HASHTLR, u32HashLow);
    WRITE_REG32(M4_ETH->MAC_HASHTHR, u32HashHigh);
}

/**
 * @brief  Set MAC Tx VLAN tag value.
 * @param  [in] u16TxTag                    The tag value of Tx VLAN.
 * @retval None
 */
void ETH_MAC_SetTxVlanTagVal(uint16_t u16TxTag)
{
    MODIFY_REG32(M4_ETH->MAC_VTACTLR, ETH_MAC_VTACTLR_VLANV, u16TxTag);
}

/**
 * @brief  Set MAC Rx VLAN tag value.
 * @param  [in] u16RxTag                    The tag value of Rx VLAN.
 * @retval None
 */
void ETH_MAC_SetRxVlanTagVal(uint16_t u16RxTag)
{
    MODIFY_REG32(M4_ETH->MAC_VTAFLTR, ETH_MAC_VTAFLTR_VLFLT, u16RxTag);
}

/**
 * @brief  Set MAC Rx VLAN hash table.
 * @param  [in] u16HashVal                  The value of Rx VLAN hash table.
 * @retval None
 */
void ETH_MAC_SetRxVlanHashTable(uint16_t u16HashVal)
{
    WRITE_REG32(M4_ETH->MAC_VLAHTBR, u16HashVal);
}

/**
 * @brief  Enable or disable MAC loopback.
 * @param  [in] enNewSta                    The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void ETH_MAC_LoopBackCmd(en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    WRITE_REG32(bM4_ETH->MAC_CONFIGR_b.LM, enNewSta);
}

/**
 * @brief  Enable or disable MAC Back Pressure.
 * @param  [in] enNewSta                    The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void ETH_MAC_BackPressureCmd(en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    WRITE_REG32(bM4_ETH->MAC_FLOCTLR_b.FCA_BPA, enNewSta);
}

/**
 * @brief  Enable or disable MAC Transmit.
 * @param  [in] enNewSta                    The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void ETH_MAC_TransmitCmd(en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    WRITE_REG32(bM4_ETH->MAC_CONFIGR_b.TE, enNewSta);
}

/**
 * @brief  Enable or disable MAC Receive.
 * @param  [in] enNewSta                    The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void ETH_MAC_ReceiveCmd(en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    WRITE_REG32(bM4_ETH->MAC_CONFIGR_b.RE, enNewSta);
}

/**
 * @brief  Enable or disable MAC interrupt.
 * @param  [in] u32IntSrc                   MAC interrupt source type
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_MAC_INT_TSPIM:        Time stamp trigger interrupt (on MAC)
 *           @arg ETH_MAC_INT_PMTIM:        PMT interrupt (on MAC)
 * @param  [in] enNewSta                    The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void ETH_MAC_IntCmd(uint32_t u32IntSrc, en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_MAC_INTERRUPT(u32IntSrc));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

