RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_eth.c
    if (Disable != enNewSta)
    {
        CLEAR_REG32_BIT(M4_ETH->MAC_INTMSKR, u32IntSrc);
    }
    else
    {
        SET_REG32_BIT(M4_ETH->MAC_INTMSKR, u32IntSrc);
    }
}

/**
 * @brief  Get MAC interrupt status.
 * @param  [in] u32Flag                     MAC interrupt flag type
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_MAC_INT_FLAG_TSPIS:   Time stamp trigger flag (on MAC)
 *           @arg ETH_MAC_INT_FLAG_MMCTXIS: MMC transmit flag
 *           @arg ETH_MAC_INT_FLAG_MMCRXIS: MMC receive flag
 *           @arg ETH_MAC_INT_FLAG_MMCIS:   MMC flag (on MAC)
 *           @arg ETH_MAC_INT_FLAG_PMTIS:   PMT flag (on MAC)
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t ETH_MAC_GetIntStatus(uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = Reset;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_MAC_INTERRUPT_FLAG(u32Flag));

    if (0UL != (READ_REG32_BIT(M4_ETH->MAC_INTSTSR, u32Flag)))
    {
        enFlagSta = Set;
    }

    return enFlagSta;
}

/******************************************************************************/
/*                          MAC Address Functions                             */
/******************************************************************************/
/**
 * @brief  De-Initialize MAC Address.
 * @param  [in] u32Index                    MAC address index.
 *         This parameter can be one of the following values:
 *           @arg ETH_MAC_ADDRESS0:         MAC address 0
 *           @arg ETH_MAC_ADDRESS1:         MAC address 1
 *           @arg ETH_MAC_ADDRESS2:         MAC address 2
 *           @arg ETH_MAC_ADDRESS3:         MAC address 3
 *           @arg ETH_MAC_ADDRESS4:         MAC address 4
 * @retval None
 */
void ETH_MACADDR_DeInit(uint32_t u32Index)
{
    __IO uint32_t *MACADHR;
    __IO uint32_t *MACADLR;
    uint32_t u32MacHigh = 0x0000FFFFUL;

    DDL_ASSERT(IS_ETH_MAC_ADDRESS_NORMAL_INDEX(u32Index));

    MACADHR = (__IO uint32_t *)ETH_MAC_MACADHRx(u32Index);
    MACADLR = (__IO uint32_t *)ETH_MAC_MACADLRx(u32Index);
    if (ETH_MAC_ADDRESS0 == u32Index)
    {
        u32MacHigh |= 0x80000000UL;
    }
    WRITE_REG32(*MACADHR, u32MacHigh);
    WRITE_REG32(*MACADLR, 0xFFFFFFFFUL);
}

/**
 * @brief  Initialize MAC Address.
 * @param  [in] u32Index                    MAC address index.
 *         This parameter can be one of the following values:
 *           @arg ETH_MAC_ADDRESS0:         MAC address 0
 *           @arg ETH_MAC_ADDRESS1:         MAC address 1
 *           @arg ETH_MAC_ADDRESS2:         MAC address 2
 *           @arg ETH_MAC_ADDRESS3:         MAC address 3
 *           @arg ETH_MAC_ADDRESS4:         MAC address 4
 * @param  [in] pstcMacAddrInit             Pointer to a @ref stc_eth_mac_addr_config_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: MAC Address Initialize success
 *           - ErrorInvalidParameter: pstcMacAddrInit == NULL
 */
en_result_t ETH_MACADDR_Init(uint32_t u32Index, const stc_eth_mac_addr_config_t *pstcMacAddrInit)
{
    en_result_t enRet = Ok;
    __IO uint32_t *MACADHR;
    __IO uint32_t *MACADLR;
    uint32_t u32TempReg;
    uint32_t *pu32AddrLow;

    if (NULL == pstcMacAddrInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_MAC_ADDRESS_NORMAL_INDEX(u32Index));
        DDL_ASSERT(IS_ETH_MAC_ADDRESS_FILTER(pstcMacAddrInit->u32MacAddrFilter));
        DDL_ASSERT(IS_ETH_MAC_ADDRESS_MASK(pstcMacAddrInit->u32MacAddrMask));

        MACADHR = (__IO uint32_t *)ETH_MAC_MACADHRx(u32Index);
        MACADLR = (__IO uint32_t *)ETH_MAC_MACADLRx(u32Index);
        /* Set MAC address high register */
        u32TempReg = ((uint32_t)pstcMacAddrInit->au8MACAddr[5] << 8U) | (uint32_t)pstcMacAddrInit->au8MACAddr[4];
        if (ETH_MAC_ADDRESS0 != u32Index)
        {
            u32TempReg |= pstcMacAddrInit->u32MacAddrFilter | pstcMacAddrInit->u32MacAddrMask;
        }
        WRITE_REG32(*MACADHR, u32TempReg);
        /* Set MAC address low register */
        pu32AddrLow = (uint32_t *)((uint32_t)&(pstcMacAddrInit->au8MACAddr[0]));
        WRITE_REG32(*MACADLR, *pu32AddrLow);
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_eth_mac_addr_config_t to default values.
 * @param  [out] pstcMacAddrInit            Pointer to a @ref stc_eth_mac_addr_config_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Structure Initialize success
 *           - ErrorInvalidParameter: pstcMacAddrInit == NULL
 */
en_result_t ETH_MACADDR_StructInit(stc_eth_mac_addr_config_t *pstcMacAddrInit)
{
    en_result_t enRet = Ok;
    uint8_t i;

    if (NULL == pstcMacAddrInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcMacAddrInit->u32MacAddrFilter = ETH_MAC_ADDRESS_FILTER_DISABLE;
        pstcMacAddrInit->u32MacAddrMask = ETH_MAC_ADDRESS_MASK_DISABLE;
        for (i=0U; i<ETH_MAC_ADDRESS_BYTE_LENGTH; i++)
        {
            pstcMacAddrInit->au8MACAddr[i] = 0x00U;
        }
    }

    return enRet;
}

/**
 * @brief  Set MAC Address.
 * @param  [in] u32Index                    MAC address index.
 *         This parameter can be one of the following values:
 *           @arg ETH_MAC_ADDRESS0:         MAC address 0
 *           @arg ETH_MAC_ADDRESS1:         MAC address 1
 *           @arg ETH_MAC_ADDRESS2:         MAC address 2
 *           @arg ETH_MAC_ADDRESS3:         MAC address 3
 *           @arg ETH_MAC_ADDRESS4:         MAC address 4
 * @param  [in] au8Addr                     Pointer to MAC address buffer(6 bytes).
 * @retval An en_result_t enumeration value:
 *           - Ok: Set address success
 *           - ErrorInvalidParameter: au8Addr == NULL
 */
en_result_t ETH_MACADDR_SetAddress(uint32_t u32Index, uint8_t au8Addr[])
{
    en_result_t enRet = Ok;
    __IO uint32_t *MACADHR;
    __IO uint32_t *MACADLR;
    uint32_t u32TempReg;
    uint32_t *pu32AddrLow;

    if (NULL == au8Addr)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_MAC_ADDRESS_NORMAL_INDEX(u32Index));

        MACADHR = (__IO uint32_t *)ETH_MAC_MACADHRx(u32Index);
        MACADLR = (__IO uint32_t *)ETH_MAC_MACADLRx(u32Index);
        /* Set MAC address high register */
        u32TempReg = ((uint32_t)au8Addr[5] << 8U) | (uint32_t)au8Addr[4];
        WRITE_REG32(*MACADHR, u32TempReg);
        /* Set MAC address low register */
        pu32AddrLow = (uint32_t *)((uint32_t)&(au8Addr[0]));
        WRITE_REG32(*MACADLR, *pu32AddrLow);
    }

    return enRet;
}

/**
 * @brief  Get MAC Address.
 * @param  [in] u32Index                    MAC address index.
 *         This parameter can be one of the following values:
 *           @arg ETH_MAC_ADDRESS0:         MAC address 0
 *           @arg ETH_MAC_ADDRESS1:         MAC address 1
 *           @arg ETH_MAC_ADDRESS2:         MAC address 2
 *           @arg ETH_MAC_ADDRESS3:         MAC address 3
 *           @arg ETH_MAC_ADDRESS4:         MAC address 4
 * @param  [out] au8Addr                    Pointer to MAC address buffer(6 bytes).
 * @retval An en_result_t enumeration value:
 *           - Ok: Set address success
 *           - ErrorInvalidParameter: au8Addr == NULL
 */
en_result_t ETH_MACADDR_GetAddress(uint32_t u32Index, uint8_t au8Addr[])
{
    en_result_t enRet = Ok;
    __IO uint32_t *MACADHR;
    __IO uint32_t *MACADLR;
    uint32_t u32TempReg;
    uint32_t *pu32AddrLow;

    if (NULL == au8Addr)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_MAC_ADDRESS_NORMAL_INDEX(u32Index));

        MACADHR    = (__IO uint32_t *)ETH_MAC_MACADHRx(u32Index);
        MACADLR    = (__IO uint32_t *)ETH_MAC_MACADLRx(u32Index);
        /* Get MAC address high */
        u32TempReg = READ_REG32(*MACADHR);
        au8Addr[5] = (uint8_t)((u32TempReg >> 8U) & 0x000000FFUL);
        au8Addr[4] = (uint8_t)(u32TempReg & 0x000000FFUL);
        /* Get MAC address low */
        pu32AddrLow = (uint32_t *)((uint32_t)&(au8Addr[0]));
        *pu32AddrLow = READ_REG32(*MACADLR);
    }

    return enRet;
}

/**
 * @brief  Set MAC Address filter mode.
 * @param  [in] u32Index                    MAC address index.
 *         This parameter can be one of the following values:
 *           @arg ETH_MAC_ADDRESS1:         MAC address 1
 *           @arg ETH_MAC_ADDRESS2:         MAC address 2
 *           @arg ETH_MAC_ADDRESS3:         MAC address 3
 *           @arg ETH_MAC_ADDRESS4:         MAC address 4
 * @param  [in] u32Mode                     MAC address filter mode.
 *         This parameter can be one of the following values:
 *           @arg ETH_MAC_ADDRESS_FILTER_DISABLE:       Disable perfect filter with MAC address.
 *           @arg ETH_MAC_ADDRESS_FILTER_PERFECT_DA:    Filter the DA address of the received frame with MAC address.
 *           @arg ETH_MAC_ADDRESS_FILTER_PERFECT_SA:    Filter the SA address of the received frame with MAC address.
 * @retval None
 */
void ETH_MACADDR_SetFilterMode(uint32_t u32Index, uint32_t u32Mode)
{
    __IO uint32_t *MACADHR;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_MAC_ADDRESS_SPECIAL_INDEX(u32Index));
    DDL_ASSERT(IS_ETH_MAC_ADDRESS_FILTER(u32Mode));

    MACADHR = (__IO uint32_t *)ETH_MAC_MACADHRx(u32Index);
    MODIFY_REG32(*MACADHR, (ETH_MAC_MACADHR1_SA1 | ETH_MAC_MACADHR1_AE1), u32Mode);
}

/**
 * @brief  Set MAC Address Transmit priority ratio.
 * @param  [in] u32Index                    MAC address index.
 *         This parameter can be one of the following values:
 *           @arg ETH_MAC_ADDRESS1:         MAC address 1
 *           @arg ETH_MAC_ADDRESS2:         MAC address 2
 *           @arg ETH_MAC_ADDRESS3:         MAC address 3
 *           @arg ETH_MAC_ADDRESS4:         MAC address 4
 * @param  [in] u32Mask                     MAC address filter mask.
 *         This parameter can be one of the following values or any combination
 *         of BYTE1 through BYTE6:
 *           @arg ETH_MAC_ADDRESS_MASK_DISABLE: Disable MAC Address Mask
 *           @arg ETH_MAC_ADDRESS_MASK_BYTE6:   Mask MAC Address high reg bits [15:8]
 *           @arg ETH_MAC_ADDRESS_MASK_BYTE5:   Mask MAC Address high reg bits [7:0]
 *           @arg ETH_MAC_ADDRESS_MASK_BYTE4:   Mask MAC Address low reg bits [31:24]
 *           @arg ETH_MAC_ADDRESS_MASK_BYTE3:   Mask MAC Address low reg bits [23:16]
 *           @arg ETH_MAC_ADDRESS_MASK_BYTE2:   Mask MAC Address low reg bits [15:8]
 *           @arg ETH_MAC_ADDRESS_MASK_BYTE1:   Mask MAC Address low reg bits [7:0]
 *           @arg ETH_MAC_ADDRESS_MASK_ALL:     Mask MAC Address low reg bits [31:0] and low high bits [15:0]
 * @retval None
 */
void ETH_MACADDR_SetFilterMask(uint32_t u32Index, uint32_t u32Mask)
{
    __IO uint32_t *MACADHR;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_MAC_ADDRESS_SPECIAL_INDEX(u32Index));
    DDL_ASSERT(IS_ETH_MAC_ADDRESS_MASK(u32Mask));

    MACADHR = (__IO uint32_t *)ETH_MAC_MACADHRx(u32Index);
    MODIFY_REG32(*MACADHR, ETH_MAC_MACADHR1_MBC1, u32Mask);
}

/******************************************************************************/
/*                        MAC L3L4 Filter Functions                           */
/******************************************************************************/
/**
 * @brief  De-Initialize MAC L3L4 Filter.
 * @param  None
 * @retval None
 */
void ETH_MAC_L3L4FilterDeInit(void)
{
    WRITE_REG32(bM4_ETH->MAC_FLTCTLR_b.IPFE, Disable);
    WRITE_REG32(M4_ETH->MAC_L34CTLR,  0UL);
    WRITE_REG32(M4_ETH->MAC_L4PORTR,  0UL);
    WRITE_REG32(M4_ETH->MAC_L3ADDRR0, 0UL);
    WRITE_REG32(M4_ETH->MAC_L3ADDRR1, 0UL);
    WRITE_REG32(M4_ETH->MAC_L3ADDRR2, 0UL);
    WRITE_REG32(M4_ETH->MAC_L3ADDRR3, 0UL);
}

/**
 * @brief  Initialize MAC L3L4 Filter.
 * @param  [in] pstcL3L4FilterInit          Pointer to a @ref stc_eth_l3l4_filter_config_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: MAC L3L4 Filter Initialize success
 *           - ErrorInvalidParameter: pstcL3L4FilterInit == NULL
 */
en_result_t ETH_MAC_L3L4FilterInit(const stc_eth_l3l4_filter_config_t *pstcL3L4FilterInit)
{
    en_result_t enRet = Ok;

