RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_eth.c
    if (NULL == au32Addr)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        WRITE_REG32(M4_ETH->MAC_L3ADDRR0, au32Addr[0]);
        WRITE_REG32(M4_ETH->MAC_L3ADDRR1, au32Addr[1]);
        WRITE_REG32(M4_ETH->MAC_L3ADDRR2, au32Addr[2]);
        WRITE_REG32(M4_ETH->MAC_L3ADDRR3, au32Addr[3]);
    }

    return enRet;
}

/******************************************************************************/
/*                              DMA Functions                                 */
/******************************************************************************/
/**
 * @brief  De-Initialize DMA.
 * @param  None
 * @retval None
 */
void ETH_DMA_DeInit(void)
{
    WRITE_REG32(M4_ETH->DMA_BUSMODR, 0x00020101UL);
    WRITE_REG32(M4_ETH->DMA_OPRMODR, 0U);
    WRITE_REG32(M4_ETH->DMA_INTENAR, 0U);
    WRITE_REG32(M4_ETH->DMA_REVWDTR, 0U);
    WRITE_REG32(M4_ETH->DMA_TXDLADR, 0U);
    WRITE_REG32(M4_ETH->DMA_RXDLADR, 0U);
}

/**
 * @brief  Initialize DMA.
 * @param  [in] pstcDmaInit                 Pointer to a @ref stc_eth_dma_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: DMA Initialize success
 *           - ErrorInvalidParameter: pstcDmaInit == NULL
 */
en_result_t ETH_DMA_Init(const stc_eth_dma_init_t *pstcDmaInit)
{
    en_result_t enRet = Ok;

    if (NULL == pstcDmaInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_DMA_BURST_MODE(pstcDmaInit->u32BurstMode));
        DDL_ASSERT(IS_ETH_DMA_ADDRESS_ALIGN(pstcDmaInit->u32AddressAlign));
        DDL_ASSERT(IS_ETH_DMA_RX_BURST_LENGTH(pstcDmaInit->u32RxDMABurstLength));
        DDL_ASSERT(IS_ETH_DMA_TX_BURST_LENGTH(pstcDmaInit->u32TxDMABurstLength));
        DDL_ASSERT(IS_ETH_DMA_ENHANCE_DESCRIPTOR(pstcDmaInit->u32EnhanceDescriptor));
        DDL_ASSERT(IS_ETH_DMA_DESC_SKIP_LENGTH(pstcDmaInit->u32DescriptorSkipLength));
        DDL_ASSERT(IS_ETH_DMA_PRIORITY_ARBITRATION(pstcDmaInit->u32DMAArbitration));
        DDL_ASSERT(IS_ETH_DMA_DROP_CHECKSUM_ERRORFRAME(pstcDmaInit->u32DropChecksumErrorFrame));
        DDL_ASSERT(IS_ETH_DMA_RECEIVE_STORE_FORWARD(pstcDmaInit->u32ReceiveStoreForward));
        DDL_ASSERT(IS_ETH_DMA_FLUSH_RECEIVEDFRAME(pstcDmaInit->u32FlushReceiveFrame));
        DDL_ASSERT(IS_ETH_DMA_TRANSMIT_STORE_FORWARD(pstcDmaInit->u32TransmitStoreForward));
        DDL_ASSERT(IS_ETH_DMA_TRANSMIT_THRESHOLD(pstcDmaInit->u32TransmitThreshold));
        DDL_ASSERT(IS_ETH_DMA_FORWARD_ERRORFRAME(pstcDmaInit->u32ForwardErrorFrame));
        DDL_ASSERT(IS_ETH_DMA_FORWARD_UNDERSIZE_GOODFRAME(pstcDmaInit->u32ForwardUndersizeGoodFrame));
        DDL_ASSERT(IS_ETH_DMA_DROP_JUMBO_FRAME(pstcDmaInit->u32DropJumboFrame));
        DDL_ASSERT(IS_ETH_DMA_RECEIVE_THRESHOLD(pstcDmaInit->u32ReceiveThreshold));
        DDL_ASSERT(IS_ETH_DMA_SECONDFRAME_OPERARTE(pstcDmaInit->u32SecondFrameOperate));

        /* Set Bus mode register */
        MODIFY_REG32(M4_ETH->DMA_BUSMODR, ETH_DMA_BUSMODR_CLEAR_MASK,
                     (pstcDmaInit->u32BurstMode        | pstcDmaInit->u32AddressAlign      | pstcDmaInit->u32RxDMABurstLength     |
                      pstcDmaInit->u32TxDMABurstLength | pstcDmaInit->u32EnhanceDescriptor | pstcDmaInit->u32DescriptorSkipLength |
                      pstcDmaInit->u32DMAArbitration   | ETH_DMA_BUSMODR_SPBL));
        /* Set Operation mode register */
        MODIFY_REG32(M4_ETH->DMA_OPRMODR, ETH_DMA_OPRMODR_CLEAR_MASK,
                     (pstcDmaInit->u32DropChecksumErrorFrame    | pstcDmaInit->u32ReceiveStoreForward | pstcDmaInit->u32FlushReceiveFrame |
                      pstcDmaInit->u32TransmitStoreForward      | pstcDmaInit->u32TransmitThreshold   | pstcDmaInit->u32ForwardErrorFrame |
                      pstcDmaInit->u32ForwardUndersizeGoodFrame | pstcDmaInit->u32DropJumboFrame      | pstcDmaInit->u32ReceiveThreshold  |
                      pstcDmaInit->u32SecondFrameOperate));
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_eth_dma_init_t to default values.
 * @param  [out] pstcDmaInit                Pointer to a @ref stc_eth_dma_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Structure Initialize success
 *           - ErrorInvalidParameter: pstcDmaInit == NULL
 */
en_result_t ETH_DMA_StructInit(stc_eth_dma_init_t *pstcDmaInit)
{
    en_result_t enRet = Ok;

    if (NULL == pstcDmaInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcDmaInit->u32BurstMode                 = ETH_DMA_BURST_MODE_FIXED;
        pstcDmaInit->u32AddressAlign              = ETH_DMA_ADDRESS_ALIGN_ENABLE;
        pstcDmaInit->u32RxDMABurstLength          = ETH_DMA_RX_BURST_LENGTH_32BEAT;
        pstcDmaInit->u32TxDMABurstLength          = ETH_DMA_TX_BURST_LENGTH_32BEAT;
        pstcDmaInit->u32EnhanceDescriptor         = ETH_DMA_ENHANCE_DESCRIPTOR_ENABLE;
        pstcDmaInit->u32DescriptorSkipLength      = 0U;
        pstcDmaInit->u32DMAArbitration            = ETH_DMA_ARBITRATION_LOOP_RXTX_1_1;
        pstcDmaInit->u32DropChecksumErrorFrame    = ETH_DMA_DROP_CHECKSUM_ERRORFRAME_ENABLE;
        pstcDmaInit->u32ReceiveStoreForward       = ETH_DMA_RECEIVE_STORE_FORWARD_ENABLE;
        pstcDmaInit->u32FlushReceiveFrame         = ETH_DMA_FLUSH_RECEIVEDFRAME_ENABLE;
        pstcDmaInit->u32TransmitStoreForward      = ETH_DMA_TRANSMIT_STORE_FORWARD_ENABLE;
        pstcDmaInit->u32TransmitThreshold         = ETH_DMA_TRANSMIT_THRESHOLD_64BYTE;
        pstcDmaInit->u32ForwardErrorFrame         = ETH_DMA_FORWARD_ERRORFRAME_DISABLE;
        pstcDmaInit->u32ForwardUndersizeGoodFrame = ETH_DMA_FORWARD_UNDERSIZE_GOODFRAME_DISABLE;
        pstcDmaInit->u32DropJumboFrame            = ETH_DMA_DROP_JUMBO_FRAME_DISABLE;
        pstcDmaInit->u32ReceiveThreshold          = ETH_DMA_RECEIVE_THRESHOLD_64BYTE;
        pstcDmaInit->u32SecondFrameOperate        = ETH_DMA_SECONDFRAME_OPERARTE_ENABLE;
    }

    return enRet;
}

/**
 * @brief  Set DMA software reset.
 * @param  None
 * @retval An en_result_t enumeration value:
 *           - Ok: Software reset success
 *           - ErrorTimeout: Reset timeout
 */
en_result_t ETH_DMA_SoftwareReset(void)
{
    __IO uint32_t u32Count;
    en_result_t enRet = Ok;

    WRITE_REG32(bM4_ETH->DMA_BUSMODR_b.SWR, 1U);
    u32Count = ETH_TIMEOUT_SOFTWARE_RESET * (HCLK_VALUE / 20000UL);
    while (0UL != READ_REG32(bM4_ETH->DMA_BUSMODR_b.SWR))
    {
        if (0UL == u32Count)
        {
            enRet = ErrorTimeout;
            break;
        }
        u32Count--;
    }

    return enRet;
}

/**
 * @brief  Set DMA Transmit priority ratio.
 * @param  [in] u32PrioRatio                Priority ratio
 *         This parameter can be one of the following values:
 *           @arg ETH_DMA_ARBITRATION_LOOP_RXTX_1_1:        Rx:Tx = 1:1
 *           @arg ETH_DMA_ARBITRATION_LOOP_RXTX_2_1:        Rx:Tx = 2:1
 *           @arg ETH_DMA_ARBITRATION_LOOP_RXTX_3_1:        Rx:Tx = 3:1
 *           @arg ETH_DMA_ARBITRATION_LOOP_RXTX_4_1:        Rx:Tx = 4:1
 *           @arg ETH_DMA_ARBITRATION_LOOP_TXRX_1_1:        Tx:Rx = 1:1
 *           @arg ETH_DMA_ARBITRATION_LOOP_TXRX_2_1:        Tx:Rx = 2:1
 *           @arg ETH_DMA_ARBITRATION_LOOP_TXRX_3_1:        Tx:Rx = 3:1
 *           @arg ETH_DMA_ARBITRATION_LOOP_TXRX_4_1:        Tx:Rx = 4:1
 *           @arg ETH_DMA_ARBITRATION_FIXED_RXPRIORTX:      Fixed priority: Rx is higher than Tx
 *           @arg ETH_DMA_ARBITRATION_FIXED_TXPRIORRX:      Fixed priority: Tx is higher than Rx
 * @retval None
 */
void ETH_DMA_SetTransPrioRatio(uint32_t u32PrioRatio)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_DMA_PRIORITY_ARBITRATION(u32PrioRatio));

    MODIFY_REG32(M4_ETH->DMA_BUSMODR,
                 (ETH_DMA_BUSMODR_TXPR | ETH_DMA_BUSMODR_PRAT | ETH_DMA_BUSMODR_DMAA),
                 u32PrioRatio);
}

/**
 * @brief  Set DMA Rx watchdog counter.
 * @param  [in] u8Value                     The value of Watchdog timer
 * @retval None
 */
void ETH_DMA_SetRxWatchdogCounter(uint8_t u8Value)
{
    WRITE_REG32(M4_ETH->DMA_REVWDTR, u8Value);
}

/**
 * @brief  Flush transmit FIFO.
 * @param  None
 * @retval An en_result_t enumeration value:
 *           - Ok: Flush transmit FIFO success
 *           - ErrorTimeout: Flush timeout
 */
en_result_t ETH_DMA_FlushTransmitFIFO(void)
{
    __IO uint32_t u32Count;
    en_result_t enRet = Ok;

    WRITE_REG32(bM4_ETH->DMA_OPRMODR_b.FTF, 1U);
    u32Count = ETH_TIMEOUT_WRITE_REGISTER * (HCLK_VALUE / 20000UL);
    while (0UL != READ_REG32(bM4_ETH->DMA_OPRMODR_b.FTF))
    {
        if (0UL == u32Count)
        {
            enRet = ErrorTimeout;
            break;
        }
        u32Count--;
    }

    return enRet;
}

/**
 * @brief  Enable or disable DMA transmit.
 * @param  [in] enNewSta                    The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void ETH_DMA_TransmitCmd(en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    WRITE_REG32(bM4_ETH->DMA_OPRMODR_b.STT, enNewSta);
}

/**
 * @brief  Enable or disable DMA receive.
 * @param  [in] enNewSta                    The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void ETH_DMA_ReceiveCmd(en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

