RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_eth.c
    WRITE_REG32(bM4_ETH->DMA_OPRMODR_b.STR, enNewSta);
}

/**
 * @brief  Enable or disable DMA interrupt.
 * @param  [in] u32IntSrc                   DMA interrupt source
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_DMA_INT_NIE:          Normal interrupt summary
 *           @arg ETH_DMA_INT_AIE:          Abnormal interrupt summary
 *           @arg ETH_DMA_INT_ERE:          Early receive interrupt
 *           @arg ETH_DMA_INT_FBE:          Fatal bus error interrupt
 *           @arg ETH_DMA_INT_ETE:          Early transmit interrupt
 *           @arg ETH_DMA_INT_RWE:          Receive watchdog timeout interrupt
 *           @arg ETH_DMA_INT_RSE:          Receive process stopped interrupt
 *           @arg ETH_DMA_INT_RUE:          Receive buffer unavailable interrupt
 *           @arg ETH_DMA_INT_RIE:          Receive interrupt
 *           @arg ETH_DMA_INT_UNE:          Transmit Underflow interrupt
 *           @arg ETH_DMA_INT_OVE:          Receive Overflow interrupt
 *           @arg ETH_DMA_INT_TJE:          Transmit jabber timeout interrupt
 *           @arg ETH_DMA_INT_TUE:          Transmit buffer unavailable interrupt
 *           @arg ETH_DMA_INT_TSE:          Transmit process stopped interrupt
 *           @arg ETH_DMA_INT_TIE:          Transmit interrupt
 * @param  [in] enNewSta                    The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void ETH_DMA_IntCmd(uint32_t u32IntSrc, en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_DMA_INTERRUPT(u32IntSrc));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    if (Disable != enNewSta)
    {
        SET_REG32_BIT(M4_ETH->DMA_INTENAR, u32IntSrc);
    }
    else
    {
        CLEAR_REG32_BIT(M4_ETH->DMA_INTENAR, u32IntSrc);
    }
}

/**
 * @brief  Get DMA flag status.
 * @param  [in] u32Flag                     DMA flag type
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_DMA_FLAG_PTPS:        Time-stamp trigger status
 *           @arg ETH_DMA_FLAG_PMTS:        PMT trigger status
 *           @arg ETH_DMA_FLAG_MMCS:        MMC trigger status
 *           @arg ETH_DMA_FLAG_NIS:         Normal interrupt summary flag
 *           @arg ETH_DMA_FLAG_AIS:         Abnormal interrupt summary flag
 *           @arg ETH_DMA_FLAG_ERS:         Early receive flag
 *           @arg ETH_DMA_FLAG_FBS:         Fatal bus error flag
 *           @arg ETH_DMA_FLAG_ETS:         Early transmit flag
 *           @arg ETH_DMA_FLAG_RWS:         Receive watchdog timeout flag
 *           @arg ETH_DMA_FLAG_RSS:         Receive stopped flag
 *           @arg ETH_DMA_FLAG_RUS:         Receive buffer unavailable flag
 *           @arg ETH_DMA_FLAG_RIS:         Receive flag
 *           @arg ETH_DMA_FLAG_UNS:         Transmit Underflow flag
 *           @arg ETH_DMA_FLAG_OVS:         Receive Overflow flag
 *           @arg ETH_DMA_FLAG_TJS:         Transmit jabber timeout flag
 *           @arg ETH_DMA_FLAG_TUS:         Transmit buffer unavailable flag
 *           @arg ETH_DMA_FLAG_TSS:         Transmit stopped flag
 *           @arg ETH_DMA_FLAG_TIS:         Transmit interrupt flag
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t ETH_DMA_GetStatus(uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = Reset;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_DMA_FLAG(u32Flag));

    if (0UL != (READ_REG32_BIT(M4_ETH->DMA_DMASTSR, u32Flag)))
    {
        enFlagSta = Set;
    }

    return enFlagSta;
}

/**
 * @brief  Get DMA overflow flag status.
 * @param  [in] u32Flag                     DMA overflow flag type
 *         This parameter can be one of the following values:
 *           @arg ETH_DMA_OVERFLOW_RXFIFO_COUNTER:          Overflow bit for FIFO overflow counter
 *           @arg ETH_DMA_OVERFLOW_MISSFRAME_COUNTER:       Overflow bit for miss frame counter
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t ETH_DMA_GetOvfStatus(uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = Reset;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_DMA_MISS_FRAME_TYPE(u32Flag));

    if (0UL != (READ_REG32_BIT(M4_ETH->DMA_RFRCNTR, u32Flag)))
    {
        enFlagSta = Set;
    }

    return enFlagSta;
}

/******************************************************************************/
/*                          DMA descriptor Functions                          */
/******************************************************************************/
/**
 * @brief  Initializes DMA Tx descriptor in chain mode.
 * @param  [in] pstcEthHandle               Pointer to a @ref stc_eth_handle_t structure
 * @param  [in] astcTxDescTab               Pointer to the first Tx desc list
 * @param  [in] au8TxBuffer                 Pointer to the first TxBuffer list
 * @param  [in] u32TxBufferCnt              Number of the Tx desc in the list
 * @retval An en_result_t enumeration value:
 *           - Ok: Initializes Tx chain mode success
 *           - ErrorInvalidParameter: pstcEthHandle == NULL or astcTxDescTab == NULL or
 *                                    au8TxBuffer == NULL or u32TxBufferCnt == 0
 */
en_result_t ETH_DMA_TxDescListInit(stc_eth_handle_t *pstcEthHandle, stc_eth_dma_desc_t astcTxDescTab[], const uint8_t au8TxBuffer[], uint32_t u32TxBufferCnt)
{
    uint32_t i;
    stc_eth_dma_desc_t *pstcTxDesc;
    en_result_t enRet = Ok;

    if ((NULL == pstcEthHandle) || (NULL == astcTxDescTab) || (NULL == au8TxBuffer) || (0UL== u32TxBufferCnt))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Set the DMATxDesc pointer with the first in the astcTxDescTab list */
        pstcEthHandle->stcTxDesc = astcTxDescTab;

        /* Fill each DMATxDesc descriptor */
        for (i=0U; i<u32TxBufferCnt; i++)
        {
            pstcTxDesc = &astcTxDescTab[i];
            /* Set Second Address Chained */
            pstcTxDesc->u32ControlStatus = ETH_DMATXDESC_TSAC;
            /* Set Buffer1 address pointer */
            pstcTxDesc->u32Buffer1Addr = (uint32_t)(&au8TxBuffer[i * ETH_TXBUF_SIZE]);
            /* Set the DMA Tx descriptors checksum insertion */
            if (ETH_MAC_CHECKSUM_MODE_HARDWARE == pstcEthHandle->stcCommInit.u32ChecksumMode)
            {
                SET_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMATXDESC_CIC_TCPUDPICMP_FULL);
            }

            /* Initialize the next descriptor with the Next Descriptor Polling */
            if (i < (u32TxBufferCnt - 1U))
            {
                pstcTxDesc->u32Buffer2NextDescAddr = (uint32_t)(&astcTxDescTab[i + 1U]);
            }
            else
            {
                pstcTxDesc->u32Buffer2NextDescAddr = (uint32_t)astcTxDescTab;
            }
        }

        /* Set Transmit Descriptor List Address Register */
        WRITE_REG32(M4_ETH->DMA_TXDLADR, (uint32_t)astcTxDescTab);
    }

    return enRet;
}

/**
 * @brief  Initializes DMA Rx descriptor in chain mode.
 * @param  [in] pstcEthHandle               Pointer to a @ref stc_eth_handle_t structure
 * @param  [in] astcRxDescTab               Pointer to the first Rx desc list
 * @param  [in] au8RxBuffer                 Pointer to the first RxBuffer list
 * @param  [in] u32RxBufferCnt              Number of the Rx desc in the list
 * @retval An en_result_t enumeration value:
 *           - Ok: Initializes Rx chain mode success
 *           - ErrorInvalidParameter: pstcEthHandle == NULL or astcRxDescTab == NULL or
 *                                    au8RxBuffer == NULL or u32RxBufferCnt == 0
 */
en_result_t ETH_DMA_RxDescListInit(stc_eth_handle_t *pstcEthHandle, stc_eth_dma_desc_t astcRxDescTab[], const uint8_t au8RxBuffer[], uint32_t u32RxBufferCnt)
{
    uint32_t i;
    stc_eth_dma_desc_t *pstcRxDesc;
    en_result_t enRet = Ok;

    if ((NULL == pstcEthHandle) || (NULL == astcRxDescTab) || (NULL == au8RxBuffer) || (0UL == u32RxBufferCnt))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Set the DMARxDesc pointer with the first in the astcRxDescTab list */
        pstcEthHandle->stcRxDesc = astcRxDescTab;

