RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_eth.c
        /* Fill each DMARxDesc descriptor */
        for (i=0UL; i<u32RxBufferCnt; i++)
        {
            pstcRxDesc = &astcRxDescTab[i];
            /* Set Own bit of the Rx descriptor */
            pstcRxDesc->u32ControlStatus     = ETH_DMARXDESC_OWN;
            /* Set Buffer1 size and Second Address Chained */
            pstcRxDesc->u32ControlBufferSize = ETH_RXBUF_SIZE | ETH_DMARXDESC_RSAC;
            /* Set Buffer1 address pointer */
            pstcRxDesc->u32Buffer1Addr       = (uint32_t)(&au8RxBuffer[i * ETH_RXBUF_SIZE]);
            /* Set the DMA Rx Descriptor interrupt */
            if (ETH_RX_MODE_INTERRUPT == pstcEthHandle->stcCommInit.u32RxMode)
            {
                CLEAR_REG32_BIT(pstcRxDesc->u32ControlBufferSize, ETH_DMARXDESC_DIC);
            }

            /* Initialize the next descriptor with the Next Descriptor Polling */
            if (i < (u32RxBufferCnt - 1U))
            {
                pstcRxDesc->u32Buffer2NextDescAddr = (uint32_t)(&astcRxDescTab[i + 1U]);
            }
            else
            {
                pstcRxDesc->u32Buffer2NextDescAddr = (uint32_t)astcRxDescTab;
            }
        }

        /* Set Receive Descriptor List Address Register */
        WRITE_REG32(M4_ETH->DMA_RXDLADR, (uint32_t)astcRxDescTab);
    }

    return enRet;
}

/**
 * @brief  Set DMA transmit frame.
 * @param  [in] pstcEthHandle               Pointer to a @ref stc_eth_handle_t structure
 * @param  [in] u32FrameLength              Total of data to be transmit
 * @retval An en_result_t enumeration value:
 *           - Ok: Set transmit frame success
 *           - ErrorInvalidParameter: pstcEthHandle == NULL
 *           - ErrorInvalidMode: Descriptor is owned by the DMA
 */
en_result_t ETH_DMA_SetTransmitFrame(stc_eth_handle_t *pstcEthHandle, uint32_t u32FrameLength)
{
    uint32_t i;
    uint32_t u32BufCnt;
    uint32_t u32Size;
    en_result_t enRet = Ok;

    if ((NULL == pstcEthHandle) || (0U == u32FrameLength))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check if the descriptor is owned by the CPU */
        if (0UL != (pstcEthHandle->stcTxDesc->u32ControlStatus & ETH_DMATXDESC_OWN))
        {
            enRet = ErrorInvalidMode;
        }
        else
        {
            /* Get the number of needed Tx buffers for the current frame */
            if (u32FrameLength > ETH_TXBUF_SIZE)
            {
                u32BufCnt = u32FrameLength / ETH_TXBUF_SIZE;
                if (0UL != (u32FrameLength % ETH_TXBUF_SIZE))
                {
                    u32BufCnt++;
                }
            }
            else
            {
                u32BufCnt = 1U;
            }

            if (1U == u32BufCnt)
            {
                /* Set FIRST and LAST segment */
                SET_REG32_BIT(pstcEthHandle->stcTxDesc->u32ControlStatus, (ETH_DMATXDESC_TFS | ETH_DMATXDESC_TLS));
                /* Set frame size */
                MODIFY_REG32(pstcEthHandle->stcTxDesc->u32ControlBufferSize, ETH_DMATXDESC_TBS1, (u32FrameLength & ETH_DMATXDESC_TBS1));
                /* Set Own bit of the Tx descriptor */
                SET_REG32_BIT(pstcEthHandle->stcTxDesc->u32ControlStatus, ETH_DMATXDESC_OWN);
                /* Point to next descriptor */
                pstcEthHandle->stcTxDesc = (stc_eth_dma_desc_t *)(pstcEthHandle->stcTxDesc->u32Buffer2NextDescAddr);
            }
            else
            {
                for (i=0U; i<u32BufCnt; i++)
                {
                    /* Clear FIRST and LAST segment bits */
                    CLEAR_REG32_BIT(pstcEthHandle->stcTxDesc->u32ControlStatus, (ETH_DMATXDESC_TFS | ETH_DMATXDESC_TLS));
                    if (0U == i)
                    {
                        /* Set the FIRST segment bit */
                        SET_REG32_BIT(pstcEthHandle->stcTxDesc->u32ControlStatus, ETH_DMATXDESC_TFS);
                    }

                    if ((u32BufCnt - 1U) == i)
                    {
                        /* Set the last segment bit */
                        SET_REG32_BIT(pstcEthHandle->stcTxDesc->u32ControlStatus, ETH_DMATXDESC_TLS);
                        u32Size = u32FrameLength - ((u32BufCnt - 1U) * ETH_TXBUF_SIZE);
                        MODIFY_REG32(pstcEthHandle->stcTxDesc->u32ControlBufferSize, ETH_DMATXDESC_TBS1, (u32Size & ETH_DMATXDESC_TBS1));
                    }
                    else
                    {
                        /* Set frame size */
                        MODIFY_REG32(pstcEthHandle->stcTxDesc->u32ControlBufferSize, ETH_DMATXDESC_TBS1, (ETH_TXBUF_SIZE & ETH_DMATXDESC_TBS1));
                    }

                    /* Set Own bit of the Tx descriptor */
                    SET_REG32_BIT(pstcEthHandle->stcTxDesc->u32ControlStatus, ETH_DMATXDESC_OWN);
                    /* Pointer to next descriptor */
                    pstcEthHandle->stcTxDesc = (stc_eth_dma_desc_t *)(pstcEthHandle->stcTxDesc->u32Buffer2NextDescAddr);
                }
            }

            /* When Tx Buffer unavailable flag is set: clear it and resume transmission */
            if (0UL != (READ_REG32_BIT(M4_ETH->DMA_DMASTSR, ETH_DMA_FLAG_TUS)))
            {
                /* Clear DMA TUS flag */
                WRITE_REG32(M4_ETH->DMA_DMASTSR, ETH_DMA_FLAG_TUS);
                /* Resume DMA transmission */
                WRITE_REG32(M4_ETH->DMA_TXPOLLR, 0UL);
            }
        }
    }

    return enRet;
}

/**
 * @brief  Get DMA receive frame.
 * @param  [in] pstcEthHandle               Pointer to a @ref stc_eth_handle_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Get receive frame success
 *           - ErrorInvalidParameter: pstcEthHandle == NULL
 *           - Error: Not completed frame received
 */
en_result_t ETH_DMA_GetReceiveFrame(stc_eth_handle_t *pstcEthHandle)
{
    en_result_t enRet = Error;

    if (NULL == pstcEthHandle)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check if segment is not owned by DMA */
        if (0UL == (pstcEthHandle->stcRxDesc->u32ControlStatus & ETH_DMARXDESC_OWN))
        {
            /* Check if last segment */
            if (0UL != (pstcEthHandle->stcRxDesc->u32ControlStatus & ETH_DMARXDESC_RLS))
            {
                pstcEthHandle->stcRxFrame.u32SegCount++;
                pstcEthHandle->stcRxFrame.pstcLSDesc = pstcEthHandle->stcRxDesc;
                /* Check if last segment is first segment */
                if (1U == pstcEthHandle->stcRxFrame.u32SegCount)
                {
                    pstcEthHandle->stcRxFrame.pstcFSDesc = pstcEthHandle->stcRxDesc;
                }

                /* Get the Frame Length of the received packet: Strip FCS */
                pstcEthHandle->stcRxFrame.u32Length = ((pstcEthHandle->stcRxDesc->u32ControlStatus & ETH_DMARXDESC_FRAL) >> ETH_DMARXDESC_FRAME_LENGTHSHIFT) - 4U;
                /* Get the address of the buffer start address */
                pstcEthHandle->stcRxFrame.u32Buffer = (pstcEthHandle->stcRxFrame.pstcFSDesc)->u32Buffer1Addr;
                /* Pointer to next descriptor */
                pstcEthHandle->stcRxDesc              = (stc_eth_dma_desc_t*)(pstcEthHandle->stcRxDesc->u32Buffer2NextDescAddr);
                /* Get success */
                enRet = Ok;
            }
            /* Check if first segment */
            else if (0UL != (pstcEthHandle->stcRxDesc->u32ControlStatus & ETH_DMARXDESC_RFS))
            {
                pstcEthHandle->stcRxFrame.pstcFSDesc  = pstcEthHandle->stcRxDesc;
                pstcEthHandle->stcRxFrame.pstcLSDesc  = NULL;
                pstcEthHandle->stcRxFrame.u32SegCount = 1U;
                /* Point to next descriptor */
                pstcEthHandle->stcRxDesc = (stc_eth_dma_desc_t*)(pstcEthHandle->stcRxDesc->u32Buffer2NextDescAddr);
            }
            /* Check if intermediate segment */
            else
            {
                pstcEthHandle->stcRxFrame.u32SegCount++;
                /* Point to next descriptor */
                pstcEthHandle->stcRxDesc = (stc_eth_dma_desc_t*)(pstcEthHandle->stcRxDesc->u32Buffer2NextDescAddr);
            }
        }
    }

    return enRet;
}

/**
 * @brief  Get DMA receive frame in interrupt mode.
 * @param  [in] pstcEthHandle               Pointer to a @ref stc_eth_handle_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Get receive frame success
 *           - ErrorInvalidParameter: pstcEthHandle == NULL
 *           - Error: Not completed frame received
 */
en_result_t ETH_DMA_GetReceiveFrame_Interrupt(stc_eth_handle_t *pstcEthHandle)
{
    uint32_t u32DescCnt = 0U;
    en_result_t enRet = Error;

    if (NULL == pstcEthHandle)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Scan descriptor owned by CPU */
        while ((0UL == (pstcEthHandle->stcRxDesc->u32ControlStatus & ETH_DMARXDESC_OWN)) && (u32DescCnt < ETH_RXBUF_SIZE))
        {
            u32DescCnt++;
            /* Check if first segment in frame */
            if (ETH_DMARXDESC_RFS == (pstcEthHandle->stcRxDesc->u32ControlStatus & (ETH_DMARXDESC_RFS | ETH_DMARXDESC_RLS)))
            {
                pstcEthHandle->stcRxFrame.pstcFSDesc  = pstcEthHandle->stcRxDesc;
                pstcEthHandle->stcRxFrame.pstcLSDesc  = NULL;
                pstcEthHandle->stcRxFrame.u32SegCount = 1U;
                /* Point to next descriptor */
                pstcEthHandle->stcRxDesc = (stc_eth_dma_desc_t*)(pstcEthHandle->stcRxDesc->u32Buffer2NextDescAddr);
            }
            /* Check if intermediate segment */
            else if (0UL == (pstcEthHandle->stcRxDesc->u32ControlStatus & (ETH_DMARXDESC_RFS | ETH_DMARXDESC_RLS)))
            {
                pstcEthHandle->stcRxFrame.u32SegCount++;
                /* Point to next descriptor */
                pstcEthHandle->stcRxDesc = (stc_eth_dma_desc_t*)(pstcEthHandle->stcRxDesc->u32Buffer2NextDescAddr);
            }
            /* Last segment */
            else
            {
                pstcEthHandle->stcRxFrame.u32SegCount++;
                /* Last segment */
                pstcEthHandle->stcRxFrame.pstcLSDesc = pstcEthHandle->stcRxDesc;
                /* Check if last segment is first segment */
                if (1U == pstcEthHandle->stcRxFrame.u32SegCount)
                {
                    pstcEthHandle->stcRxFrame.pstcFSDesc = pstcEthHandle->stcRxDesc;
                }

                /* Get the Frame Length of the received packet: Strip FCS */
                pstcEthHandle->stcRxFrame.u32Length = ((pstcEthHandle->stcRxDesc->u32ControlStatus & ETH_DMARXDESC_FRAL) >> ETH_DMARXDESC_FRAME_LENGTHSHIFT) - 4U;
                /* Get the address of the buffer start address */
                pstcEthHandle->stcRxFrame.u32Buffer = (pstcEthHandle->stcRxFrame.pstcFSDesc)->u32Buffer1Addr;
                /* Pointer to next descriptor */
                pstcEthHandle->stcRxDesc = (stc_eth_dma_desc_t*)(pstcEthHandle->stcRxDesc->u32Buffer2NextDescAddr);
                /* Get success */
                enRet = Ok;
                break;
            }
        }
    }

    return enRet;
}

/**
 * @brief  Set DMA Tx descriptor own bit.
 * @param  [in] pstcTxDesc                  Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] u32Owner                    DMA Tx descriptor owner
 *         This parameter can be one of the following values:
 *           @arg ETH_DMADESC_OWN_CPU:      Descriptor is owned by CPU
 *           @arg ETH_DMADESC_OWN_DMA:      Descriptor is owned by DMA
 * @retval An en_result_t enumeration value:
 *           - Ok: Set Tx descriptor own bit success
 *           - ErrorInvalidParameter: pstcTxDesc == NULL
 */
en_result_t ETH_DMA_SetTxDescOwn(stc_eth_dma_desc_t *pstcTxDesc, uint32_t u32Owner)
{
    en_result_t enRet = Ok;

    if (NULL == pstcTxDesc)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_DMADESC_OWN(u32Owner));

        if (ETH_DMADESC_OWN_CPU != u32Owner)
        {
            SET_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMATXDESC_OWN);
        }
        else
        {
            CLEAR_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMATXDESC_OWN);
        }
    }

    return enRet;
}

/**
 * @brief  Set DMA Tx descriptor buffer size.
 * @param  [in] pstcTxDesc                  Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] u8BufferNum                 Buffer sequence number
 *         This parameter can be one of the following values:
 *           @arg ETH_DMADESC_BUFFER1:      DMA Tx Desc Buffer1
 *           @arg ETH_DMADESC_BUFFER2:      DMA Tx Desc Buffer2
 * @param  [in] u32BufferSize               DMA Tx buffer size
 * @retval An en_result_t enumeration value:
 *           - Ok: Set Tx descriptor buffer size success
 *           - ErrorInvalidParameter: pstcTxDesc == NULL
 */
en_result_t ETH_DMA_SetTxDescBufferSize(stc_eth_dma_desc_t *pstcTxDesc, uint8_t u8BufferNum, uint32_t u32BufferSize)
{
    en_result_t enRet = Ok;
    uint32_t u32ShiftBit = 0UL;

    if (NULL == pstcTxDesc)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_DMADESC_BUFFER(u8BufferNum));
        DDL_ASSERT(IS_ETH_DMATXDESC_BUFFER_SIZE(u32BufferSize));

        /* DMA Tx Desc buffer2 */
        if (ETH_DMADESC_BUFFER1 != u8BufferNum)
        {
            u32ShiftBit = ETH_DMADESC_BUFFER2_SIZESHIFT;
        }
        MODIFY_REG32(pstcTxDesc->u32ControlBufferSize, (ETH_DMATXDESC_TBS1 << u32ShiftBit),
                     (u32BufferSize << u32ShiftBit));
    }

    return enRet;
}

/**
 * @brief  Configure DMA Tx descriptor checksum insert.
 * @param  [in] pstcTxDesc                  Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] u32ChecksumMode             Checksum insert mode
 *         This parameter can be one of the following values:
 *           @arg ETH_DMATXDESC_CHECKSUM_BYPASS:                Checksum Engine is bypassed
 *           @arg ETH_DMATXDESC_CHECKSUM_IPV4HEADER:            IPv4 header checksum insertion
 *           @arg ETH_DMATXDESC_CHECKSUM_TCPUDPICMP_SEGMENT:    TCP/UDP/ICMP Checksum Insertion calculated over segment only
 *           @arg ETH_DMATXDESC_CHECKSUM_TCPUDPICMP_FULL:       TCP/UDP/ICMP Checksum Insertion fully calculated
 * @retval An en_result_t enumeration value:
 *           - Ok: Configure Tx descriptor checksum insert success
 *           - ErrorInvalidParameter: pstcTxDesc == NULL
 */
en_result_t ETH_DMA_TxDescChecksumInsertConfig(stc_eth_dma_desc_t *pstcTxDesc, uint32_t u32ChecksumMode)
{
    en_result_t enRet = Ok;

    if (NULL == pstcTxDesc)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_DMATXDESC_CHECKSUM_CONTROL(u32ChecksumMode));

        MODIFY_REG32(pstcTxDesc->u32ControlStatus, ETH_DMATXDESC_CIC, u32ChecksumMode);
    }

    return enRet;
}

/**
 * @brief  Configure DMA Tx descriptor VLAN insert.
 * @param  [in] pstcTxDesc                  Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] u32VlanMode                 VLAN insert mode
 *         This parameter can be one of the following values:
 *           @arg ETH_DMATXDESC_VLAN_BYPASS:            VLAN Insertion is bypassed
 *           @arg ETH_DMATXDESC_VLAN_REMOVE_TAG:        Remove Tag and Type fields in VLAN frame
 *           @arg ETH_DMATXDESC_VLAN_INSERT_TAG:        Insert VLAN Tag value in ETH_MAC_VTACTLR Register into transmit frame
 *           @arg ETH_DMATXDESC_VLAN_REPLACE_TAG:       Replace VLAN tag value in transmit frame with VLAN tag value in ETH_MAC_VTACTLR register
 * @retval An en_result_t enumeration value:
 *           - Ok: Configure Tx descriptor VLAN insert success
 *           - ErrorInvalidParameter: pstcTxDesc == NULL
 */
en_result_t ETH_DMA_TxDescVlanInsertConfig(stc_eth_dma_desc_t *pstcTxDesc, uint32_t u32VlanMode)
{
    en_result_t enRet = Ok;

    if (NULL == pstcTxDesc)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_DMATXDESC_VLAN_CONTROL(u32VlanMode));

        MODIFY_REG32(pstcTxDesc->u32ControlStatus, ETH_DMATXDESC_VLANC, u32VlanMode);
    }

    return enRet;
}

/**
 * @brief  Configure DMA Tx descriptor SA insert.
 * @param  [in] pstcTxDesc                  Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] u32SAMode                   SA insert mode
 *         This parameter can be one of the following values:
 *           @arg ETH_DMATXDESC_SA_BYPASS:              Source Address Insertion or Replace Control is bypassed
 *           @arg ETH_DMATXDESC_SA_INSTER_MACADDR0:     Insert address value in MAC address register 0 into transmit frame as SA address
 *           @arg ETH_DMATXDESC_SA_REPLACE_MACADDR0:    Replace SA address in transmit frame with address value in MAC address register 0
 *           @arg ETH_DMATXDESC_SA_INSTER_MACADDR1:     Insert address value in MAC address register 1 into transmit frame as SA address
 *           @arg ETH_DMATXDESC_SA_REPLACE_MACADDR1:    Replace SA address in transmit frame with address value in MAC address register 1
 * @retval An en_result_t enumeration value:
 *           - Ok: Configure Tx descriptor SA insert success
 *           - ErrorInvalidParameter: pstcTxDesc == NULL
 */
en_result_t ETH_DMA_TxDescSAInsertConfig(stc_eth_dma_desc_t *pstcTxDesc, uint32_t u32SAMode)
{
    en_result_t enRet = Ok;

    if (NULL == pstcTxDesc)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_DMATXDESC_SA_CONTROL(u32SAMode));

        MODIFY_REG32(pstcTxDesc->u32ControlBufferSize, ETH_DMATXDESC_SAIRC, u32SAMode);
    }

    return enRet;
}

/**
 * @brief  Enable or disable DMA Tx descriptor add CRC.
 * @param  [in] pstcTxDesc                  Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] enNewSta                    The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval An en_result_t enumeration value:
 *           - Ok: Configure Tx add CRC success
 *           - ErrorInvalidParameter: pstcTxDesc == NULL
 */
en_result_t ETH_DMA_TxDescCRCCmd(stc_eth_dma_desc_t *pstcTxDesc, en_functional_state_t enNewSta)
{
    en_result_t enRet = Ok;

    if (NULL == pstcTxDesc)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

