RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_eth.c
        if (Disable != enNewSta)
        {
            CLEAR_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMATXDESC_DCRC);
        }
        else
        {
            SET_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMATXDESC_DCRC);
        }
    }

    return enRet;
}

/**
 * @brief  Enable or disable DMA Tx descriptor padding.
 * @param  [in] pstcTxDesc                  Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] enNewSta                    The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval An en_result_t enumeration value:
 *           - Ok: Configure Tx padding success
 *           - ErrorInvalidParameter: pstcTxDesc == NULL
 */
en_result_t ETH_DMA_TxDescPADCmd(stc_eth_dma_desc_t *pstcTxDesc, en_functional_state_t enNewSta)
{
    en_result_t enRet = Ok;

    if (NULL == pstcTxDesc)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

        if (Disable != enNewSta)
        {
            CLEAR_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMATXDESC_DPAD);
        }
        else
        {
            SET_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMATXDESC_DPAD);
        }
    }

    return enRet;
}

/**
 * @brief  Enable or disable DMA Tx descriptor timestamp.
 * @param  [in] pstcTxDesc                  Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] enNewSta                    The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval An en_result_t enumeration value:
 *           - Ok: Configure Tx padding success
 *           - ErrorInvalidParameter: pstcTxDesc == NULL
 */
en_result_t ETH_DMA_TxDescTimestamp(stc_eth_dma_desc_t *pstcTxDesc, en_functional_state_t enNewSta)
{
    en_result_t enRet = Ok;

    if (NULL == pstcTxDesc)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

        if (Disable != enNewSta)
        {
            SET_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMATXDESC_TTSE);
        }
        else
        {
            CLEAR_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMATXDESC_TTSE);
        }
    }

    return enRet;
}

/**
 * @brief  Enable or disable DMA Tx descriptor replace CRC.
 * @param  [in] pstcTxDesc                  Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] enNewSta                    The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval An en_result_t enumeration value:
 *           - Ok: Configure Tx replace CRC success
 *           - ErrorInvalidParameter: pstcTxDesc == NULL
 */
en_result_t ETH_DMA_TxDescReplaceCRCCmd(stc_eth_dma_desc_t *pstcTxDesc, en_functional_state_t enNewSta)
{
    en_result_t enRet = Ok;

    if (NULL == pstcTxDesc)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

        if (Disable != enNewSta)
        {
            SET_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMATXDESC_CRCR);
        }
        else
        {
            CLEAR_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMATXDESC_CRCR);
        }
    }

    return enRet;
}

/**
 * @brief  Enable or disable DMA Tx finished interrupt.
 * @param  [in] pstcTxDesc                  Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] enNewSta                    The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval An en_result_t enumeration value:
 *           - Ok: Configure Tx interrupt configure success
 *           - ErrorInvalidParameter: pstcTxDesc == NULL
 */
en_result_t ETH_DMA_TxDescIntCmd(stc_eth_dma_desc_t *pstcTxDesc, en_functional_state_t enNewSta)
{
    en_result_t enRet = Ok;

    if (NULL == pstcTxDesc)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

        if (Disable != enNewSta)
        {
            SET_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMATXDESC_IOC);
        }
        else
        {
            CLEAR_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMATXDESC_IOC);
        }
    }

    return enRet;
}

/**
 * @brief  Get DMA Tx descriptor flag status.
 * @param  [in] pstcTxDesc                  Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] u32Flag                     DMA Tx descriptor flag type
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_DMATXDESC_OWN:        OWN bit
 *           @arg ETH_DMATXDESC_IOC:        Interrupt on Completion
 *           @arg ETH_DMATXDESC_TLS:        Transmit Last Segment
 *           @arg ETH_DMATXDESC_TFS:        Transmit First Segment
 *           @arg ETH_DMATXDESC_DCRC:       Disable CRC
 *           @arg ETH_DMATXDESC_DPAD:       Disable Padding
 *           @arg ETH_DMATXDESC_TTSE:       Transmit Time Stamp Enable
 *           @arg ETH_DMATXDESC_CRCR:       CRC Replace Control
 *           @arg ETH_DMATXDESC_TER:        Transmit End of Ring
 *           @arg ETH_DMATXDESC_TSAC:       Second Address Chained
 *           @arg ETH_DMATXDESC_TTSS:       Tx Time Stamp Status
 *           @arg ETH_DMATXDESC_IHE:        IP Header Error
 *           @arg ETH_DMATXDESC_ETSUM:      Tx Error summary
 *           @arg ETH_DMATXDESC_JTE:        Jabber Timeout Error
 *           @arg ETH_DMATXDESC_FFF:        Frame Flushed
 *           @arg ETH_DMATXDESC_TPCE:       Payload Checksum Error
 *           @arg ETH_DMATXDESC_LOCE:       Loss Carrier Error
 *           @arg ETH_DMATXDESC_NCE:        No Carrier Error
 *           @arg ETH_DMATXDESC_TLCE:       Late Collision Error
 *           @arg ETH_DMATXDESC_ECE:        Excessive Collision Error
 *           @arg ETH_DMATXDESC_VLF:        VLAN Frame
 *           @arg ETH_DMATXDESC_EDE:        Excessive Deferral Error
 *           @arg ETH_DMATXDESC_UDE:        Underflow Error
 *           @arg ETH_DMATXDESC_DEE:        Deferred Error
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t ETH_DMA_GetTxDescStatus(const stc_eth_dma_desc_t *pstcTxDesc, uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = Reset;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_DMATXDESC_STATUS(u32Flag));

