RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_eth.c
    if (NULL != pstcTxDesc)
    {
        if (0UL != (pstcTxDesc->u32ControlStatus & u32Flag))
        {
            enFlagSta = Set;
        }
    }

    return enFlagSta;
}

/**
 * @brief  Get DMA Tx descriptor collision count
 * @param  [in] pstcTxDesc                  Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [out] pu32ColliCnt               Pointer to DMA Tx collision count
 * @retval An en_result_t enumeration value:
 *           - Ok: Get collision count success
 *           - ErrorInvalidParameter: pstcTxDesc == NULL or pu32ColliCnt == NULL
 */
en_result_t ETH_DMA_GetTxDescCollisionCnt(const stc_eth_dma_desc_t *pstcTxDesc, uint32_t *pu32ColliCnt)
{
    en_result_t enRet = Ok;

    if ((NULL == pstcTxDesc) || (NULL == pu32ColliCnt))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        *pu32ColliCnt = (pstcTxDesc->u32ControlStatus >> ETH_DMATXDESC_COLLISION_COUNTSHIFT) & ((uint32_t)0x0000000FUL);
    }

    return enRet;
}

/**
 * @brief  Get DMA Tx descriptor timestamp.
 * @param  [in] pstcTxDesc                  Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [out] pu32High                   Timestamp high bit time
 * @param  [out] pu32Low                    Timestamp low bit time
 * @retval An en_result_t enumeration value:
 *           - Ok: Get timestamp success
 *           - ErrorInvalidParameter: pstcTxDesc == NULL or pu32High == NULL or pu32Low == NULL
 */
en_result_t ETH_DMA_GetTxDescTimeStamp(const stc_eth_dma_desc_t *pstcTxDesc, uint32_t *pu32High, uint32_t *pu32Low)
{
    en_result_t enRet = Ok;

    if ((NULL == pstcTxDesc) || (NULL == pu32High) || (NULL == pu32Low))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        *pu32Low  = pstcTxDesc->u32TimeStampLow;
        *pu32High = pstcTxDesc->u32TimeStampHigh;
    }

    return enRet;
}

/**
 * @brief  Set DMA Rx descriptor own bit.
 * @param  [in] pstcRxDesc                  Pointer to a DMA Rx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] u32Owner                    DMA Rx descriptor owner
 *         This parameter can be one of the following values:
 *           @arg ETH_DMADESC_OWN_CPU:      Descriptor is owned by CPU
 *           @arg ETH_DMADESC_OWN_DMA:      Descriptor is owned by DMA
 * @retval An en_result_t enumeration value:
 *           - Ok: Set Rx descriptor own bit success
 *           - ErrorInvalidParameter: pstcRxDesc == NULL
 */
en_result_t ETH_DMA_SetRxDescOwn(stc_eth_dma_desc_t *pstcRxDesc, uint32_t u32Owner)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRxDesc)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_DMADESC_OWN(u32Owner));

        if (ETH_DMADESC_OWN_CPU != u32Owner)
        {
            SET_REG32_BIT(pstcRxDesc->u32ControlStatus, ETH_DMARXDESC_OWN);
        }
        else
        {
            CLEAR_REG32_BIT(pstcRxDesc->u32ControlStatus, ETH_DMARXDESC_OWN);
        }
    }

    return enRet;
}

/**
 * @brief  Enable or disable DMA Rx finished interrupt.
 * @param  [in] pstcRxDesc                  Pointer to a DMA Rx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] enNewSta                    The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval An en_result_t enumeration value:
 *           - Ok: Rx interrupt configure success
 *           - ErrorInvalidParameter: pstcRxDesc == NULL
 */
en_result_t ETH_DMA_RxDescIntCmd(stc_eth_dma_desc_t *pstcRxDesc, en_functional_state_t enNewSta)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRxDesc)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

        if (Disable != enNewSta)
        {
            CLEAR_REG32_BIT(pstcRxDesc->u32ControlBufferSize, ETH_DMARXDESC_DIC);
        }
        else
        {
            SET_REG32_BIT(pstcRxDesc->u32ControlBufferSize, ETH_DMARXDESC_DIC);
        }
    }

    return enRet;
}

/**
 * @brief  Get DMA Rx descriptor flag status.
 * @param  [in] pstcRxDesc                  Pointer to a DMA Rx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] u32Flag                     DMA Rx descriptor flag type
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_DMARXDESC_OWN:              OWN bit
 *           @arg ETH_DMARXDESC_DAF:              DA Filter Fail for the received frame
 *           @arg ETH_DMARXDESC_ERSUM:            Rx Error summary
 *           @arg ETH_DMARXDESC_DPE:              Descriptor Error
 *           @arg ETH_DMARXDESC_SAF:              SA Filter Fail for the received frame
 *           @arg ETH_DMARXDESC_LEE:              Length Error
 *           @arg ETH_DMARXDESC_OVE:              Overflow Error
 *           @arg ETH_DMARXDESC_VLAT              VLAN Tag
 *           @arg ETH_DMARXDESC_RFS:              First descriptor
 *           @arg ETH_DMARXDESC_RLS:              Last descriptor
 *           @arg ETH_DMARXDESC_IPE_TSPA_GF:      COE Error or Time stamp valid or jumbo frame
 *           @arg ETH_DMARXDESC_RLCE:             Late collision Error
 *           @arg ETH_DMARXDESC_FRAT:             Frame type
 *           @arg ETH_DMARXDESC_WTE:              Receive Watchdog Timeout
 *           @arg ETH_DMARXDESC_REE:              Receive error
 *           @arg ETH_DMARXDESC_DBE:              Dribble bit error
 *           @arg ETH_DMARXDESC_CRE:              CRC error
 *           @arg ETH_DMARXDESC_DAS_ESA:          MAC Address Filter/Status bit extension
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t ETH_DMA_GetRxDescStatus(const stc_eth_dma_desc_t *pstcRxDesc, uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = Reset;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_DMARXDESC_STATUS(u32Flag));

    if (NULL != pstcRxDesc)
    {
        if (0UL != (pstcRxDesc->u32ControlStatus & u32Flag))
        {
            enFlagSta = Set;
        }
    }

