RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_eth.c
    return enFlagSta;
}

/**
 * @brief  Get DMA Rx descriptor extend flag status.
 * @param  [in] pstcRxDesc                  Pointer to a DMA Rx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] u32Flag                     DMA Rx descriptor extend flag type
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_DMARXDESC_L4FMS:      L4 Port Filter Status
 *           @arg ETH_DMARXDESC_L3FMS:      L3 Address Filter Status
 *           @arg ETH_DMARXDESC_TSPD:       Discard Time Stamp
 *           @arg ETH_DMARXDESC_PTPV:       PTP Version
 *           @arg ETH_DMARXDESC_PTPFT:      PTP Frame Type
 *           @arg ETH_DMARXDESC_IPV6DR:     IPv6 Packet Received
 *           @arg ETH_DMARXDESC_IPV4DR:     IPv4 Packet Received
 *           @arg ETH_DMARXDESC_IPCB:       COE engine Bypassed
 *           @arg ETH_DMARXDESC_IPPE:       IP Payload Error
 *           @arg ETH_DMARXDESC_IPHE:       IP Header Error
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t ETH_DMA_GetRxDescExtendStatus(const stc_eth_dma_desc_t *pstcRxDesc, uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = Reset;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_DMARXDESC_EXTEND_STATUS(u32Flag));

    if (NULL != pstcRxDesc)
    {
        if (0UL != (pstcRxDesc->u32ExtendStatus & u32Flag))
        {
            enFlagSta = Set;
        }
    }

    return enFlagSta;
}

/**
 * @brief  Get DMA Rx descriptor payload type.
 * @param  [in] pstcRxDesc                  Pointer to a DMA Rx descriptor @ref stc_eth_dma_desc_t
 * @param  [out] pu32PayloadType            Pointer to DMA Rx payload type
 *           The payload type may be one of the following values:
 *           - ETH_DMARXDESC_IPPT_UNKNOWN:  Unknown
 *           - ETH_DMARXDESC_IPPT_UDP:      UDP
 *           - ETH_DMARXDESC_IPPT_TCP:      TCP
 *           - ETH_DMARXDESC_IPPT_ICMP:     ICMP
 * @retval An en_result_t enumeration value:
 *           - Ok: Get payload type success
 *           - ErrorInvalidParameter: pstcRxDesc == NULL or pu32PayloadType == NULL
 */
en_result_t ETH_DMA_GetRxDescPayloadType(const stc_eth_dma_desc_t *pstcRxDesc, uint32_t *pu32PayloadType)
{
    en_result_t enRet = Ok;

    if ((NULL == pstcRxDesc) || (NULL == pu32PayloadType))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        *pu32PayloadType = pstcRxDesc->u32ExtendStatus & ETH_DMARXDESC_IPPT;
    }

    return enRet;
}

/**
 * @brief  Get DMA Rx descriptor datagram type.
 * @param  [in] pstcRxDesc                  Pointer to a DMA Rx descriptor @ref stc_eth_dma_desc_t
 * @param  [out] pu32DatagramType           Pointer to DMA Rx datagram type
 *           The payload type may be one of the following values:
 *           - ETH_DMARXDESC_MTP_NONE:                  No PTP messages
 *           - ETH_DMARXDESC_MTP_SYNC:                  SYNC message (all clock types)
 *           - ETH_DMARXDESC_MTP_FOLLOWUP:              Follow_Up message (all clock types)
 *           - ETH_DMARXDESC_MTP_DELAYREQ:              Delay_Req message (all clock types)
 *           - ETH_DMARXDESC_MTP_DELAYRESP:             Delay_Resp message (all clock types)
 *           - ETH_DMARXDESC_MTP_PDELAYREQ:             Pdelay_Req message (peer-to-peer transparent clock)
 *           - ETH_DMARXDESC_MTP_PDELAYRESP:            Pdelay_Resp message (peer-to-peer transparent clock)
 *           - ETH_DMARXDESC_MTP_PDELAYRESP_FOLLOWUP:   Pdelay_Resp_Follow_Up message (peer-to-peer transparent clock)
 *           - ETH_DMARXDESC_MTP_ANNOUNCE:              Announce message (Ordinary or Boundary clock)
 *           - ETH_DMARXDESC_MTP_MANAGEMENT:            Management message (Ordinary or Boundary clock)
 *           - ETH_DMARXDESC_MTP_SIGNALING:             Signaling message (Ordinary or Boundary clock)
 *           - ETH_DMARXDESC_MTP_DEFAULT:               Default Datagram Type
 * @retval An en_result_t enumeration value:
 *           - Ok: Get datagram type success
 *           - ErrorInvalidParameter: pstcRxDesc == NULL or pu32DatagramType == NULL
 */
en_result_t ETH_DMA_GetRxDescDatagramType(const stc_eth_dma_desc_t *pstcRxDesc, uint32_t *pu32DatagramType)
{
    en_result_t enRet = Ok;

    if ((NULL == pstcRxDesc) || (NULL == pu32DatagramType))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        *pu32DatagramType = pstcRxDesc->u32ExtendStatus & ETH_DMARXDESC_MTP;
    }

    return enRet;
}

/**
 * @brief  Get DMA Rx descriptor frame length.
 * @param  [in] pstcRxDesc                  Pointer to a DMA Rx descriptor @ref stc_eth_dma_desc_t
 * @param  [out] pu32FrameLength            Pointer to DMA Rx frame length
 * @retval An en_result_t enumeration value:
 *           - Ok: Get frame length success
 *           - ErrorInvalidParameter: pstcRxDesc == NULL or pu32FrameLength == NULL
 */
en_result_t ETH_DMA_GetRxDescFrameLength(const stc_eth_dma_desc_t *pstcRxDesc, uint32_t *pu32FrameLength)
{
    en_result_t enRet = Ok;

    if ((NULL == pstcRxDesc) || (NULL == pu32FrameLength))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        *pu32FrameLength = (pstcRxDesc->u32ControlStatus >> ETH_DMARXDESC_FRAME_LENGTHSHIFT) & ((uint32_t)0x00003FFFUL);
    }

    return enRet;
}

/**
 * @brief  Get DMA Rx descriptor buffer size.
 * @param  [in] pstcRxDesc                  Pointer to a DMA Rx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] u8BufferNum                 Buffer sequence number
 *         This parameter can be one of the following values:
 *           @arg ETH_DMADESC_BUFFER1:      DMA Rx Desc Buffer1
 *           @arg ETH_DMADESC_BUFFER2:      DMA Rx Desc Buffer2
 * @param  [out] pu32BufferSize             Pointer to DMA Rx buffer size
 * @retval An en_result_t enumeration value:
 *           - Ok: Get buffer size success
 *           - ErrorInvalidParameter: pstcRxDesc == NULL or pu32BufferSize == NULL
 */
en_result_t ETH_DMA_GetRxDescBufferSize(const stc_eth_dma_desc_t *pstcRxDesc, uint8_t u8BufferNum, uint32_t *pu32BufferSize)
{
    en_result_t enRet = Ok;
    uint32_t u32ShiftBit = 0UL;

    if ((NULL == pstcRxDesc) || (NULL == pu32BufferSize))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_DMADESC_BUFFER(u8BufferNum));

        /* DMA Rx Desc buffer2 */
        if (ETH_DMADESC_BUFFER1 != u8BufferNum)
        {
            u32ShiftBit = ETH_DMADESC_BUFFER2_SIZESHIFT;
        }
        *pu32BufferSize = (pstcRxDesc->u32ControlBufferSize >> u32ShiftBit) & ((uint32_t)0x00001FFFUL);
    }

    return enRet;
}

/**
 * @brief  Get DMA Rx descriptor timestamp.
 * @param  [in] pstcRxDesc                  Pointer to a DMA Rx descriptor @ref stc_eth_dma_desc_t
 * @param  [out] pu32High                   Timestamp high bit time
 * @param  [out] pu32Low                    Timestamp low bit time
 * @retval An en_result_t enumeration value:
 *           - Ok: Get timestamp success
 *           - ErrorInvalidParameter: pstcRxDesc == NULL or pu32High == NULL or pu32Low == NULL
 */
en_result_t ETH_DMA_GetRxDescTimeStamp(const stc_eth_dma_desc_t *pstcRxDesc, uint32_t *pu32High, uint32_t *pu32Low)
{
    en_result_t enRet = Ok;

    if ((NULL == pstcRxDesc) || (NULL == pu32High) || (NULL == pu32Low))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        *pu32Low  = pstcRxDesc->u32TimeStampLow;
        *pu32High = pstcRxDesc->u32TimeStampHigh;
    }

    return enRet;
}

/******************************************************************************/
/*                                PMT Functions                               */
/******************************************************************************/
/**
 * @brief  Reset PMT wakeup frame pointer.
 * @param  None
 * @retval An en_result_t enumeration value:
 *           - Ok: Reset pointer success
 *           - ErrorTimeout: Reset timeout
 */
en_result_t ETH_PMT_ResetWakeupFramePointer(void)
{
    __IO uint32_t u32Count;
    en_result_t enRet = Ok;

    WRITE_REG32(bM4_ETH->MAC_PMTCTLR_b.RTWKFR, 1U);
    u32Count = ETH_TIMEOUT_WRITE_REGISTER * (HCLK_VALUE / 20000UL);
    while (0UL != READ_REG32(bM4_ETH->MAC_PMTCTLR_b.RTWKFR))
    {
        if (0UL == u32Count)
        {
            enRet = ErrorTimeout;
            break;
        }
        u32Count--;
    }

    return enRet;
}
/**
 * @brief  Write PMT wakeup frame register.
 * @param  [in] au32RegBuffer                Pointer to wakeup frame filter register buffer(8 words).
 * @retval An en_result_t enumeration value:
 *           - Ok: Write register success
 *           - ErrorInvalidParameter: au32RegBuffer == NULL
 */
en_result_t ETH_PMT_WriteWakeupFrameRegister(const uint32_t au32RegBuffer[])
{
    uint32_t i;
    en_result_t enRet = Ok;

    if (NULL == au32RegBuffer)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        for (i=0U; i<ETH_WAKEUP_REGISTER_LENGTH; i++)
        {
            WRITE_REG32(M4_ETH->MAC_RTWKFFR, au32RegBuffer[i]);
        }
    }

    return enRet;
}

/**
 * @brief  Enable or disable PMT forward wakeup frame.
 * @param  [in] enNewSta                    The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void ETH_PMT_ForwardWakeupFrameCmd(en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

