RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_eth.c
    WRITE_REG32(bM4_ETH->MAC_PMTCTLR_b.RTWKTR, enNewSta);
}

/**
 * @brief  Enable or disable PMT wakeup source.
 * @param  [in] u32WakeupSrc              Wakeup source
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_PMT_WAKEUP_GLOBAL_UNICAST:    Global unicast
 *           @arg ETH_PMT_WAKEUP_WAKEUP_FRAME:      Wake-Up Frame
 *           @arg ETH_PMT_WAKEUP_MAGIC_PACKET:      Magic Packet
 * @param  [in] enNewSta                    The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void ETH_PMT_WakeupSourceCmd(uint32_t u32WakeupSrc, en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    if (Disable != enNewSta)
    {
        SET_REG32_BIT(M4_ETH->MAC_PMTCTLR, u32WakeupSrc);
    }
    else
    {
        CLEAR_REG32_BIT(M4_ETH->MAC_PMTCTLR, u32WakeupSrc);
    }
}

/**
 * @brief  Enable or disable PMT powerdown mode.
 * @param  None
 * @retval An en_result_t enumeration value:
 *           - Ok: Set powerdown mode success
 *           - Error: Set powerdown mode failed
 */
en_result_t ETH_PMT_EnterPowerDown(void)
{
    en_result_t enRet = Error;

    if (0UL != READ_REG32(bM4_ETH->MAC_PMTCTLR_b.MPEN))
    {
        if (0UL != READ_REG32(bM4_ETH->MAC_PMTCTLR_b.WKEN))
        {
            WRITE_REG32(bM4_ETH->MAC_PMTCTLR_b.PWDN, Enable);
            enRet = Ok;
        }
    }

    return enRet;
}

/**
 * @brief  Get PMT flag status.
 * @param  [in] u32Flag                     PMT flag type
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_PMT_FLAG_RTWKFR:      Wake-Up Frame Filter Register Pointer Reset
 *           @arg ETH_PMT_FLAG_WKFR:        Wake-Up Frame Received
 *           @arg ETH_PMT_FLAG_MPFR:        Magic Packet Received
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t ETH_PMT_GetStatus(uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = Reset;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_PMT_FLAG(u32Flag));

    if (0UL != (READ_REG32_BIT(M4_ETH->MAC_PMTCTLR, u32Flag)))
    {
        enFlagSta = Set;
    }

    return enFlagSta;
}

/******************************************************************************/
/*                                MMC Functions                               */
/******************************************************************************/
/**
 * @brief  De-Initialize MMC.
 * @param  None
 * @retval An en_result_t enumeration value:
 *           - Ok: MMC De-Initialize success
*           - ErrorTimeout: De-Initialize timeout
 */
en_result_t ETH_MMC_DeInit(void)
{
    WRITE_REG32(M4_ETH->MMC_MMCCTLR, 0UL);
    WRITE_REG32(M4_ETH->MMC_RITCTLR, 0UL);
    WRITE_REG32(M4_ETH->MMC_TITCTLR, 0UL);

    return ETH_MMC_CounterReset();
}

/**
 * @brief  Initialize MMC.
 * @param  [in] pstcMmcInit                 Pointer to a @ref stc_eth_mmc_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: MMC Initialize success
 *           - ErrorInvalidParameter: pstcMmcInit == NULL
 */
en_result_t ETH_MMC_Init(const stc_eth_mmc_init_t *pstcMmcInit)
{
    en_result_t enRet = Ok;

    if (NULL == pstcMmcInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_MMC_COUNTER_PRESETMODE(pstcMmcInit->u32PresetMode));
        DDL_ASSERT(IS_ETH_MMC_READ_RESET(pstcMmcInit->u32ReadReset));
        DDL_ASSERT(IS_ETH_MMC_COUNTER_RELOAD(pstcMmcInit->u32ReloadMode));

        MODIFY_REG32(M4_ETH->MMC_MMCCTLR,
                     (ETH_MMC_MMCCTLR_MCPSEL | ETH_MMC_MMCCTLR_MCPSET |
                      ETH_MMC_MMCCTLR_ROR    | ETH_MMC_MMCCTLR_COS),
                     (pstcMmcInit->u32PresetMode | pstcMmcInit->u32ReadReset |
                      pstcMmcInit->u32ReloadMode));
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_eth_mmc_init_t to default values.
 * @param  [out] pstcMmcInit                Pointer to a @ref stc_eth_mmc_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Structure Initialize success
 *           - ErrorInvalidParameter: pstcMmcInit == NULL
 */
en_result_t ETH_MMC_StructInit(stc_eth_mmc_init_t *pstcMmcInit)
{
    en_result_t enRet = Ok;

    if (NULL == pstcMmcInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcMmcInit->u32PresetMode = ETH_MMC_COUNTER_PRESETMODE_DISABLE;
        pstcMmcInit->u32ReadReset  = ETH_MMC_READ_RESET_ENABLE;
        pstcMmcInit->u32ReloadMode = ETH_MMC_COUNTER_RELOAD_ENABLE;
    }

    return enRet;
}

/**
 * @brief  MMC all counter software reset.
 * @param  None
 * @retval An en_result_t enumeration value:
 *           - Ok: Reset success
 *           - ErrorTimeout: Reset timeout
 */
en_result_t ETH_MMC_CounterReset(void)
{
    __IO uint32_t u32Count;
    en_result_t enRet = Ok;

    WRITE_REG32(bM4_ETH->MMC_MMCCTLR_b.CRST, 1U);
    u32Count = ETH_TIMEOUT_WRITE_REGISTER * (HCLK_VALUE / 20000UL);
    while (0UL != READ_REG32(bM4_ETH->MMC_MMCCTLR_b.CRST))
    {
        if (0UL == u32Count)
        {
            enRet = ErrorTimeout;
            break;
        }
        u32Count--;
    }

    return enRet;
}

/**
 * @brief  Enable or disable the reset of all MMC counter after reading.
 * @param  [in] enNewSta                    The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void ETH_MMC_ResetAfterReadCmd(en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    WRITE_REG32(bM4_ETH->MMC_MMCCTLR_b.ROR, enNewSta);
}

/**
 * @brief  Enable or disable MMC function.
 * @param  [in] enNewSta                    The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void ETH_MMC_Cmd(en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

