RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_eth.c
    if (Disable != enNewSta)
    {
        WRITE_REG32(bM4_ETH->MMC_MMCCTLR_b.MCF, Disable);
    }
    else
    {
        WRITE_REG32(bM4_ETH->MMC_MMCCTLR_b.MCF, Enable);
    }
}

/**
 * @brief  Enable or disable MMC transmit interrupt.
 * @param  [in] u32IntSrc                   MMC interrupt source
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_MMC_INT_TXEDEIM:      Tx excessive deferral error frame interrupt
 *           @arg ETH_MMC_INT_TXUGIM:       Tx unicast good frame interrupt
 *           @arg ETH_MMC_INT_TXCAEIM:      Tx carrier error frame interrupt
 *           @arg ETH_MMC_INT_TXECEIM:      Tx excessive collision error frame interrupt
 *           @arg ETH_MMC_INT_TXLCEIM:      Tx deferral collision error frame interrupt
 *           @arg ETH_MMC_INT_TXDEEIM:      Tx deferral error frame interrupt
 *           @arg ETH_MMC_INT_TXMGIM:       Tx multicast good frame interrupt
 *           @arg ETH_MMC_INT_TXBGIM:       Tx broadcast good frame interrupt
 * @param  [in] enNewSta                    The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void ETH_MMC_TxIntCmd(uint32_t u32IntSrc, en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_MMC_TX_INTERRUPT(u32IntSrc));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    if (Disable != enNewSta)
    {
        CLEAR_REG32_BIT(M4_ETH->MMC_TITCTLR, u32IntSrc);
    }
    else
    {
        SET_REG32_BIT(M4_ETH->MMC_TITCTLR, u32IntSrc);
    }
}

/**
 * @brief  Enable or disable MMC receive interrupt.
 * @param  [in] u32IntSrc                   MMC interrupt source
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_MMC_INT_RXOEIM:       Rx out of scope error frame interrupt
 *           @arg ETH_MMC_INT_RXLEIM:       Rx length error frame interrupt
 *           @arg ETH_MMC_INT_RXUGIM:       Rx unicast good frame interrupt
 *           @arg ETH_MMC_INT_RXREIM:       Rx short error frame interrupt
 *           @arg ETH_MMC_INT_RXAEIM:       Rx alignment error frame interrupt
 *           @arg ETH_MMC_INT_RXCEIM:       Rx crc error frame interrupt
 *           @arg ETH_MMC_INT_RXMGIM:       Rx multicast good frame interrupt
 *           @arg ETH_MMC_INT_RXBGIM:       Rx broadcast good frame interrupt
 * @param  [in] enNewSta                    The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void ETH_MMC_RxIntCmd(uint32_t u32IntSrc, en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_MMC_RX_INTERRUPT(u32IntSrc));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    if (Disable != enNewSta)
    {
        CLEAR_REG32_BIT(M4_ETH->MMC_RITCTLR, u32IntSrc);
    }
    else
    {
        SET_REG32_BIT(M4_ETH->MMC_RITCTLR, u32IntSrc);
    }
}

/**
 * @brief  Get MMC flag transmit status.
 * @param  [in] u32Flag                     MMC flag type
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_MMC_FLAG_TXEDEIS:     Tx excessive deferral error frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_TXUGIS:      Tx unicast good frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_TXCAEIS:     Tx carrier error frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_TXECEIS:     Tx excessive collision error frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_TXLCEIS:     Tx deferral collision error frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_TXDEEIS:     Tx deferral error frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_TXMGIS:      Tx multicast good frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_TXBGIS:      Tx broadcast good frame counter reaches half or all the maximum value
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t ETH_MMC_GetTxStatus(uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = Reset;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_MMC_TX_FLAG(u32Flag));

    if (0UL != (READ_REG32_BIT(M4_ETH->MMC_TRSSTSR, u32Flag)))
    {
        enFlagSta = Set;
    }

    return enFlagSta;
}

/**
 * @brief  Get MMC receive flag status.
 * @param  [in] u32Flag                     MMC flag type
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_MMC_FLAG_RXOEIS:      Rx out of scope error frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_RXLEIS:      Rx length error frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_RXUGIS:      Rx unicast good frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_RXREIS:      Rx short error frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_RXAEIS:      Rx alignment error frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_RXCEIS:      Rx crc error frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_RXMGIS:      Rx multicast good frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_RXBGIS:      Rx broadcast good frame counter reaches half or all the maximum value
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t ETH_MMC_GetRxStatus(uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = Reset;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_MMC_RX_FLAG(u32Flag));

    if (0UL != (READ_REG32_BIT(M4_ETH->MMC_REVSTSR, u32Flag)))
    {
        enFlagSta = Set;
    }

    return enFlagSta;
}

/**
 * @brief  Get MMC register.
 * @param  [in] u32Reg                      MMC statistics register
 *         This parameter can be one of the following values:
 *           @arg ETH_MMC_REG_TXBRGFR:      Tx broadcast good frame Statistical Register
 *           @arg ETH_MMC_REG_TXMUGFR:      Tx multicast good frame Statistical Register
 *           @arg ETH_MMC_REG_TXDEEFR:      Tx deferral error frame Statistical Register
 *           @arg ETH_MMC_REG_TXLCEFR:      Tx deferral collision error frame Statistical Register
 *           @arg ETH_MMC_REG_TXECEFR:      Tx excessive collision error frame Statistical Register
 *           @arg ETH_MMC_REG_TXCAEFR:      Tx carrier error frame Statistical Register
 *           @arg ETH_MMC_REG_TXUNGFR:      Tx unicast good frame Statistical Register
 *           @arg ETH_MMC_REG_TXEDEFR:      Tx excessive deferral error frame Statistical Register
 *           @arg ETH_MMC_REG_RXBRGFR:      Rx broadcast good frame Statistical Register
 *           @arg ETH_MMC_REG_RXMUGFR:      Rx multicast good frame Statistical Register
 *           @arg ETH_MMC_REG_RXCREFR:      Rx crc error frame Statistical Register
 *           @arg ETH_MMC_REG_RXALEFR:      Rx alignment error frame Statistical Register
 *           @arg ETH_MMC_REG_RXRUEFR:      Rx short error frame Statistical Register
 *           @arg ETH_MMC_REG_RXUNGFR:      Rx unicast good frame Statistical Register
 *           @arg ETH_MMC_REG_RXLEEFR:      Rx length error frame Statistical Register
 *           @arg ETH_MMC_REG_RXOREFR:      Rx out of scope error frame Statistical Register
 * @retval uint32_t                         MMC statistics Register value
 */
uint32_t ETH_MMC_GetRegister(uint32_t u32Reg)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_MMC_REG(u32Reg));

    return (*(__IO uint32_t *)((uint32_t)(&M4_ETH->MAC_CONFIGR) + u32Reg));
}

/******************************************************************************/
/*                                PTP Functions                               */
/******************************************************************************/
/**
 * @brief  De-Initialize PTP.
 * @param  None
 * @retval None
 */
void ETH_PTP_DeInit(void)
{
    WRITE_REG32(M4_ETH->PTP_TSPCTLR, 0x00002000UL);
    WRITE_REG32(M4_ETH->PTP_TSPADDR, 0UL);
    WRITE_REG32(M4_ETH->PTP_TSPNSAR, 0UL);
    WRITE_REG32(M4_ETH->PTP_TMUSECR, 0UL);
    WRITE_REG32(M4_ETH->PTP_TMUNSER, 0UL);
}

/**
 * @brief  Initialize PTP.
 * @param  [in] pstcPtpInit                 Pointer to a @ref stc_eth_ptp_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: PTP Initialize success
 *           - Error: PTP Initialize failed
 *           - ErrorInvalidParameter: pstcPtpInit == NULL
 */
en_result_t ETH_PTP_Init(const stc_eth_ptp_init_t *pstcPtpInit)
{
    en_result_t enRet;

    if (NULL == pstcPtpInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_PTP_FRAME_DA_FILTER(pstcPtpInit->u32DAFilter));
        DDL_ASSERT(IS_ETH_PTP_DATAGRAM_VERSION(pstcPtpInit->u32DatagramVersion));
        DDL_ASSERT(IS_ETH_PTP_SUBSECOND_SCALE(pstcPtpInit->u32SubSecScale));
        DDL_ASSERT(IS_ETH_PTP_DATAGRAM_TYPE(pstcPtpInit->u32SnapDatagramType));
        DDL_ASSERT(IS_ETH_PTP_FRAME_TYPE(pstcPtpInit->u32SnapFrameType));
        DDL_ASSERT(IS_ETH_PTP_CALIBRATION_MODE(pstcPtpInit->u32CalibMode));
        DDL_ASSERT(IS_ETH_PTP_SUB_SECOND(pstcPtpInit->u32InitValueSubSec));

