RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_eth.c
        /* Set increase value registers */
        WRITE_REG32(M4_ETH->PTP_TSPNSAR, pstcPtpInit->u8IncValueSubSec);
        WRITE_REG32(M4_ETH->PTP_TSPADDR, pstcPtpInit->u32IncValueBasic);
        enRet = ETH_PTP_UpdateBasicIncValue();
        if (Ok == enRet)
        {
            /* Set timestamp control register */
            MODIFY_REG32(M4_ETH->PTP_TSPCTLR, ETH_PTP_TSPCTLR_CLEAR_MASK,
                         (pstcPtpInit->u32DAFilter        | pstcPtpInit->u32SnapDatagramType | pstcPtpInit->u32SnapFrameType |
                          pstcPtpInit->u32DatagramVersion | pstcPtpInit->u32SubSecScale      | pstcPtpInit->u32CalibMode));
            /* Set initialize value */
            WRITE_REG32(M4_ETH->PTP_TMUSECR, pstcPtpInit->u32InitValueSec);
            WRITE_REG32(M4_ETH->PTP_TMUNSER, pstcPtpInit->u32InitValueSubSec);
            enRet = ETH_PTP_SystemTimeInit();
            if (Ok != enRet)
            {
                enRet = Error;
            }
        }
        else
        {
            enRet = Error;
        }
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_eth_ptp_init_t to default values.
 * @param  [out] pstcPtpInit                Pointer to a @ref stc_eth_ptp_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Structure Initialize success
 *           - ErrorInvalidParameter: pstcPtpInit == NULL
 */
en_result_t ETH_PTP_StructInit(stc_eth_ptp_init_t *pstcPtpInit)
{
    en_result_t enRet = Ok;

    if (NULL == pstcPtpInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcPtpInit->u32DAFilter         = ETH_PTP_FRAME_DA_FILTER_DISABLE;
        pstcPtpInit->u32SnapDatagramType = ETH_PTP_DATAGRAM_TYPE_SYNC_FOLLOW_DELAY;
        pstcPtpInit->u32SnapFrameType    = ETH_PTP_FRAME_TYPE_IPV4FRAME;
        pstcPtpInit->u32DatagramVersion  = ETH_PTP_DATAGRAM_VERSION_IEEE1588V1;
        pstcPtpInit->u32SubSecScale      = ETH_PTP_SUBSECOND_SCALE_HEX;
        pstcPtpInit->u32CalibMode        = ETH_PTP_CALIBRATION_MODE_COARSE;
        pstcPtpInit->u32IncValueBasic    = 0UL;
        pstcPtpInit->u8IncValueSubSec    = 0U;
        pstcPtpInit->u32InitValueSec     = 0UL;
        pstcPtpInit->u32InitValueSubSec  = 0UL;
    }

    return enRet;
}

/**
 * @brief  Set PTP snapshot datagram type.
 * @param  [in] u32DatagramType             Snapshot datagram type
 *         This parameter can be one of the following values:
 *           @arg ETH_PTP_DATAGRAM_TYPE_SYNC_FOLLOW_DELAY:         SYNC Follow_Up Delay_Req Delay_Resp
 *           @arg ETH_PTP_DATAGRAM_TYPE_SYNC:                      SYNC
 *           @arg ETH_PTP_DATAGRAM_TYPE_DELAY:                     Delay_Req
 *           @arg ETH_PTP_DATAGRAM_TYPE_SYNC_FOLLOW_DELAY_PDELAY:  SYNC Follow_Up Delay_Req Delay_Resp Pdelay_Req Pdelay_Resp Pdelay_Resp_Follow_Up
 *           @arg ETH_PTP_DATAGRAM_TYPE_SYNC_PDELAY:               SYNC Pdelay_Req Pdelay_Resp
 *           @arg ETH_PTP_DATAGRAM_TYPE_DELAY_PDEALY:              Delay_Req Pdelay_Req Pdelay_Resp
 *           @arg ETH_PTP_DATAGRAM_TYPE_SYNC_DELAY:                SYNC Delay_Req
 *           @arg ETH_PTP_DATAGRAM_TYPE_PDELAY:                    Pdelay_Req Pdelay_Resp
 * @retval None
 */
void ETH_PTP_SetSnapDatagramType(uint32_t u32DatagramType)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_PTP_DATAGRAM_TYPE(u32DatagramType));

    MODIFY_REG32(M4_ETH->PTP_TSPCTLR, ETH_PTP_TSPCTLR_TSPMTSEL, u32DatagramType);
}

/**
 * @brief  Set PTP snapshot frame type.
 * @param  [in] u32FrameType              Snapshot frame type
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_PTP_FRAME_TYPE_IPV4FRAME:            snapshot of IPv4 frame
 *           @arg ETH_PTP_FRAME_TYPE_IPV6FRAME:            snapshot of IPv6 frame
 *           @arg ETH_PTP_FRAME_TYPE_ETHERNETFRAME:        snapshot of PTP over ethernet frame
 *           @arg ETH_PTP_FRAME_TYPE_ALL_RECEIVEFRAME:     snapshot of all received frame
 * @retval None
 */
void ETH_PTP_SetSnapFrameType(uint32_t u32FrameType)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_PTP_FRAME_TYPE(u32FrameType));

    MODIFY_REG32(M4_ETH->PTP_TSPCTLR,
                 (ETH_PTP_TSPCTLR_TSPOVIPV4 | ETH_PTP_TSPCTLR_TSPOVIPV6 |
                  ETH_PTP_TSPCTLR_TSPOVETH  | ETH_PTP_TSPCTLR_TSPEALL),
                 u32FrameType);
}

/**
 * @brief  Set PTP timestamp calibration mode.
 * @param  [in] u32CalibMode                Timestamp calibration mode
 *         This parameter can be one of the following values:
 *           @arg ETH_PTP_CALIBRATION_MODE_COARSE:    Coarse calibration
 *           @arg ETH_PTP_CALIBRATION_MODE_FINE:      Fine calibration
 * @retval None
 */
void ETH_PTP_SetCalibMode(uint32_t u32CalibMode)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_PTP_CALIBRATION_MODE(u32CalibMode));

    WRITE_REG32(bM4_ETH->PTP_TSPCTLR_b.TSPUPSEL, u32CalibMode >> ETH_PTP_TSPCTLR_TSPUPSEL_POS);
}

/**
 * @brief  Update PTP timestamp basic increase value.
 * @note   Update Timestamp increase value by basic increase register.
 * @param  None
 * @retval An en_result_t enumeration value:
 *           - Ok: Update timestamp increase value success
 *           - Error: Current state cannot be updated
 *           - ErrorTimeout: Update timeout
 */
en_result_t ETH_PTP_UpdateBasicIncValue(void)
{
    __IO uint32_t u32Count;
    en_result_t enRet = Error;

    if (0UL == READ_REG32(bM4_ETH->PTP_TSPCTLR_b.TSPADUP))
    {
        WRITE_REG32(bM4_ETH->MMC_MMCCTLR_b.CRST, 1U);
        u32Count = ETH_TIMEOUT_WRITE_REGISTER * (HCLK_VALUE / 20000UL);
        while (0UL != READ_REG32(bM4_ETH->MMC_MMCCTLR_b.CRST))
        {
            if (0UL == u32Count)
            {
                enRet = ErrorTimeout;
                break;
            }
            u32Count--;
        }

        if (ErrorTimeout != enRet)
        {
            enRet = Ok;
        }
    }

    return enRet;
}

/**
 * @brief  Update PTP timestamp system time.
 * @note   Update Timestamp system time by update second and update subsecond registers.
 * @param  None
 * @retval An en_result_t enumeration value:
 *           - Ok: Update timestamp system time success
 *           - Error: Current state cannot be updated
 *           - ErrorTimeout: Update timeout
 */
en_result_t ETH_PTP_UpdateSystemTime(void)
{
    __IO uint32_t u32Count;
    en_result_t enRet = Error;

