RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_eth.c
    if (0UL == READ_REG32(bM4_ETH->PTP_TSPCTLR_b.TSPINI))
    {
        if (0UL == READ_REG32(bM4_ETH->PTP_TSPCTLR_b.TSPUP))
        {
            WRITE_REG32(bM4_ETH->PTP_TSPCTLR_b.TSPUP, 1U);
            u32Count = ETH_TIMEOUT_WRITE_REGISTER * (HCLK_VALUE / 20000UL);
            while (0UL != READ_REG32(bM4_ETH->PTP_TSPCTLR_b.TSPUP))
            {
                if (0UL == u32Count)
                {
                    enRet = ErrorTimeout;
                    break;
                }
                u32Count--;
            }

            if (ErrorTimeout != enRet)
            {
                enRet = Ok;
            }
        }
    }

    return enRet;
}

/**
 * @brief  Initialize PTP timestamp system time.
 * @note   Initialize Timestamp system time by update second and update subsecond registers.
 * @param  None
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize timestamp system time success
 *           - Error: Current state cannot be initialized
 *           - ErrorTimeout: Initialize timeout
 */
en_result_t ETH_PTP_SystemTimeInit(void)
{
    __IO uint32_t u32Count;
    en_result_t enRet = Error;

    if (0UL == READ_REG32(bM4_ETH->PTP_TSPCTLR_b.TSPINI))
    {
        WRITE_REG32(bM4_ETH->PTP_TSPCTLR_b.TSPINI, 1U);
        u32Count = ETH_TIMEOUT_WRITE_REGISTER * (HCLK_VALUE / 20000UL);
        while (0UL != READ_REG32(bM4_ETH->PTP_TSPCTLR_b.TSPINI))
        {
            if (0UL == u32Count)
            {
                enRet = ErrorTimeout;
                break;
            }
            u32Count--;
        }

        if (ErrorTimeout != enRet)
        {
            enRet = Ok;
        }
    }

    return enRet;
}

/**
 * @brief  Get PTP timestamp system time.
 * @param  [out] pu32Sec                    Pointer to Timestamp system time of Second
 * @param  [out] pu32SubSec                 Pointer to Timestamp system time of Subsecond
 * @retval An en_result_t enumeration value:
 *           - Ok: Get timestamp system time success
 *           - ErrorInvalidParameter: pu32Sec == NULL or pu32SubSec == NULL
 */
en_result_t ETH_PTP_GetSystemTime(uint32_t *pu32Sec, uint32_t *pu32SubSec)
{
    en_result_t enRet = Ok;

    if ((NULL == pu32Sec) || (NULL == pu32SubSec))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        *pu32Sec    = READ_REG32(M4_ETH->PTP_TMSSECR);
        *pu32SubSec = READ_REG32(M4_ETH->PTP_TMSNSER);
    }

    return enRet;
}

/**
 * @brief  Set PTP timestamp increase value.
 * @param  [in] u32BasicVal                 Timestamp increase value of Second (Between 0x0 and 0xFFFFFFFF)
 * @param  [in] u8SubSecVal                 Timestamp increase value of Subsecond (Between 0x0 and 0xFF)
 * @retval None
 */
void ETH_PTP_SetIncValue(uint32_t u32BasicVal, uint8_t u8SubSecVal)
{
    WRITE_REG32(M4_ETH->PTP_TSPADDR, u32BasicVal);
    WRITE_REG32(M4_ETH->PTP_TSPNSAR, u8SubSecVal);
}

/**
 * @brief  Get PTP timestamp increase value.
 * @param  [out] pu32BasicVal               Pointer to Timestamp increase value of basic
 * @param  [out] pu8SubSecVal               Pointer to Timestamp increase value of Subsecond
 * @retval An en_result_t enumeration value:
 *           - Ok: Get timestamp increase value success
 *           - ErrorInvalidParameter: pu32BasicVal == NULL or pu8SubSecVal == NULL
 */
en_result_t ETH_PTP_GetIncValue(uint32_t *pu32BasicVal, uint8_t *pu8SubSecVal)
{
    en_result_t enRet = Ok;

    if ((NULL == pu32BasicVal) || (NULL == pu8SubSecVal))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        *pu32BasicVal = READ_REG32(M4_ETH->PTP_TSPADDR);
        *pu8SubSecVal = (uint8_t)(READ_REG32(M4_ETH->PTP_TSPNSAR) & ETH_PTP_TSPNSAR_TSPNSEADD);
    }

    return enRet;
}

/**
 * @brief  Set PTP timestamp update time.
 * @param  [in] u32Sign                     Timestamp Update Sign
 *           @arg ETH_PTP_TIME_UPDATE_SIGN_MINUS:   Minus
 *           @arg ETH_PTP_TIME_UPDATE_SIGN_PLUS:    Plus
 * @param  [in] u32Sec                      Update time of Second (Between 0x0 and 0xFFFFFFFF)
 * @param  [in] u32SubSec                   Update time of Subsecond (Between 0x0 and 0x7FFFFFFF)
 * @retval None
 */
void ETH_PTP_SetUpdateTime(uint32_t u32Sign, uint32_t u32Sec, uint32_t u32SubSec)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_PTP_TIME_UPDATE_SIGN(u32Sign));
    DDL_ASSERT(IS_ETH_PTP_SUB_SECOND(u32SubSec));

    WRITE_REG32(M4_ETH->PTP_TMUSECR, u32Sec);
    WRITE_REG32(M4_ETH->PTP_TMUNSER, (u32Sign | u32SubSec));
}

/**
 * @brief  Enable or disable PTP function.
 * @param  [in] enNewSta                    The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void ETH_PTP_Cmd(en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    WRITE_REG32(bM4_ETH->PTP_TSPCTLR_b.TSPEN, enNewSta);
}

/**
 * @brief  Enable or disable PTP interrupt.
 * @param  [in] enNewSta                    The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void ETH_PTP_IntCmd(en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    WRITE_REG32(bM4_ETH->PTP_TSPCTLR_b.TSPINT, enNewSta);
}

/**
 * @brief  Get PTP flag status.
 * @param  [in] u32Flag                     PTP flag type
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_PTP_FLAG_TSERR1:      Target time 1 error
 *           @arg ETH_PTP_FLAG_TSTAR1:      Target time 1 reached
 *           @arg ETH_PTP_FLAG_TSERR0:      Target time 0 error
 *           @arg ETH_PTP_FLAG_TSTAR0:      Target time 0 reached
 *           @arg ETH_PTP_FLAG_TSOVF:       System time overflow
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t ETH_PTP_GetStatus(uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = Reset;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_PTP_FLAG(u32Flag));

    if (0UL != (READ_REG32_BIT(M4_ETH->PTP_TSPSTSR, u32Flag)))
    {
        enFlagSta = Set;
    }

