RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_eth.c
    return enFlagSta;
}

/******************************************************************************/
/*                            PTP PPS Functions                               */
/******************************************************************************/
/**
 * @brief  De-Initialize PTP PPS.
 * @param  [in] u8Ch                        PPS output channel
 *         This parameter can be one of the following values:
 *           @arg ETH_PPS_TARGET_CH0:       PPS Channel 0
 *           @arg ETH_PPS_TARGET_CH1:       PPS Channel 1
 * @retval None
 */
void ETH_PPS_DeInit(uint8_t u8Ch)
{
    uint32_t u32ShiftStep = 0UL;
    uint32_t u32ShiftBit = 0UL;
    __IO uint32_t *PTP_TMTSECR;
    __IO uint32_t *PTP_TMTNSER;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_PPS_TARGET_CH(u8Ch));

    if (ETH_PPS_TARGET_CH1 == u8Ch)
    {
        u32ShiftBit  = ETH_PTP_PPSCTLR_PPSFRE1_POS;
        u32ShiftStep = ETH_PTP_PPS1_TIME_REG_ADDRSHIFT;
    }
    CLEAR_REG32_BIT(M4_ETH->PTP_PPSCTLR,
                    ((ETH_PTP_PPSCTLR_PPSFRE0 | ETH_PTP_PPSCTLR_PPSOMD |
                     ETH_PTP_PPSCTLR_TT0SEL) << u32ShiftBit));
    /* Clear target time registers */
    PTP_TMTSECR = (__IO uint32_t *)ETH_PTP_TMTSECRx(u32ShiftStep);
    PTP_TMTNSER = (__IO uint32_t *)ETH_PTP_TMTNSERx(u32ShiftStep);
    WRITE_REG32(*PTP_TMTSECR, 0UL);
    WRITE_REG32(*PTP_TMTNSER, 0UL);
}

/**
 * @brief  Initialize PTP PPS.
 * @param  [in] u8Ch                        PPS output channel
 *         This parameter can be one of the following values:
 *           @arg ETH_PPS_TARGET_CH0:       PPS Channel 0
 *           @arg ETH_PPS_TARGET_CH1:       PPS Channel 1
 * @param  [in] pstcPpsInit                 Pointer to a @ref stc_eth_pps_config_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: PPS Initialize success
 *           - ErrorInvalidParameter: pstcPpsInit == NULL
 */
en_result_t ETH_PPS_Init(uint8_t u8Ch, const stc_eth_pps_config_t *pstcPpsInit)
{
    en_result_t enRet = Ok;
    uint32_t u32ShiftStep = 0UL;
    uint32_t u32ShiftBit = 0UL;
    uint32_t u32RegVal;
    __IO uint32_t *PTP_TMTSECR;
    __IO uint32_t *PTP_TMTNSER;

    if (NULL == pstcPpsInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_PPS_TARGET_CH(u8Ch));
        DDL_ASSERT(IS_ETH_PTP_SUB_SECOND(pstcPpsInit->u32TargetTimeSubSec));
        DDL_ASSERT(IS_ETH_PPS_TARGET_TIME_FUNC(pstcPpsInit->u32TargetTimeFunc));
        DDL_ASSERT(IS_ETH_PPS_OUTPUT_MODE(pstcPpsInit->u32OutputMode));
        DDL_ASSERT(IS_ETH_PPS_OUTPUT_FREQ(pstcPpsInit->u32OutputFreq));
        DDL_ASSERT(IS_ETH_PPS1_COMPLEX_FUNC(u8Ch, pstcPpsInit->u32OutputMode, pstcPpsInit->u32OutputFreq));

        u32RegVal = pstcPpsInit->u32OutputFreq | pstcPpsInit->u32TargetTimeFunc;
        if (ETH_PPS_TARGET_CH1 == u8Ch)
        {
            u32ShiftBit  = ETH_PTP_PPSCTLR_PPSFRE1_POS;
            u32ShiftStep = ETH_PTP_PPS1_TIME_REG_ADDRSHIFT;
        }
        else
        {
            u32RegVal |= pstcPpsInit->u32OutputMode;
        }
        MODIFY_REG32(M4_ETH->PTP_PPSCTLR,
                     ((ETH_PTP_PPSCTLR_PPSFRE0 | ETH_PTP_PPSCTLR_PPSOMD |
                       ETH_PTP_PPSCTLR_TT0SEL) << u32ShiftBit),
                     (u32RegVal << u32ShiftBit));
        /* Set target time registers */
        PTP_TMTSECR = (__IO uint32_t *)ETH_PTP_TMTSECRx(u32ShiftStep);
        PTP_TMTNSER = (__IO uint32_t *)ETH_PTP_TMTNSERx(u32ShiftStep);
        WRITE_REG32(*PTP_TMTSECR, pstcPpsInit->u32TargetTimeSec);
        WRITE_REG32(*PTP_TMTNSER, pstcPpsInit->u32TargetTimeSubSec);
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_eth_pps_config_t to default values.
 * @param  [out] pstcPpsInit                Pointer to a @ref stc_eth_pps_config_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Structure Initialize success
 *           - ErrorInvalidParameter: pstcPpsInit == NULL
 */
en_result_t ETH_PPS_StructInit(stc_eth_pps_config_t *pstcPpsInit)
{
    en_result_t enRet = Ok;

    if (NULL == pstcPpsInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcPpsInit->u32TargetTimeFunc   = ETH_PPS_TARGET_TIME_FUNC_INT_EVENT;
        pstcPpsInit->u32OutputMode       = ETH_PPS_OUTPUT_MODE_SINGLE;
        pstcPpsInit->u32OutputFreq       = ETH_PPS_OUTPUT_ONE_PULSE;
        pstcPpsInit->u32TargetTimeSec    = 0UL;
        pstcPpsInit->u32TargetTimeSubSec = 0UL;
    }

    return enRet;
}

/**
 * @brief  Set PTP Target time function.
 * @param  [in] u8Ch                        PPS output channel
 *         This parameter can be one of the following values:
 *           @arg ETH_PPS_TARGET_CH0:       PPS Channel 0
 *           @arg ETH_PPS_TARGET_CH1:       PPS Channel 1
 * @param  [in] u32Sec                      Target time of Second (Between 0x0 and 0xFFFFFFFF)
 * @param  [in] u32SubSec                   Target time of Subsecond (Between 0x0 and 0x7FFFFFFF)
 * @retval None
 */
void ETH_PPS_SetTargetTime(uint8_t u8Ch, uint32_t u32Sec, uint32_t u32SubSec)
{
    uint32_t u32ShiftStep = 0UL;
    __IO uint32_t *PTP_TMTSECR;
    __IO uint32_t *PTP_TMTNSER;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_PPS_TARGET_CH(u8Ch));
    DDL_ASSERT(IS_ETH_PTP_SUB_SECOND(u32SubSec));

    if (ETH_PPS_TARGET_CH1 == u8Ch)
    {
        u32ShiftStep = ETH_PTP_PPS1_TIME_REG_ADDRSHIFT;
    }
    PTP_TMTSECR = (__IO uint32_t *)ETH_PTP_TMTSECRx(u32ShiftStep);
    PTP_TMTNSER = (__IO uint32_t *)ETH_PTP_TMTNSERx(u32ShiftStep);
    WRITE_REG32(*PTP_TMTSECR, u32Sec);
    WRITE_REG32(*PTP_TMTNSER, u32SubSec);
}

/**
 * @brief  Set PTP Target time function.
 * @param  [in] u8Ch                        PPS output channel
 *         This parameter can be one of the following values:
 *           @arg ETH_PPS_TARGET_CH0:       PPS Channel 0
 *           @arg ETH_PPS_TARGET_CH1:       PPS Channel 1
 * @param  [in] u32Func                     Arrival time trigger the function
 *         This parameter can be one of the following values:
 *           @arg ETH_PPS_TARGET_TIME_FUNC_INT_EVENT:       Interrupt output event
 *           @arg ETH_PPS_TARGET_TIME_FUNC_INT_PPS_EVENT:   Interrupt out event and PPS single output event
 *           @arg ETH_PPS_TARGET_TIME_FUNC_PPS_EVENT:       PPS Single output event
 * @retval None
 */
void ETH_PPS_SetTargetTimeFunc(uint8_t u8Ch, uint32_t u32Func)
{
    uint32_t u32ShiftBit = 0UL;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_PPS_TARGET_CH(u8Ch));
    DDL_ASSERT(IS_ETH_PPS_TARGET_TIME_FUNC(u32Func));

    if (ETH_PPS_TARGET_CH1 == u8Ch)
    {
        u32ShiftBit = ETH_PTP_PPSCTLR_PPSFRE1_POS;
    }
    MODIFY_REG32(M4_ETH->PTP_PPSCTLR, (ETH_PTP_PPSCTLR_TT0SEL << u32ShiftBit), (u32Func << u32ShiftBit));
}

/**
 * @brief  Set PTP PPS0 output mode.
 * @param  [in] u32OutputMode               PPS output mode
 *         This parameter can be one of the following values:
 *           @arg ETH_PPS_OUTPUT_MODE_CONTINUE: Continuous output mode
 *           @arg ETH_PPS_OUTPUT_MODE_SINGLE:   Single output mode
 * @retval None
 */
void ETH_PPS_SetPps0OutputMode(uint32_t u32OutputMode)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_PPS_OUTPUT_MODE(u32OutputMode));

    WRITE_REG32(bM4_ETH->PTP_PPSCTLR_b.PPSOMD, u32OutputMode >> ETH_PTP_PPSCTLR_PPSOMD_POS);
}

/**
 * @brief  Set PTP PPS0 output frequency.
 * @param  [in] u32OutputFreq               PPS output frequency
 *         This parameter can be one of the following values:
 *           @arg ETH_PPS_OUTPUT_FREQ_1HZ:      Ouput pulse is 1HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_2HZ:      Ouput pulse is 2HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_4HZ:      Ouput pulse is 4HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_8HZ:      Ouput pulse is 8HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_16HZ:     Ouput pulse is 16HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_32HZ:     Ouput pulse is 32HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_64HZ:     Ouput pulse is 64HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_128HZ:    Ouput pulse is 128HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_256HZ:    Ouput pulse is 256HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_512HZ:    Ouput pulse is 512HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_1024HZ:   Ouput pulse is 1024HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_2048HZ:   Ouput pulse is 2048HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_4096HZ:   Ouput pulse is 4096HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_8192HZ:   Ouput pulse is 8192HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_16384HZ:  Ouput pulse is 16384HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_32768HZ:  Ouput pulse is 32768HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_ONE_PULSE:     One pulse is generated in single ouput mode
 * @retval None
 */
void ETH_PPS_SetPps0OutputFreq(uint32_t u32OutputFreq)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_PPS_OUTPUT_FREQ(u32OutputFreq));

    MODIFY_REG32(M4_ETH->PTP_PPSCTLR, ETH_PTP_PPSCTLR_PPSFRE0, u32OutputFreq);
}

/**
 * @}
 */

#endif /* DDL_ETH_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
